Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: When allowing CREATE TABLE AS option in SQL Lab, this option forces the table to be created in this schema
vi: Khi cho phép tùy chọn TẠO BẢNG NHƯ trong SQL Lab, tùy chọn này buộc bảng phải được tạo trong schema này

source: If Presto, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them.<br/>If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
vi: Nếu Presto, tất cả các truy vấn trong SQL Lab sẽ được thực thi dưới dạng người dùng đang đăng nhập hiện tại, người đó phải có quyền chạy chúng.<br/>Nếu Hive và hive.server2.enable.doAs được kích hoạt, truy vấn sẽ được thực thi dưới dạng tài khoản dịch vụ, nhưng giả mạo người dùng đang đăng nhập hiện tại thông qua thuộc tính hive.server2.proxy.user.

source: Duration (in seconds) of the caching timeout for charts of this database. A timeout of 0 indicates that the cache never expires. Note this defaults to the global timeout if undefined.
vi: Thời gian (tính bằng giây) của thời gian chờ đợi trong bộ nhớ đệm cho biểu đồ của cơ sở dữ liệu này. Một thời gian chờ 0 chỉ ra rằng bộ nhớ đệm không bao giờ hết hạn. Lưu ý rằng điều này mặc định là thời gian chờ đợi toàn cầu nếu không xác định.

source: If selected, please set the schemas allowed for csv upload in Extra.
vi: Nếu được chọn, vui lòng đặt các schema được cho phép để tải lên csv trong Mở rộng.

source: Expose in SQL Lab
vi: Hiển thị trong SQL Lab

source: Allow CREATE TABLE AS
vi: Cho phép TẠO BẢNG NHƯ

source: Allow CREATE VIEW AS
vi: Cho phép TẠO XEM NHƯ

source: Allow DML
vi: Cho phép DML

source: CTAS Schema
vi: Schema CTAS

source: SQLAlchemy URI
vi: URI SQLAlchemy

source: Chart Cache Timeout
vi: Thời gian chờ đệm biểu đồ

source: Secure Extra
vi: Bổ sung an toàn

source: Root certificate
vi: Chứng chỉ gốc

source: Async Execution
vi: Thực thi bất đồng bộ

source: Impersonate the logged on user
vi: Giả mạo người dùng đã đăng nhập

source: Allow Csv Upload
vi: Cho phép tải lên CSV

source: Extra field cannot be decoded by JSON. %(msg)s
vi: Trường Bổ sung không thể giải mã bằng JSON. %(msg)s

source: Invalid connection string, a valid string usually follows:'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME'<p>Example:'postgresql://user:password@your-postgres-db/database'</p>
vi: Chuỗi kết nối không hợp lệ, một chuỗi hợp lệ thường theo sau: 'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME'<p>Ví dụ: 'postgresql://user:password@your-postgres-db/database'</p>

source: CSV to Database configuration
vi: Cấu hình CSV đến Cơ sở dữ liệu

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for csv uploads. Please contact your Superset Admin.
vi: Schema "%(schema_name)s" của cơ sở dữ liệu "%(database_name)s" không được phép cho tải lên csv. Vui lòng liên hệ với quản trị viên Superset của bạn.

source: Unable to upload CSV file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
vi: Không thể tải lên tệp CSV "%(filename)s" lên bảng "%(table_name)s" trong cơ sở dữ liệu "%(db_name)s". Thông báo lỗi: %(error_msg)s

source: CSV file "%(csv_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
vi: Tệp CSV "%(csv_filename)s" đã được tải lên bảng "%(table_name)s" trong cơ sở dữ liệu "%(db_name)s"

source: Excel to Database configuration
vi: Cấu hình Excel đến Cơ sở dữ liệu

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for excel uploads. Please contact your Superset Admin.
vi: Schema "%(schema_name)s" của cơ sở dữ liệu "%(database_name)s" không được phép cho tải lên excel. Vui lòng liên hệ với quản trị viên Superset của bạn.

source: Unable to upload Excel file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
vi: Không thể tải lên tệp Excel "%(filename)s" lên bảng "%(table_name)s" trong cơ sở dữ liệu "%(db_name)s". Thông báo lỗi: %(error_msg)s

source: Excel file "%(excel_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
vi: Tệp Excel "%(excel_filename)s" đã được tải lên bảng "%(table_name)s" trong cơ sở dữ liệu "%(db_name)s"

source: Columnar to Database configuration
vi: Cấu hình dạng cột đến Cơ sở dữ liệu

source: Multiple file extensions are not allowed for columnar uploads. Please make sure all files are of the same extension.
vi: Không được phép sử dụng nhiều phần mở rộng tệp cho việc tải lên dạng cột. Vui lòng đảm bảo tất cả các tệp đều có cùng một phần mở rộng.

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for columnar uploads. Please contact your Superset Admin.
vi: Schema "%(schema_name)s" của cơ sở dữ liệu "%(database_name)s" không được phép cho tải lên dạng cột. Vui lòng liên hệ với quản trị viên Superset của bạn.

source: Unable to upload Columnar file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
vi: Không thể tải lên tệp dạng cột "%(filename)s" lên bảng "%(table_name)s" trong cơ sở dữ liệu "%(db_name)s". Thông báo lỗi: %(error_msg)s

source: Columnar file "%(columnar_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
vi: Tệp dạng cột "%(columnar_filename)s" đã được tải lên bảng "%(table_name)s" trong cơ sở dữ liệu "%(db_name)s"

source: Request missing data field.
vi: Yêu cầu trường dữ liệu bị thiếu.

source: Duplicate column name(s): %(columns)s
vi: Tên cột trùng lặp: %(columns)s

source: Logs
vi: Nhật ký

source: Show Log
vi: Hiển thị Nhật ký

source: Add Log
vi: Thêm Nhật ký

source: Edit Log
vi: Chỉnh sửa Nhật ký

source: User
vi: Người dùng

source: Action
vi: Hành động

source: Untitled Query
vi: Truy vấn Chưa có Tên

source: Time Range
vi: Phạm vi Thời gian

source: Time Column
vi: Cột Thời gian

source: Time Grain
vi: Thời gian Hạt

source: Time Granularity
vi: Tính chất Hạt Thời gian

source: Time
vi: Thời gian

source: A reference to the [Time] configuration, taking granularity into account
vi: Một tham chiếu đến cấu hình [Thời gian], lấy tính chi tiết vào cân nhắc

source: Aggregate
vi: Tổng hợp

source: Raw records
vi: Bản ghi gốc

source: Category name
vi: Tên Danh mục

source: Total value
vi: Giá trị Tổng

source: Minimum value
vi: Giá trị Tối thiểu

source: Maximum value
vi: Giá trị Tối đa

source: Average value
vi: Giá trị Trung bình

source: Certified by %s
vi: Được chứng nhận bởi %s

source: description
vi: mô tả

source: Changing this control takes effect instantly
vi: Thay đổi điều này sẽ có hiệu lực ngay lập tức

source: Show info tooltip
vi: Hiển thị gợi ý thông tin

source: SQL expression
vi: Biểu thức SQL

source: Column datatype
vi: Kiểu dữ liệu Cột

source: Column name
vi: Tên cột

source: Label
vi: Nhãn

source: Metric name
vi: Tên Chỉ số

source: unknown type icon
vi: biểu tượng loại không xác định

source: function type icon
vi: biểu tượng loại hàm

source: string type icon
vi: biểu tượng loại chuỗi

source: numeric type icon
vi: biểu tượng loại số

source: boolean type icon
vi: biểu tượng loại boolean

source: temporal type icon
vi: biểu tượng loại thời gian

source: Advanced analytics
vi: Phân tích nâng cao

source: This section contains options that allow for advanced analytical post processing of query results
vi: Phần này chứa các tùy chọn cho phép xử lý phân tích nâng cao của kết quả truy vấn

source: Rolling window
vi: Cửa sổ trượt

source: Rolling function
vi: Hàm trượt

source: None
vi: Không

source: Defines a rolling window function to apply, works along with the [Periods] text box
vi: Xác định một hàm cửa sổ trượt để áp dụng, hoạt động cùng với hộp văn bản [Kỳ]

source: Periods
vi: Kỳ

source: Defines the size of the rolling window function, relative to the time granularity selected
vi: Xác định kích thước của hàm cửa sổ trượt, liên quan đến độ chi tiết thời gian được chọn

source: Min periods
vi: Kỳ Tối thiểu

source: The minimum number of rolling periods required to show a value. For instance if you do a cumulative sum on 7 days you may want your "Min Period" to be 7, so that all data points shown are the total of 7 periods. This will hide the "ramp up" taking place over the first 7 periods
vi: Số lượng tối thiểu của các kỳ trượt yêu cầu để hiển thị một giá trị. Ví dụ, nếu bạn thực hiện một tổng tích lũy trong 7 ngày, bạn có thể muốn "Kỳ Tối thiểu" của bạn là 7, để tất cả các điểm dữ liệu được hiển thị là tổng của 7 kỳ. Điều này sẽ ẩn đi "dốc lên" diễn ra qua 7 kỳ đầu tiên

source: Time comparison
vi: So sánh Thời gian

source: Time shift
vi: Dời thời gian

source: 1 day ago
vi: 1 ngày trước

source: 1 week ago
vi: 1 tuần trước

source: 28 days ago
vi: 28 ngày trước

source: 30 days ago
vi: 30 ngày trước

source: 52 weeks ago
vi: 52 tuần trước

source: 1 year ago
vi: 1 năm trước

source: 104 weeks ago
vi: 104 tuần trước

source: 2 years ago
vi: 2 năm trước

source: 156 weeks ago
vi: 156 tuần trước

source: 3 years ago
vi: 3 năm trước

source: Overlay one or more timeseries from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported.
vi: Chồng lớp một hoặc nhiều chuỗi thời gian từ một khoảng thời gian tương đối. Mong đợi các biến thể thời gian tương đối bằng ngôn ngữ tự nhiên (ví dụ: 24 giờ, 7 ngày, 52 tuần, 365 ngày). Hỗ trợ văn bản tự do.

source: Calculation type
vi: Loại Tính toán

source: Actual values
vi: Giá trị Thực tế

source: Difference
vi: Sự khác biệt

source: Percentage change
vi: Thay đổi Phần trăm

source: Ratio
vi: Tỷ lệ

source: How to display time shifts: as individual lines; as the difference between the main time series and each time shift; as the percentage change; or as the ratio between series and time shifts.
vi: Cách hiển thị dời thời gian: làm các dòng cá nhân; là sự khác biệt giữa chuỗi thời gian chính và mỗi dời thời gian; là thay đổi phần trăm; hoặc là tỷ lệ giữa chuỗi và dời thời gian.

source: Rule
vi: Quy tắc

source: 1 minutely frequency
vi: Tần suất mỗi phút 1 lần

source: 1 hourly frequency
vi: Tần suất hàng giờ 1 lần

source: 1 calendar day frequency
vi: Tần suất mỗi ngày dương lịch 1 lần

source: 7 calendar day frequency
vi: Tần suất mỗi 7 ngày dương lịch 1 lần

source: 1 month start frequency
vi: Tần suất bắt đầu mỗi tháng 1 lần

source: 1 month end frequency
vi: Tần suất kết thúc mỗi tháng 1 lần

source: 1 year start frequency
vi: Tần suất bắt đầu mỗi năm 1 lần

source: 1 year end frequency
vi: Tần suất kết thúc mỗi năm 1 lần

source: Pandas resample rule
vi: Quy tắc resample của Pandas

source: Fill method
vi: Phương pháp điền

source: Null imputation
vi: Thay thế Null

source: Zero imputation
vi: Thay thế Zero

source: Linear interpolation
vi: Nội suy tuyến tính

source: Forward values
vi: Giá trị Tiến

source: Backward values
vi: Giá trị Lùi

source: Median values
vi: Giá trị Trung vị

source: Mean values
vi: Giá trị Trung bình

source: Sum values
vi: Tổng giá trị

source: Pandas resample method
vi: Phương pháp resample của Pandas

source: Annotations and Layers
vi: Chú thích và Lớp

source: Left
vi: Trái

source: Top
vi: Trên

source: Chart Title
vi: Tiêu đề Biểu đồ

source: X Axis
vi: Trục X

source: X Axis Title
vi: Tiêu đề Trục X

source: X AXIS TITLE BOTTOM MARGIN
vi: Độ lề Dưới của Tiêu đề Trục X

source: Y Axis
vi: Trục Y

source: Y Axis Title
vi: Tiêu đề Trục Y

source: Y Axis Title Margin
vi: Độ lề của Tiêu đề Trục Y

source: Y Axis Title Position
vi: Vị trí của Tiêu đề Trục Y

source: Query
vi: Truy vấn

source: Predictive Analytics
vi: Phân tích Dự đoán

source: Enable forecast
vi: Kích hoạt dự đoán

source: Enable forecasting
vi: Kích hoạt dự báo

source: Forecast periods
vi: Kỳ dự báo

source: How many periods into the future do we want to predict
vi: Chúng ta muốn dự đoán bao nhiêu kỳ vào tương lai

source: Confidence interval
vi: Khoảng tin cậy

source: Width of the confidence interval. Should be between 0 and 1
vi: Độ rộng của khoảng tin cậy. Nên nằm trong khoảng từ 0 đến 1

source: Yearly seasonality
vi: Mùa vụ hàng năm

source: default
vi: mặc định

source: Yes
vi: Có

source: No
vi: Không

source: Should yearly seasonality be applied. An integer value will specify Fourier order of seasonality.
vi: Có nên áp dụng mùa vụ hàng năm hay không. Một giá trị số nguyên sẽ xác định bậc Fourier của mùa vụ.

source: Weekly seasonality
vi: Mùa vụ hàng tuần

source: Should weekly seasonality be applied. An integer value will specify Fourier order of seasonality.
vi: Có nên áp dụng mùa vụ hàng tuần hay không. Một giá trị số nguyên sẽ xác định bậc Fourier của mùa vụ.

source: Daily seasonality
vi: Mùa vụ hàng ngày

source: Should daily seasonality be applied. An integer value will specify Fourier order of seasonality.
vi: Có nên áp dụng mùa vụ hàng ngày hay không. Một giá trị số nguyên sẽ xác định bậc Fourier của mùa vụ.

source: Time related form attributes
vi: Thuộc tính biểu mẫu liên quan đến Thời gian

source: Datasource & Chart Type
vi: Nguồn dữ liệu và Loại biểu đồ

source: Chart ID
vi: ID của biểu đồ đang hoạt động

source: The id of the active chart
vi: ID của biểu đồ đang hoạt động

source: Cache Timeout (seconds)
vi: Thời gian chờ lưu trữ (giây)

source: The number of seconds before expiring the cache
vi: Số giây trước khi bộ nhớ cache hết hạn

source: URL Parameters
vi: Tham số URL

source: Extra url parameters for use in Jinja templated queries
vi: Tham số URL bổ sung để sử dụng trong các truy vấn được mẫu hóa bằng Jinja

source: Extra Parameters
vi: Tham số Bổ sung

source: Extra parameters that any plugins can choose to set for use in Jinja templated queries
vi: Các tham số bổ sung mà bất kỳ plugin nào cũng có thể chọn để thiết lập cho việc sử dụng trong các truy vấn được mẫu hóa bằng Jinja

source: Color Scheme
vi: Bảng màu

source: Contribution Mode
vi: Chế độ Đóng góp

source: Row
vi: Hàng

source: Series
vi: Loạt

source: Calculate contribution per series or row
vi: Tính toán đóng góp cho mỗi loạt hoặc hàng

source: Y-Axis Sort By
vi: Sắp xếp theo Trục Y

source: X-Axis Sort By
vi: Sắp xếp theo Trục X

source: Decides which column to sort the base axis by.
vi: Quyết định cột nào sẽ sắp xếp trục cơ sở theo.

source: Y-Axis Sort Ascending
vi: Sắp xếp Trục Y tăng dần

source: X-Axis Sort Ascending
vi: Sắp xếp Trục X tăng dần

source: Whether to sort ascending or descending on the base Axis.
vi: Cho dù sắp xếp tăng dần hoặc giảm dần trên Trục cơ sở.

source: Force categorical
vi: Bắt buộc phân loại

source: Treat values as categorical.
vi: Xem giá trị như là phân loại.

source: Decides which measure to sort the base axis by.
vi: Quyết định biện pháp nào sẽ sắp xếp trục cơ sở theo.

source: Dimensions
vi: Chiều

source: Dimensions contain qualitative values such as names, dates, or geographical data. Use dimensions to categorize, segment, and reveal the details in your data. Dimensions affect the level of detail in the view.
vi: Chiều chứa các giá trị chất lượng như tên, ngày tháng hoặc dữ liệu địa lý. Sử dụng chiều để phân loại, phân đoạn và tiết lộ các chi tiết trong dữ liệu của bạn. Chiều ảnh hưởng đến mức độ chi tiết trong chế độ xem.

source: Add dataset columns here to group the pivot table columns.
vi: Thêm các cột tập dữ liệu vào đây để nhóm các cột của bảng xoay.

source: Dimension
vi: Chiều

source: Defines the grouping of entities. Each series is represented by a specific color in the chart.
vi: Xác định nhóm các thực thể. Mỗi loạt được đại diện bởi một màu cụ thể trong biểu đồ.

source: Entity
vi: Thực thể

source: This defines the element to be plotted on the chart
vi: Điều này xác định phần tử cần được vẽ trên biểu đồ

source: Filters
vi: Bộ lọc

source: Select one or many metrics to display. You can use an aggregation function on a column or write custom SQL to create a metric.
vi: Chọn một hoặc nhiều chỉ số để hiển thị. Bạn có thể sử dụng một hàm tổng hợp trên một cột hoặc viết câu lệnh SQL tùy chỉnh để tạo một chỉ số.

source: Select a metric to display. You can use an aggregation function on a column or write custom SQL to create a metric.
vi: Chọn một chỉ số để hiển thị. Bạn có thể sử dụng một hàm tổng hợp trên một cột hoặc viết câu lệnh SQL tùy chỉnh để tạo một chỉ số.

source: Right Axis Metric
vi: Chọn một chỉ số để hiển thị trên trục phải

source: Select a metric to display on the right axis
vi: Chọn một chỉ số để hiển thị trên trục phải

source: Sort by
vi: Sắp xếp theo

source: This metric is used to define row selection criteria (how the rows are sorted) if a series or row limit is present. If not defined, it reverts to the first metric (where appropriate).
vi: Chỉ số này được sử dụng để xác định tiêu chí lựa chọn hàng (cách các hàng được sắp xếp) nếu có một loạt hoặc giới hạn hàng. Nếu không xác định, nó sẽ quay trở lại chỉ số đầu tiên (nếu phù hợp).

source: Bubble Size
vi: Kích thước của bong bóng

source: Metric used to calculate bubble size
vi: Chỉ số được sử dụng để tính toán kích thước của bong bóng

source: The dataset column/metric that returns the values on your chart's x-axis.
vi: Cột/chỉ số của tập dữ liệu trả về các giá trị trên trục x của biểu đồ của bạn.

source: The dataset column/metric that returns the values on your chart's y-axis.
vi: Cột/chỉ số của tập dữ liệu trả về các giá trị trên trục y của biểu đồ của bạn.

source: Color Metric
vi: Chỉ số màu

source: A metric to use for color
vi: Một chỉ số để sử dụng cho màu sắc

source: The time column for the visualization. Note that you can define arbitrary expression that return a DATETIME column in the table. Also note that the filter below is applied against this column or expression
vi: Cột thời gian cho việc trực quan hóa. Lưu ý rằng bạn có thể xác định biểu thức tùy ý trả về một cột DATETIME trong bảng. Cũng lưu ý rằng bộ lọc bên dưới được áp dụng cho cột hoặc biểu thức này.

source: Drop a temporal column here or click
vi: Kéo một cột thời gian vào đây hoặc nhấp chuột

source: Y-axis
vi: Trục Y

source: Dimension to use on y-axis.
vi: Kích thước để sử dụng trên trục y.

source: X-axis
vi: Trục X

source: Dimension to use on x-axis.
vi: Kích thước để sử dụng trên trục x.

source: The type of visualization to display
vi: Loại trực quan hóa để hiển thị

source: Fixed Color
vi: Màu cố định

source: Use this to define a static color for all circles
vi: Sử dụng điều này để xác định một màu cố định cho tất cả các vòng tròn

source: Linear Color Scheme
vi: Bảng màu tuyến tính

source: all
vi: tất cả

source: 5 seconds
vi: 5 giây

source: 30 seconds
vi: 30 giây

source: 1 minute
vi: 1 phút

source: 5 minutes
vi: 5 phút

source: 30 minutes
vi: 30 phút

source: 1 hour
vi: 1 giờ

source: 1 day
vi: 1 ngày

source: 7 days
vi: 7 ngày

source: week
vi: tuần

source: week starting Sunday
vi: tuần bắt đầu từ Chủ Nhật

source: week ending Saturday
vi: tuần kết thúc vào Thứ Bảy

source: month
vi: tháng

source: quarter
vi: quý

source: year
vi: năm

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`, `1 day` or `56 weeks`
vi: Độ tinh tế thời gian cho việc trực quan hóa. Lưu ý bạn có thể gõ và sử dụng ngôn ngữ tự nhiên đơn giản như `10 giây`, `1 ngày` hoặc `56 tuần`

source: Select a time grain for the visualization. The grain is the time interval represented by a single point on the chart.
vi: Chọn một hạt thời gian cho việc trực quan hóa. Hạt là khoảng thời gian được đại diện bởi một điểm duy nhất trên biểu đồ.

source: This control filters the whole chart based on the selected time range. All relative times, e.g. "Last month", "Last 7 days", "now", etc. are evaluated on the server using the server's local time (sans timezone). All tooltips and placeholder times are expressed in UTC (sans timezone). The timestamps are then evaluated by the database using the engine's local timezone. Note one can explicitly set the timezone per the ISO 8601 format if specifying either the start and/or end time.
vi: Bộ điều khiển này lọc toàn bộ biểu đồ dựa trên phạm vi thời gian được chọn. Tất cả các thời gian tương đối, ví dụ: "Tháng trước", "7 ngày qua", "hiện tại", v.v. được đánh giá trên máy chủ bằng cách sử dụng thời gian địa phương của máy chủ (không có múi giờ). Tất cả các chú giải công cụ và thời gian định vị tạm thời được biểu thị dưới dạng UTC (không có múi giờ). Sau đó, các dấu thời gian được đánh giá bởi cơ sở dữ liệu bằng cách sử dụng múi giờ địa phương của máy chủ. Lưu ý rằng người dùng có thể thiết lập múi giờ một cách rõ ràng theo định dạng ISO 8601 nếu chỉ định thời gian bắt đầu và/hoặc kết thúc.

source: Row limit
vi: Số hàng giới hạn.

source: Limits the number of the rows that are computed in the query that is the source of the data used for this chart.
vi: Giới hạn số hàng được tính toán trong truy vấn là nguồn dữ liệu được sử dụng cho biểu đồ này.

source: Sort Descending
vi: Nếu được kích hoạt, điều khiển này sẽ sắp xếp kết quả/giá trị theo thứ tự giảm dần, nếu không, nó sẽ sắp xếp kết quả tăng dần.

source: If enabled, this control sorts the results/values descending, otherwise it sorts the results ascending.
vi: Nếu được kích hoạt, điều khiển này sẽ sắp xếp kết quả/giá trị theo thứ tự giảm dần, nếu không, nó sẽ sắp xếp kết quả tăng dần.

source: Series limit
vi: Giới hạn số lượng chuỗi được hiển thị. Một câu truy vấn phụ ghép (hoặc một pha phụ nếu không hỗ trợ các câu truy vấn phụ) được áp dụng để giới hạn số lượng chuỗi được lấy và hiển thị. Tính năng này hữu ích khi nhóm theo cột có độ kardinal cao, mặc dù nó làm tăng độ phức tạp và chi phí của câu truy vấn.

source: Limits the number of series that get displayed. A joined subquery (or an extra phase where subqueries are not supported) is applied to limit the number of series that get fetched and rendered. This feature is useful when grouping by high cardinality column(s) though does increase the query complexity and cost.
vi: Giới hạn số lượng chuỗi được hiển thị. Một câu truy vấn phụ ghép (hoặc một pha phụ nếu không hỗ trợ các câu truy vấn phụ) được áp dụng để giới hạn số lượng chuỗi được lấy và hiển thị. Tính năng này hữu ích khi nhóm theo cột có độ kardinal cao, mặc dù nó làm tăng độ phức tạp và chi phí của câu truy vấn.

source: Y Axis Format
vi: Định dạng trục Y

source: Currency format
vi: Định dạng tiền tệ

source: Time format
vi: Định dạng thời gian

source: The color scheme for rendering chart
vi: Bảng màu để hiển thị biểu đồ

source: Truncate Metric
vi: Chỉ số cắt

source: Whether to truncate metrics
vi: Cho phép cắt chỉ số hay không

source: Show empty columns
vi: Hiển thị các cột trống

source: D3 format syntax: https://github.com/d3/d3-format
vi: Cú pháp định dạng D3: https://github.com/d3/d3-format

source: Only applies when "Label Type" is set to show values.
vi: Chỉ áp dụng khi "Loại nhãn" được thiết lập để hiển thị giá trị.

source: Only applies when "Label Type" is not set to a percentage.
vi: Chỉ áp dụng khi "Loại nhãn" không được thiết lập thành phần trăm.

source: Adaptive formatting
vi: Định dạng thích ứng

source: Original value
vi: Giá trị gốc

source: Duration in ms (66000 => 1m 6s)
vi: Thời gian trong ms (66000 => 1m 6s)

source: Duration in ms (1.40008 => 1ms 400µs 80ns)
vi: Thời gian trong ms (1.40008 => 1ms 400µs 80ns)

source: D3 time format syntax: https://github.com/d3/d3-time-format
vi: Cú pháp định dạng thời gian D3: https://github.com/d3/d3-time-format

source: Oops! An error occurred!
vi: Rất tiếc! Đã xảy ra lỗi!

source: No results were returned for this query. If you expected results to be returned, ensure any filters are configured properly and the datasource contains data for the selected time range.
vi: Không có kết quả nào được trả về cho truy vấn này. Nếu bạn mong đợi có kết quả được trả về, hãy đảm bảo các bộ lọc được cấu hình đúng và nguồn dữ liệu chứa dữ liệu cho phạm vi thời gian được chọn.
