Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: When specifying SQL, the datasource acts as a view. Superset will use this statement as a subquery while grouping and filtering on the generated parent queries.
vi: Khi chỉ định SQL, nguồn dữ liệu hoạt động như một chế độ xem. Superset sẽ sử dụng câu lệnh này như một câu truy vấn con trong khi nhóm và lọc trên các câu truy vấn cha được tạo ra.

source: Physical
vi: Vật lý

source: The pointer to a physical table (or view). Keep in mind that the chart is associated to this Superset logical table, and this logical table points the physical table referenced here.
vi: Con trỏ đến một bảng vật lý (hoặc chế độ xem). Hãy nhớ rằng biểu đồ được liên kết với bảng logic Superset này, và bảng logic này trỏ đến bảng vật lý được tham chiếu ở đây.

source: Metric Key
vi: Khóa chỉ số

source: This field is used as a unique identifier to attach the metric to charts. It is also used as the alias in the SQL query.
vi: Trường này được sử dụng làm định danh duy nhất để đính kèm chỉ số vào biểu đồ. Nó cũng được sử dụng như một bí danh trong câu truy vấn SQL.

source: D3 format
vi: Định dạng D3

source: Metric currency
vi: Tiền tệ chỉ số

source: Select or type currency symbol
vi: Chọn hoặc nhập ký hiệu tiền tệ

source: Warning
vi: Cảnh báo

source: Optional warning about use of this metric
vi: Cảnh báo tùy chọn về việc sử dụng chỉ số này

source: <new metric>
vi: <chỉ số mới>

source: Be careful.
vi: Hãy cẩn thận.

source: Changing these settings will affect all charts using this dataset, including charts owned by other people.
vi: Thay đổi các thiết lập này sẽ ảnh hưởng đến tất cả các biểu đồ sử dụng tập dữ liệu này, bao gồm cả các biểu đồ được sở hữu bởi người khác.

source: Sync columns from source
vi: Đồng bộ cột từ nguồn

source: Calculated columns
vi: Các cột tính toán

source: This field is used as a unique identifier to attach the calculated dimension to charts. It is also used as the alias in the SQL query.
vi: Trường này được sử dụng làm định danh duy nhất để đính kèm chiều tính toán vào biểu đồ. Nó cũng được sử dụng như một bí danh trong câu truy vấn SQL.

source: <enter SQL expression here>
vi: <Nhập biểu thức SQL vào đây>

source: Settings
vi: Cài đặt

source: The dataset has been saved
vi: Tập dữ liệu đã được lưu

source: Error saving dataset
vi: Lỗi khi lưu tập dữ liệu

source: The dataset configuration exposed here affects all the charts using this dataset. Be mindful that changing settings here may affect other charts in undesirable ways.
vi: Cấu hình tập dữ liệu được tiết lộ ở đây ảnh hưởng đến tất cả các biểu đồ sử dụng tập dữ liệu này. Hãy chú ý rằng thay đổi cài đặt ở đây có thể ảnh hưởng đến các biểu đồ khác một cách không mong muốn.

source: Are you sure you want to save and apply changes?
vi: Bạn có chắc chắn muốn lưu và áp dụng các thay đổi không?

source: Confirm save
vi: Xác nhận lưu

source: Edit Dataset
vi: Chỉnh sửa Tập dữ liệu

source: Use legacy datasource editor
vi: Sử dụng trình chỉnh sửa nguồn dữ liệu cũ

source: This dataset is managed externally, and can't be edited in Superset
vi: Tập dữ liệu này được quản lý từ bên ngoài và không thể chỉnh sửa trong Superset

source: DELETE
vi: XÓA

source: delete
vi: xóa

source: Type "%s" to confirm
vi: Nhập "%s" để xác nhận

source: More
vi: Thêm

source: Click to edit
vi: Nhấp để chỉnh sửa

source: You don't have the rights to alter this title.
vi: Bạn không có quyền chỉnh sửa tiêu đề này.

source: No databases match your search
vi: Không có cơ sở dữ liệu nào phù hợp với tìm kiếm của bạn

source: There are no databases available
vi: Không có cơ sở dữ liệu nào có sẵn

source: Manage your databases
vi: Quản lý cơ sở dữ liệu của bạn

source: here
vi: ở đây

source: Unexpected error
vi: Lỗi không mong đợi

source: This may be triggered by:
vi: Điều này có thể được kích hoạt bởi:

source: %(message)s This may be triggered by: %(issues)s
vi: %(message)s Điều này có thể được kích hoạt bởi: %(issues)s

source: %s Error
vi: Lỗi %s

source: Missing dataset
vi: Tập dữ liệu bị thiếu

source: See more
vi: Xem thêm

source: See less
vi: Xem ít hơn

source: Copy message
vi: Sao chép tin nhắn

source: Details
vi: Chi tiết

source: Authorization needed
vi: Cần phải được ủy quyền

source: Did you mean:
vi: Bạn có ý định là:

source: Parameter error
vi: Lỗi tham số

source: %(subtitle)s This may be triggered by: %(issue)s
vi: %(subtitle)s Điều này có thể được kích hoạt bởi: %(issue)s

source: Timeout error
vi: Lỗi hết thời gian

source: Click to favorite/unfavorite
vi: Nhấp để yêu thích/bỏ yêu thích

source: Cell content
vi: Nội dung ô

source: Hide password.
vi: Ẩn mật khẩu.

source: Show password.
vi: Hiện mật khẩu.

source: Database driver for importing maybe not installed. Visit the Superset documentation page for installation instructions:
vi: Trình điều khiển cơ sở dữ liệu để nhập có thể chưa được cài đặt. Truy cập trang tài liệu Superset để biết hướng dẫn cài đặt:

source: OVERWRITE
vi: GHI ĐÈ

source: Database passwords
vi: Mật khẩu cơ sở dữ liệu

source: %s PASSWORD
vi: MẬT KHẨU %s

source: %s SSH TUNNEL PASSWORD
vi: MẬT KHẨU SSH TUNNEL %s

source: %s SSH TUNNEL PRIVATE KEY
vi: KHÓA RIÊNG TƯ SSH TUNNEL %s

source: %s SSH TUNNEL PRIVATE KEY PASSWORD
vi: MẬT KHẨU KHÓA RIÊNG TƯ SSH TUNNEL %s

source: Overwrite
vi: Ghi đè

source: Import
vi: Nhập

source: Import %s
vi: Nhập %s

source: Select file
vi: Chọn tệp

source: Last Updated %s
vi: Được cập nhật lần cuối %s

source: Sort
vi: Sắp xếp

source: + %s more
vi: + %s nhiều hơn

source: %s Selected
vi: %s Đã chọn

source: Deselect all
vi: Bỏ chọn tất cả

source: Add Tag
vi: Thêm thẻ

source: No results match your filter criteria
vi: Không có kết quả phù hợp với tiêu chí lọc của bạn

source: Try different criteria to display results.
vi: Thử các tiêu chí khác để hiển thị kết quả.

source: clear all filters
vi: xóa tất cả bộ lọc

source: No Data
vi: Không có dữ liệu

source: %s-%s of %s
vi: %s-%s trong số %s

source: Start date
vi: Ngày bắt đầu

source: End date
vi: Ngày kết thúc

source: Type a value
vi: Nhập một giá trị

source: Filter
vi: Bộ lọc

source: Select or type a value
vi: Chọn hoặc nhập một giá trị

source: Last modified
vi: Được sửa đổi lần cuối

source: Modified by
vi: Được sửa đổi bởi

source: Created by
vi: Được tạo bởi

source: Created on
vi: Được tạo vào ngày

source: Menu actions trigger
vi: Các hành động menu kích hoạt

source: Select ...
vi: Chọn ...

source: Filter menu
vi: Menu bộ lọc

source: Reset
vi: Đặt lại

source: No filters
vi: Không có bộ lọc

source: Select all items
vi: Chọn tất cả các mục

source: Search in filters
vi: Tìm kiếm trong bộ lọc

source: Select current page
vi: Chọn trang hiện tại

source: Invert current page
vi: Đảo ngược trang hiện tại

source: Clear all data
vi: Xóa tất cả dữ liệu

source: Select all data
vi: Chọn tất cả dữ liệu

source: Expand row
vi: Mở rộng hàng

source: Collapse row
vi: Thu gọn hàng

source: Click to sort descending
vi: Nhấp để sắp xếp giảm dần

source: Click to sort ascending
vi: Nhấp để sắp xếp tăng dần

source: Click to cancel sorting
vi: Nhấp để hủy sắp xếp

source: List updated
vi: Danh sách đã được cập nhật

source: There was an error loading the tables
vi: Đã xảy ra lỗi khi tải các bảng

source: See table schema
vi: Xem lược đồ bảng

source: Select table or type to search tables
vi: Chọn bảng hoặc nhập để tìm kiếm bảng

source: Force refresh table list
vi: Bắt buộc làm mới danh sách bảng

source: You do not have permission to read tags
vi: Bạn không có quyền đọc các thẻ

source: Timezone selector
vi: Trình chọn múi giờ

source: Failed to save cross-filter scoping
vi: Lưu phạm vi lọc chéo thất bại

source: There is not enough space for this component. Try decreasing its width, or increasing the destination width.
vi: Không đủ không gian cho thành phần này. Hãy thử giảm chiều rộng của nó hoặc tăng chiều rộng đích.

source: Can not move top level tab into nested tabs
vi: Không thể di chuyển tab cấp cao nhất vào tab lồng nhau

source: This chart has been moved to a different filter scope.
vi: Biểu đồ này đã được di chuyển sang phạm vi bộ lọc khác.

source: There was an issue fetching the favorite status of this dashboard.
vi: Đã xảy ra vấn đề khi tải trạng thái yêu thích của báo cáo này.

source: There was an issue favoriting this dashboard.
vi: Đã xảy ra vấn đề khi thêm báo cáo này vào mục yêu thích.

source: This dashboard is now published
vi: Báo cáo này đã được xuất bản

source: This dashboard is now hidden
vi: Báo cáo này đã được ẩn

source: You do not have permissions to edit this dashboard.
vi: Bạn không có quyền chỉnh sửa báo cáo này.

source: [ untitled dashboard ]
vi: [ báo cáo chưa có tiêu đề ]

source: This dashboard was saved successfully.
vi: Báo cáo này đã được lưu thành công.

source: Sorry, an unknown error occurred
vi: Xin lỗi, đã xảy ra một lỗi không xác định

source: Sorry, there was an error saving this dashboard: %s
vi: Xin lỗi, đã xảy ra lỗi khi lưu báo cáo này: %s

source: You do not have permission to edit this dashboard
vi: Bạn không có quyền chỉnh sửa báo cáo này

source: Please confirm the overwrite values.
vi: Vui lòng xác nhận các giá trị ghi đè.

source: You have used all %(historyLength)s undo slots and will not be able to fully undo subsequent actions. You may save your current state to reset the history.
vi: Bạn đã sử dụng tất cả %(historyLength)s khe hoàn tác và sẽ không thể hoàn tác hoàn toàn các hành động tiếp theo. Bạn có thể lưu trạng thái hiện tại của mình để đặt lại lịch sử.

source: Could not fetch all saved charts
vi: Không thể tải tất cả các biểu đồ đã lưu

source: Sorry there was an error fetching saved charts:
vi: Xin lỗi đã xảy ra lỗi khi tải biểu đồ đã lưu:

source: Any color palette selected here will override the colors applied to this dashboard's individual charts
vi: Bất kỳ bảng màu nào được chọn ở đây sẽ ghi đè lên các màu được áp dụng cho các biểu đồ cá nhân của báo cáo này

source: You have unsaved changes.
vi: Bạn có các thay đổi chưa được lưu.

source: Drag and drop components and charts to the dashboard
vi: Kéo và thả các thành phần và biểu đồ vào báo cáo

source: You can create a new chart or use existing ones from the panel on the right
vi: Bạn có thể tạo một biểu đồ mới hoặc sử dụng các biểu đồ hiện có từ báo cáo bên phải

source: Create a new chart
vi: Tạo một biểu đồ mới

source: Drag and drop components to this tab
vi: Kéo và thả các thành phần vào tab này

source: There are no components added to this tab
vi: Không có thành phần nào được thêm vào tab này

source: You can add the components in the edit mode.
vi: Bạn có thể thêm các thành phần trong chế độ chỉnh sửa.

source: There is no chart definition associated with this component, could it have been deleted?
vi: Không có định nghĩa biểu đồ nào được liên kết với thành phần này, có thể đã bị xóa?

source: Delete this container and save to remove this message.
vi: Xóa container này và lưu để loại bỏ thông báo này.

source: Refresh interval saved
vi: Khoảng thời gian làm mới đã được lưu

source: Refresh interval
vi: Khoảng thời gian làm mới

source: Refresh frequency
vi: Tần suất làm mới

source: Are you sure you want to proceed?
vi: Bạn có chắc chắn muốn tiếp tục không?

source: Save for this session
vi: Lưu cho phiên làm việc này

source: You must pick a name for the new dashboard
vi: Bạn phải chọn một tên cho báo cáo mới

source: Save dashboard
vi: Lưu báo cáo

source: Overwrite Dashboard [%s]
vi: Ghi đè báo cáo [%s]

source: Save as:
vi: Lưu như:

source: [dashboard name]
vi: [tên báo cáo]

source: also copy (duplicate) charts
vi: cũng sao chép (nhân bản) biểu đồ

source: viz type
vi: loại viz

source: recent
vi: gần đây

source: Create new chart
vi: Tạo biểu đồ mới

source: Filter your charts
vi: Lọc biểu đồ của bạn

source: Filter charts
vi: Lọc biểu đồ

source: Sort by %s
vi: Sắp xếp theo %s

source: Show only my charts
vi: Chỉ hiển thị biểu đồ của tôi

source: You can choose to display all charts that you have access to or only the ones you own. Your filter selection will be saved and remain active until you choose to change it.
vi: Bạn có thể chọn hiển thị tất cả các biểu đồ mà bạn có quyền truy cập hoặc chỉ những biểu đồ mà bạn sở hữu. Lựa chọn bộ lọc của bạn sẽ được lưu và vẫn hoạt động cho đến khi bạn chọn thay đổi nó.

source: Added
vi: Đã thêm

source: Unknown type
vi: Loại không xác định

source: Viz type
vi: Loại Viz

source: Dataset
vi: Bộ dữ liệu

source: Superset chart
vi: Biểu đồ Superset

source: Check out this chart in dashboard:
vi: Kiểm tra biểu đồ này trong báo cáo:

source: Layout elements
vi: Yếu tố bố trí

source: An error occurred while fetching available CSS templates
vi: Đã xảy ra lỗi khi tải các mẫu CSS có sẵn

source: Load a CSS template
vi: Tải một mẫu CSS

source: Live CSS editor
vi: Trình soạn thảo CSS trực tiếp

source: Collapse tab content
vi: Thu gọn nội dung tab

source: There are no charts added to this dashboard
vi: Không có biểu đồ nào được thêm vào báo cáo này

source: Go to the edit mode to configure the dashboard and add charts
vi: Chuyển sang chế độ chỉnh sửa để cấu hình báo cáo và thêm biểu đồ

source: Changes saved.
vi: Thay đổi đã được lưu.

source: Disable embedding?
vi: Tắt nhúng?

source: This will remove your current embed configuration.
vi: Điều này sẽ loại bỏ cấu hình nhúng hiện tại của bạn.

source: Embedding deactivated.
vi: Nhúng đã được tắt.

source: Sorry, something went wrong. Embedding could not be deactivated.
vi: Xin lỗi, đã xảy ra sự cố. Không thể tắt tính năng nhúng.

source: Sorry, something went wrong. Please try again.
vi: Xin lỗi, đã xảy ra sự cố. Vui lòng thử lại.

source: This dashboard is ready to embed. In your application, pass the following id to the SDK:
vi: Báo cáo này đã sẵn sàng để nhúng. Trong ứng dụng của bạn, chuyển id sau cho SDK:

source: Configure this dashboard to embed it into an external web application.
vi: Cấu hình báo cáo này để nhúng vào ứng dụng web bên ngoài.

source: For further instructions, consult the
vi: Để biết hướng dẫn chi tiết, vui lòng tham khảo

source: Superset Embedded SDK documentation.
vi: tài liệu SDK được nhúng của Superset.

source: Allowed Domains (comma separated)
vi: Các tên miền được phép (phân tách bằng dấu phẩy)

source: A list of domain names that can embed this dashboard. Leaving this field empty will allow embedding from any domain.
vi: Danh sách các tên miền có thể nhúng báo cáo này. Để trống trường này sẽ cho phép nhúng từ bất kỳ tên miền nào.

source: Deactivate
vi: Vô hiệu hóa

source: Save changes
vi: Lưu thay đổi

source: Enable embedding
vi: Bật tính năng nhúng

source: Embed
vi: Nhúng

source: Applied cross-filters (%d)
vi: Áp dụng bộ lọc chéo (%d)

source: Applied filters (%d)
vi: Áp dụng bộ lọc (%d)

source: This dashboard is currently auto refreshing; the next auto refresh will be in %s.
vi: Báo cáo này hiện đang tự làm mới; việc làm mới tự động tiếp theo sẽ diễn ra sau %s.

source: Your dashboard is too large. Please reduce its size before saving it.
vi: Báo cáo của bạn quá lớn. Vui lòng giảm kích thước trước khi lưu.

source: Add the name of the dashboard
vi: Thêm tên của báo cáo

source: Dashboard title
vi: Tiêu đề của báo cáo

source: Undo the action
vi: Hoàn tác hành động

source: Redo the action
vi: Làm lại hành động

source: Discard
vi: Hủy bỏ

source: Refreshing charts
vi: Làm mới biểu đồ

source: Superset dashboard
vi: Báo cáo Superset

source: Check out this dashboard:
vi: Kiểm tra báo cáo này:

source: Refresh dashboard
vi: Làm mới báo cáo

source: Exit fullscreen
vi: Thoát chế độ toàn màn hình

source: Enter fullscreen
vi: Vào chế độ toàn màn hình

source: Edit properties
vi: Chỉnh sửa thuộc tính

source: Edit CSS
vi: Chỉnh sửa CSS

source: Download
vi: Tải xuống

source: Export to PDF
vi: Xuất ra PDF

source: Download as Image
vi: Tải xuống dưới dạng ảnh

source: Share
vi: Chia sẻ

source: Copy permalink to clipboard
vi: Sao chép liên kết cố định vào bảng ghi tạm

source: Share permalink by email
vi: Chia sẻ liên kết cố định qua email

source: Manage email report
vi: Quản lý báo cáo qua email

source: Set filter mapping
vi: Thiết lập ánh xạ bộ lọc

source: Set auto-refresh interval
vi: Thiết lập khoảng thời gian làm mới tự động

source: Confirm overwrite
vi: Xác nhận ghi đè

source: Scroll down to the bottom to enable overwriting changes.
vi: Cuộn xuống dưới cùng để bật tính năng ghi đè thay đổi.

source: Yes, overwrite changes
vi: Có, ghi đè các thay đổi

source: Are you sure you intend to overwrite the following values?
vi: Bạn có chắc chắn muốn ghi đè các giá trị sau?

source: Last Updated %s by %s
vi: Được cập nhật lần cuối vào %s bởi %s

source: Apply
vi: Áp dụng

source: Error
vi: Lỗi

source: A valid color scheme is required
vi: Yêu cầu một bảng màu hợp lệ

source: JSON metadata is invalid!
vi: Dữ liệu JSON không hợp lệ!

source: Dashboard properties updated
vi: Thuộc tính báo cáo đã được cập nhật

source: The dashboard has been saved
vi: Báo cáo đã được lưu

source: Access
vi: Truy cập

source: Owners is a list of users who can alter the dashboard. Searchable by name or username.
vi: Danh sách các chủ sở hữu là những người có thể chỉnh sửa báo cáo. Có thể tìm kiếm bằng tên hoặc tên người dùng.

source: Colors
vi: Màu sắc

source: Roles is a list which defines access to the dashboard. Granting a role access to a dashboard will bypass dataset level checks. If no roles are defined, regular access permissions apply.
vi: Roles là một danh sách xác định quyền truy cập vào báo cáo. Cấp quyền truy cập cho một vai trò vào một báo cáo sẽ bỏ qua các kiểm tra cấp độ dữ liệu. Nếu không có vai trò nào được xác định, quyền truy cập thông thường sẽ được áp dụng.

source: Dashboard properties
vi: Thuộc tính báo cáo

source: This dashboard is managed externally, and can't be edited in Superset
vi: Báo cáo này được quản lý từ bên ngoài và không thể chỉnh sửa trong Superset

source: Basic information
vi: Thông tin cơ bản

source: URL slug
vi: Đường dẫn URL

source: A readable URL for your dashboard
vi: Một URL có thể đọc được cho báo cáo của bạn

source: Certification
vi: Chứng nhận

source: Person or group that has certified this dashboard.
vi: Người hoặc nhóm đã chứng nhận báo cáo này.

source: Any additional detail to show in the certification tooltip.
vi: Bất kỳ chi tiết bổ sung nào để hiển thị trong gợi ý chứng nhận.

source: A list of tags that have been applied to this chart.
vi: Một danh sách các nhãn đã được áp dụng cho biểu đồ này.

source: JSON metadata
vi: Dữ liệu JSON

source: Please DO NOT overwrite the "filter_scopes" key.
vi: Xin đừng ghi đè lên khóa "filter_scopes".

source: Use "%(menuName)s" menu instead.
vi: Sử dụng menu "%(menuName)s" thay vì đó.

source: This dashboard is not published, it will not show up in the list of dashboards. Click here to publish this dashboard.
vi: Báo cáo này chưa được xuất bản, nó sẽ không xuất hiện trong danh sách các báo cáo. Nhấn vào đây để xuất bản báo cáo này.

source: This dashboard is not published which means it will not show up in the list of dashboards. Favorite it to see it there or access it by using the URL directly.
vi: Báo cáo này chưa được xuất bản, điều này có nghĩa là nó sẽ không xuất hiện trong danh sách các báo cáo. Đánh dấu nó là yêu thích để xem nó ở đó hoặc truy cập nó bằng cách sử dụng URL trực tiếp.

source: This dashboard is published. Click to make it a draft.
vi: Báo cáo này đã được xuất bản. Nhấn vào đây để biến nó thành bản nháp.

source: Draft
vi: Bản nháp

source: Annotation layers are still loading.
vi: Các lớp chú thích vẫn đang tải.

source: One ore more annotation layers failed loading.
vi: Một hoặc nhiều lớp chú thích không tải được.

source: This chart applies cross-filters to charts whose datasets contain columns with the same name.
vi: Biểu đồ này áp dụng bộ lọc chéo cho các biểu đồ mà tập dữ liệu của chúng chứa cột có cùng tên.

source: Data refreshed
vi: Dữ liệu đã được làm mới

source: Cached %s
vi: Đã lưu trữ %s

source: Fetched %s
vi: Đã truy xuất %s

source: Query %s: %s
vi: Truy vấn %s: %s

source: Force refresh
vi: Làm mới bắt buộc

source: Hide chart description
vi: Ẩn mô tả biểu đồ

source: Show chart description
vi: Hiển thị mô tả biểu đồ

source: Cross-filtering scoping
vi: Phạm vi lọc chéo

source: View query
vi: Xem truy vấn

source: View as table
vi: Xem dưới dạng bảng

source: Chart Data: %s
vi: Dữ liệu Biểu đồ: %s

source: Share chart by email
vi: Chia sẻ biểu đồ qua email

source: Check out this chart:
vi: Kiểm tra biểu đồ này:

source: Export to .CSV
vi: Xuất ra .CSV

source: Export to Excel
vi: Xuất ra Excel

source: Export to full .CSV
vi: Xuất ra toàn bộ .CSV

source: Export to full Excel
vi: Xuất ra toàn bộ Excel

source: Download as image
vi: Tải xuống dưới dạng hình ảnh

source: Something went wrong.
vi: Đã xảy ra lỗi.

source: Search...
vi: Tìm kiếm...

source: No filter is selected.
vi: Không có bộ lọc nào được chọn.

source: Editing 1 filter:
vi: Đang chỉnh sửa 1 bộ lọc:

source: Batch editing %d filters:
vi: Đang chỉnh sửa %d bộ lọc một lúc:

source: Configure filter scopes
vi: Cấu hình phạm vi bộ lọc

source: There are no filters in this dashboard.
vi: Không có bộ lọc nào trong báo cáo này.

source: Expand all
vi: Mở rộng tất cả

source: Collapse all
vi: Thu gọn tất cả

source: An error occurred while opening Explore
vi: Đã xảy ra lỗi khi mở Khám phá

source: Empty column
vi: Cột trống

source: This markdown component has an error.
vi: Thành phần markdown này có lỗi.

source: This markdown component has an error. Please revert your recent changes.
vi: Thành phần markdown này có lỗi. Vui lòng quay lại các thay đổi gần đây của bạn.

source: Empty row
vi: Dòng trống

source: You can
vi: Bạn có thể

source: create a new chart
vi: tạo một biểu đồ mới

source: or use existing ones from the panel on the right
vi: hoặc sử dụng các biểu đồ hiện có từ báo cáo bên phải

source: You can add the components in the
vi: Bạn có thể thêm các thành phần trong

source: edit mode
vi: chế độ chỉnh sửa

source: Delete dashboard tab?
vi: Xóa tab báo cáo?

source: Deleting a tab will remove all content within it. You may still reverse this action with the
vi: Xóa một tab sẽ xóa tất cả nội dung bên trong nó. Bạn vẫn có thể hoàn tác hành động này với

source: undo
vi: hoàn tác

source: button (cmd + z) until you save your changes.
vi: (cmd + z) cho đến khi bạn lưu các thay đổi của mình.

source: CANCEL
vi: HỦY

source: Divider
vi: Phân cách

source: Header
vi: Tiêu đề

source: Text
vi: Văn bản

source: Tabs
vi: Tab

source: background
vi: nền

source: Preview
vi: Xem trước

source: Sorry, something went wrong. Try again later.
vi: Xin lỗi, đã xảy ra sự cố. Vui lòng thử lại sau.

source: Unknown value
vi: Giá trị không xác định

source: Add/Edit Filters
vi: Thêm/Chỉnh sửa Bộ lọc

source: No filters are currently added to this dashboard.
vi: Hiện không có bộ lọc nào được thêm vào báo cáo này.

source: No global filters are currently added
vi: Hiện không có bộ lọc toàn cầu nào được thêm vào

source: Click on "+Add/Edit Filters" button to create new dashboard filters
vi: Nhấp vào nút "+Thêm/Chỉnh sửa Bộ lọc" để tạo bộ lọc báo cáo mới

source: Apply filters
vi: Áp dụng bộ lọc

source: Clear all
vi: Xóa tất cả

source: Locate the chart
vi: Định vị biểu đồ

source: Cross-filters
vi: Bộ lọc chéo

source: Add custom scoping
vi: Thêm phạm vi tùy chỉnh

source: All charts/global scoping
vi: Tất cả biểu đồ/phạm vi toàn cầu

source: Cross-filtering is not enabled in this dashboard
vi: Bộ lọc chéo không được kích hoạt trong báo cáo này
