Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Whether to sort tooltip by the selected metric in descending order.
vi: Có sắp xếp tooltip theo chỉ số đã chọn theo thứ tự giảm dần hay không.

source: Sort Series By
vi: Sắp xếp dãy theo

source: Based on what should series be ordered on the chart and legend
vi: Dựa trên những gì các dãy được sắp xếp trên biểu đồ và chú giải

source: Sort Series Ascending
vi: Sắp xếp dãy tăng dần

source: Sort series in ascending order
vi: Sắp xếp các dãy theo thứ tự tăng dần

source: Rotate x axis label
vi: Xoay nhãn trục x

source: Input field supports custom rotation. e.g. 30 for 30°
vi: Trường nhập hỗ trợ xoay tùy chỉnh. Ví dụ: 30 cho 30°

source: Series Order
vi: Thứ tự dãy

source: Truncate X Axis
vi: Cắt ngắn trục X

source: Truncate X Axis. Can be overridden by specifying a min or max bound. Only applicable for numercal X axis.
vi: Cắt ngắn trục X. Có thể được ghi đè bằng cách xác định giới hạn tối thiểu hoặc tối đa. Chỉ áp dụng cho trục X số.

source: X Axis Bounds
vi: Giới hạn trục X

source: Bounds for numerical X axis. Not applicable for temporal or categorical axes. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
vi: Giới hạn cho trục X số. Không áp dụng cho các trục thời gian hoặc phân loại. Khi để trống, các giới hạn được xác định động dựa trên min/max của dữ liệu. Lưu ý rằng tính năng này chỉ mở rộng phạm vi trục. Nó sẽ không thu hẹp phạm vi dữ liệu.

source: Minor ticks
vi: Vạch phụ

source: Show minor ticks on axes.
vi: Hiển thị các vạch phụ trên trục.

source: Make the x-axis categorical
vi: Làm cho trục x phân loại

source: Last available value seen on %s
vi: Giá trị có sẵn cuối cùng được nhìn thấy vào %s

source: Not up to date
vi: Không cập nhật

source: No data
vi: Không có dữ liệu

source: No data after filtering or data is NULL for the latest time record
vi: Không có dữ liệu sau khi lọc hoặc dữ liệu là NULL cho bản ghi thời gian mới nhất

source: Try applying different filters or ensuring your datasource has data
vi: Thử áp dụng các bộ lọc khác hoặc đảm bảo nguồn dữ liệu của bạn có dữ liệu

source: Big Number Font Size
vi: Kích thước phông chữ số lớn

source: Tiny
vi: Nhỏ xíu

source: Small
vi: Nhỏ

source: Normal
vi: Bình thường

source: Large
vi: Lớn

source: Huge
vi: Khổng lồ

source: Subheader Font Size
vi: Kích thước phông chữ tiêu đề phụ

source: Data for %s
vi: Dữ liệu cho %s

source: Value difference between the time periods
vi: Chênh lệch giá trị giữa các khoảng thời gian

source: Percentage difference between the time periods
vi: Chênh lệch phần trăm giữa các khoảng thời gian

source: Range for Comparison
vi: Phạm vi để so sánh

source: Set the time range that will be used for the comparison metrics. For example, "Year" will compare to the same dates one year earlier. Use "Inherit range from time filters" to shift the comparison time rangeby the same length as your time range and use "Custom" to set a custom comparison range.
vi: Đặt phạm vi thời gian sẽ được sử dụng cho các chỉ số so sánh. Ví dụ: "Năm" sẽ so sánh với cùng ngày một năm trước đó. Sử dụng "Kế thừa phạm vi từ bộ lọc thời gian" để thay đổi phạm vi thời gian so sánh bằng cùng chiều dài với phạm vi thời gian của bạn và sử dụng "Tùy chỉnh" để đặt phạm vi so sánh tùy chỉnh.

source: Filters for Comparison
vi: Bộ lọc để so sánh

source: Percent Difference format
vi: Định dạng chênh lệch phần trăm

source: Comparison font size
vi: Kích thước phông chữ so sánh

source: Add color for positive/negative change
vi: Thêm màu cho thay đổi tích cực/tiêu cực

source: color scheme for comparison
vi: bảng màu cho so sánh

source: Adds color to the chart symbols based on the positive or negative change from the comparison value.
vi: Thêm màu vào các biểu tượng biểu đồ dựa trên thay đổi tích cực hoặc tiêu cực so với giá trị so sánh.

source: Big Number with Time Period Comparison
vi: Số lớn với so sánh khoảng thời gian

source: Display settings
vi: Cài đặt hiển thị

source: Subheader
vi: Tiêu đề phụ

source: Description text that shows up below your Big Number
vi: Văn bản mô tả xuất hiện dưới Số lớn của bạn

source: Date format
vi: Định dạng ngày

source: Force date format
vi: Buộc định dạng ngày

source: Use date formatting even when metric value is not a timestamp
vi: Sử dụng định dạng ngày ngay cả khi giá trị chỉ số không phải là dấu thời gian

source: Conditional Formatting
vi: Định dạng có điều kiện

source: Apply conditional color formatting to metric
vi: Áp dụng định dạng màu có điều kiện cho chỉ số

source: Showcases a single metric front-and-center. Big number is best used to call attention to a KPI or the one thing you want your audience to focus on.
vi: Trình bày một chỉ số duy nhất nổi bật ở trung tâm. Số lớn được sử dụng tốt nhất để thu hút sự chú ý đến một KPI hoặc điều duy nhất bạn muốn khán giả tập trung vào.

source: A Big Number
vi: Một số lớn

source: With a subheader
vi: Với tiêu đề phụ

source: Big Number
vi: Số lớn

source: Comparison Period Lag
vi: Độ trễ khoảng thời gian so sánh

source: Based on granularity, number of time periods to compare against
vi: Dựa trên độ chi tiết, số lượng khoảng thời gian để so sánh

source: Comparison suffix
vi: Hậu tố so sánh

source: Suffix to apply after the percentage display
vi: Hậu tố áp dụng sau khi hiển thị phần trăm

source: Show Timestamp
vi: Hiển thị dấu thời gian

source: Whether to display the timestamp
vi: Có hiển thị dấu thời gian hay không

source: Show Trend Line
vi: Hiển thị đường xu hướng

source: Whether to display the trend line
vi: Có hiển thị đường xu hướng hay không

source: Start y-axis at 0
vi: Bắt đầu trục y tại 0

source: Start y-axis at zero. Uncheck to start y-axis at minimum value in the data.
vi: Bắt đầu trục y tại điểm không. Bỏ chọn để bắt đầu trục y tại giá trị nhỏ nhất trong dữ liệu.

source: Fix to selected Time Range
vi: Cố định vào phạm vi thời gian đã chọn

source: Fix the trend line to the full time range specified in case filtered results do not include the start or end dates
vi: Cố định đường xu hướng vào toàn bộ phạm vi thời gian được chỉ định trong trường hợp kết quả lọc không bao gồm ngày bắt đầu hoặc kết thúc

source: TEMPORAL X-AXIS
vi: TRỤC X THỜI GIAN

source: Showcases a single number accompanied by a simple line chart, to call attention to an important metric along with its change over time or other dimension.
vi: Trình bày một số duy nhất kèm theo biểu đồ đường đơn giản, để thu hút sự chú ý đến một chỉ số quan trọng cùng với sự thay đổi của nó theo thời gian hoặc các chiều khác.

source: Big Number with Trendline
vi: Số lớn với đường xu hướng

source: Whisker/outlier options
vi: Tùy chọn vạch phụ/ngoại lai

source: Determines how whiskers and outliers are calculated.
vi: Xác định cách tính toán vạch phụ và ngoại lai.

source: Min/max (no outliers)
vi: Min/max (không có ngoại lai)

source: Categories to group by on the x-axis.
vi: Danh mục để nhóm theo trên trục x.

source: Distribute across
vi: Phân phối qua

source: Columns to calculate distribution across.
vi: Các cột để tính toán phân phối qua.

source: Also known as a box and whisker plot, this visualization compares the distributions of a related metric across multiple groups. The box in the middle emphasizes the mean, median, and inner 2 quartiles. The whiskers around each box visualize the min, max, range, and outer 2 quartiles.
vi: Còn được gọi là biểu đồ hộp và vạch phụ, hình ảnh này so sánh sự phân phối của một chỉ số liên quan qua nhiều nhóm. Hộp ở giữa nhấn mạnh giá trị trung bình, trung vị và 2 phân vị trong. Các vạch phụ xung quanh mỗi hộp hiển thị giá trị min, max, phạm vi và 2 phân vị ngoài.

source: Bubble size number format
vi: Định dạng số kích thước bong bóng

source: Bubble Opacity
vi: Độ mờ bong bóng

source: Opacity of bubbles, 0 means completely transparent, 1 means opaque
vi: Độ mờ của bong bóng, 0 có nghĩa là hoàn toàn trong suốt, 1 có nghĩa là không trong suốt

source: X AXIS TITLE MARGIN
vi: LỀ TIÊU ĐỀ TRỤC X

source: Logarithmic x-axis
vi: Trục x logarit

source: Rotate y axis label
vi: Xoay nhãn trục y

source: Y AXIS TITLE MARGIN
vi: LỀ TIÊU ĐỀ TRỤC Y

source: Logarithmic y-axis
vi: Trục y logarit

source: Truncate Y Axis
vi: Cắt ngắn trục Y

source: Truncate Y Axis. Can be overridden by specifying a min or max bound.
vi: Cắt ngắn trục Y. Có thể được ghi đè bằng cách xác định giới hạn tối thiểu hoặc tối đa.

source: % calculation
vi: Tính toán %

source: Display percents in the label and tooltip as the percent of the total value, from the first step of the funnel, or from the previous step in the funnel.
vi: Hiển thị phần trăm trong nhãn và tooltip dưới dạng phần trăm của giá trị tổng, từ bước đầu tiên của phễu, hoặc từ bước trước trong phễu.

source: Calculate from first step
vi: Tính toán từ bước đầu tiên

source: Calculate from previous step
vi: Tính toán từ bước trước

source: Percent of total
vi: Phần trăm của tổng

source: Labels
vi: Nhãn

source: Label Contents
vi: Nội dung nhãn

source: Value and Percentage
vi: Giá trị và Phần trăm

source: What should be shown as the label
vi: Những gì nên hiển thị dưới dạng nhãn

source: Tooltip Contents
vi: Nội dung Tooltip

source: What should be shown as the tooltip label
vi: Những gì nên hiển thị dưới dạng nhãn tooltip

source: Whether to display the labels.
vi: Có hiển thị các nhãn hay không.

source: Show Tooltip Labels
vi: Hiển thị nhãn Tooltip

source: Whether to display the tooltip labels.
vi: Có hiển thị các nhãn tooltip hay không.

source: Showcases how a metric changes as the funnel progresses. This classic chart is useful for visualizing drop-off between stages in a pipeline or lifecycle.
vi: Trình bày cách một chỉ số thay đổi khi phễu tiến triển. Biểu đồ cổ điển này hữu ích để hình dung sự giảm bớt giữa các giai đoạn trong một quy trình hoặc vòng đời.

source: Funnel Chart
vi: Biểu đồ Phễu

source: Sequential
vi: Tuần tự

source: Columns to group by
vi: Các cột để nhóm theo

source: General
vi: Chung

source: Min
vi: Tối thiểu

source: Minimum value on the gauge axis
vi: Giá trị tối thiểu trên trục đo

source: Max
vi: Tối đa

source: Maximum value on the gauge axis
vi: Giá trị tối đa trên trục đo

source: Start angle
vi: Góc bắt đầu

source: Angle at which to start progress axis
vi: Góc để bắt đầu trục tiến độ

source: End angle
vi: Góc kết thúc

source: Angle at which to end progress axis
vi: Góc để kết thúc trục tiến độ

source: Font size
vi: Kích thước phông chữ

source: Font size for axis labels, detail value and other text elements
vi: Kích thước phông chữ cho nhãn trục, giá trị chi tiết và các yếu tố văn bản khác

source: Value format
vi: Định dạng giá trị

source: Additional text to add before or after the value, e.g. unit
vi: Văn bản bổ sung để thêm vào trước hoặc sau giá trị, ví dụ như đơn vị

source: Show pointer
vi: Hiển thị con trỏ

source: Whether to show the pointer
vi: Có hiển thị con trỏ hay không

source: Animation
vi: Hoạt hình

source: Whether to animate the progress and the value or just display them
vi: Có nên tạo hoạt hình cho tiến độ và giá trị hay chỉ hiển thị chúng

source: Axis
vi: Trục

source: Show axis line ticks
vi: Hiển thị vạch trên trục

source: Whether to show minor ticks on the axis
vi: Có hiển thị vạch nhỏ trên trục hay không

source: Show split lines
vi: Hiển thị các đường phân tách

source: Whether to show the split lines on the axis
vi: Có hiển thị các đường phân tách trên trục hay không

source: Split number
vi: Số đoạn phân tách

source: Number of split segments on the axis
vi: Số đoạn phân tách trên trục

source: Progress
vi: Tiến độ

source: Show progress
vi: Hiển thị tiến độ

source: Whether to show the progress of gauge chart
vi: Có hiển thị tiến độ của biểu đồ đo hay không

source: Overlap
vi: Chồng lấp

source: Whether the progress bar overlaps when there are multiple groups of data
vi: Có nên chồng lấp thanh tiến độ khi có nhiều nhóm dữ liệu

source: Round cap
vi: Đầu tròn

source: Style the ends of the progress bar with a round cap
vi: Tạo kiểu đầu tròn cho các đầu của thanh tiến độ

source: Intervals
vi: Khoảng

source: Interval bounds
vi: Giới hạn khoảng

source: Comma-separated interval bounds, e.g. 2,4,5 for intervals 0-2, 2-4 and 4-5. Last number should match the value provided for MAX.
vi: Giới hạn khoảng cách nhau bằng dấu phẩy, ví dụ 2,4,5 cho các khoảng 0-2, 2-4 và 4-5. Số cuối cùng nên khớp với giá trị được cung cấp cho MAX.

source: Interval colors
vi: Màu khoảng

source: Comma-separated color picks for the intervals, e.g. 1,2,4. Integers denote colors from the chosen color scheme and are 1-indexed. Length must be matching that of interval bounds.
vi: Các màu khoảng cách nhau bằng dấu phẩy, ví dụ 1,2,4. Số nguyên biểu thị các màu từ bảng màu đã chọn và được đánh số từ 1. Chiều dài phải khớp với giới hạn khoảng.

source: Uses a gauge to showcase progress of a metric towards a target. The position of the dial represents the progress and the terminal value in the gauge represents the target value.
vi: Sử dụng đồng hồ đo để trình bày tiến độ của một chỉ số hướng tới mục tiêu. Vị trí của kim đồng hồ đại diện cho tiến độ và giá trị cuối cùng trong đồng hồ đo đại diện cho giá trị mục tiêu.

source: Gauge Chart
vi: Biểu đồ đo

source: Name of the source nodes
vi: Tên của các nút nguồn

source: Name of the target nodes
vi: Tên của các nút đích

source: Source category
vi: Danh mục nguồn

source: The category of source nodes used to assign colors. If a node is associated with more than one category, only the first will be used.
vi: Danh mục của các nút nguồn được sử dụng để gán màu. Nếu một nút liên kết với nhiều danh mục, chỉ danh mục đầu tiên sẽ được sử dụng.

source: Target category
vi: Danh mục đích

source: Category of target nodes
vi: Danh mục của các nút đích

source: Chart options
vi: Tùy chọn biểu đồ

source: Layout
vi: Bố cục

source: Graph layout
vi: Bố cục đồ thị

source: Force
vi: Lực

source: Layout type of graph
vi: Loại bố cục đồ thị

source: Edge symbols
vi: Ký hiệu cạnh

source: Symbol of two ends of edge line
vi: Ký hiệu của hai đầu của đường cạnh

source: None -> None
vi: Không -> Không

source: None -> Arrow
vi: Không -> Mũi tên

source: Circle -> Arrow
vi: Vòng tròn -> Mũi tên

source: Circle -> Circle
vi: Vòng tròn -> Vòng tròn

source: Enable node dragging
vi: Cho phép kéo nút

source: Whether to enable node dragging in force layout mode.
vi: Có cho phép kéo nút trong chế độ bố cục lực hay không.

source: Enable graph roaming
vi: Cho phép di chuyển đồ thị

source: Disabled
vi: Vô hiệu hóa

source: Scale only
vi: Chỉ thay đổi kích thước

source: Move only
vi: Chỉ di chuyển

source: Scale and Move
vi: Thay đổi kích thước và Di chuyển

source: Whether to enable changing graph position and scaling.
vi: Có cho phép thay đổi vị trí và thay đổi kích thước đồ thị hay không.

source: Node select mode
vi: Chế độ chọn nút

source: Single
vi: Đơn

source: Multiple
vi: Nhiều

source: Allow node selections
vi: Cho phép chọn nút

source: Label threshold
vi: Ngưỡng nhãn

source: Minimum value for label to be displayed on graph.
vi: Giá trị tối thiểu để nhãn được hiển thị trên đồ thị.

source: Node size
vi: Kích thước nút

source: Median node size, the largest node will be 4 times larger than the smallest
vi: Kích thước trung bình của nút, nút lớn nhất sẽ lớn gấp 4 lần nút nhỏ nhất

source: Edge width
vi: Độ rộng cạnh

source: Median edge width, the thickest edge will be 4 times thicker than the thinnest.
vi: Độ rộng trung bình của cạnh, cạnh dày nhất sẽ dày gấp 4 lần cạnh mỏng nhất.

source: Edge length
vi: Chiều dài cạnh

source: Edge length between nodes
vi: Chiều dài cạnh giữa các nút

source: Gravity
vi: Lực hấp dẫn

source: Strength to pull the graph toward center
vi: Lực kéo đồ thị về phía trung tâm

source: Repulsion
vi: Lực đẩy

source: Repulsion strength between nodes
vi: Lực đẩy giữa các nút

source: Friction
vi: Ma sát

source: Friction between nodes
vi: Ma sát giữa các nút

source: Displays connections between entities in a graph structure. Useful for mapping relationships and showing which nodes are important in a network. Graph charts can be configured to be force-directed or circulate. If your data has a geospatial component, try the deck.gl Arc chart.
vi: Hiển thị các kết nối giữa các thực thể trong cấu trúc đồ thị. Hữu ích để lập bản đồ mối quan hệ và hiển thị các nút quan trọng trong một mạng lưới. Các biểu đồ đồ thị có thể được cấu hình để được hướng lực hoặc tuần hoàn. Nếu dữ liệu của bạn có thành phần không gian địa lý, hãy thử biểu đồ deck.gl Arc.

source: Graph Chart
vi: Biểu đồ Đồ thị

source: Structural
vi: Cấu trúc

source: Legend Type
vi: Loại chú giải

source: Piecewise
vi: Từng phần

source: Hard value bounds applied for color coding.
vi: Giới hạn giá trị cứng áp dụng cho mã màu.

source: Y-Axis
vi: Trục Y

source: Whether to sort descending or ascending
vi: Có sắp xếp theo thứ tự giảm dần hoặc tăng dần hay không

source: Series type
vi: Loại chuỗi

source: Smooth Line
vi: Đường mịn

source: Step - start
vi: Bước - bắt đầu

source: Step - middle
vi: Bước - giữa

source: Step - end
vi: Bước - kết thúc

source: Series chart type (line, bar etc)
vi: Loại biểu đồ chuỗi (đường, cột, v.v.)

source: Stack series
vi: Chuỗi xếp chồng

source: Area chart
vi: Biểu đồ vùng

source: Draw area under curves. Only applicable for line types.
vi: Vẽ vùng dưới các đường cong. Chỉ áp dụng cho các loại đường.

source: Opacity of area chart.
vi: Độ mờ của biểu đồ vùng.

source: Marker
vi: Ký hiệu

source: Draw a marker on data points. Only applicable for line types.
vi: Vẽ ký hiệu trên các điểm dữ liệu. Chỉ áp dụng cho các loại đường.

source: Marker size
vi: Kích thước ký hiệu

source: Size of marker. Also applies to forecast observations.
vi: Kích thước của ký hiệu. Cũng áp dụng cho các quan sát dự báo.

source: Primary
vi: Chính

source: Secondary
vi: Phụ

source: Primary or secondary y-axis
vi: Trục y chính hoặc phụ

source: Shared query fields
vi: Trường truy vấn chia sẻ

source: Query A
vi: Truy vấn A

source: Advanced analytics Query A
vi: Truy vấn phân tích nâng cao A

source: Query B
vi: Truy vấn B

source: Advanced analytics Query B
vi: Truy vấn phân tích nâng cao B

source: Data Zoom
vi: Thu phóng dữ liệu

source: Enable data zooming controls
vi: Kích hoạt các điều khiển thu phóng dữ liệu

source: Minor Split Line
vi: Đường phân tách nhỏ

source: Draw split lines for minor y-axis ticks
vi: Vẽ các đường phân tách cho các vạch nhỏ trên trục y

source: Primary y-axis Bounds
vi: Giới hạn trục y chính

source: Bounds for the primary Y-axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
vi: Giới hạn cho trục Y chính. Khi để trống, giới hạn sẽ được xác định động dựa trên giá trị tối thiểu/tối đa của dữ liệu. Lưu ý rằng tính năng này chỉ mở rộng phạm vi trục. Nó sẽ không thu hẹp phạm vi dữ liệu.

source: Primary y-axis format
vi: Định dạng trục y chính

source: Logarithmic scale on primary y-axis
vi: Thang đo logarit trên trục y chính

source: Secondary y-axis Bounds
vi: Giới hạn trục y phụ

source: Bounds for the secondary Y-axis. Only works when Independent Y-axis bounds are enabled. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
vi: Giới hạn cho trục Y phụ. Chỉ hoạt động khi giới hạn trục Y độc lập được kích hoạt. Khi để trống, giới hạn sẽ được xác định động dựa trên giá trị tối thiểu/tối đa của dữ liệu. Lưu ý rằng tính năng này chỉ mở rộng phạm vi trục. Nó sẽ không thu hẹp phạm vi dữ liệu.

source: Secondary y-axis format
vi: Định dạng trục y phụ

source: Secondary currency format
vi: Định dạng tiền tệ phụ

source: Secondary y-axis title
vi: Tiêu đề trục y phụ

source: Logarithmic scale on secondary y-axis
vi: Thang đo logarit trên trục y phụ

source: Visualize two different series using the same x-axis. Note that both series can be visualized with a different chart type (e.g. 1 using bars and 1 using a line).
vi: Hiển thị hai chuỗi khác nhau bằng cách sử dụng cùng một trục x. Lưu ý rằng cả hai chuỗi có thể được hiển thị bằng một loại biểu đồ khác nhau (ví dụ: 1 sử dụng cột và 1 sử dụng đường).

source: Mixed Chart
vi: Biểu đồ kết hợp

source: Put the labels outside of the pie?
vi: Đặt các nhãn bên ngoài biểu đồ tròn?

source: Label Line
vi: Đường nhãn

source: Draw line from Pie to label when labels outside?
vi: Vẽ đường từ biểu đồ tròn đến nhãn khi nhãn ở ngoài?

source: Show Total
vi: Hiển thị tổng

source: Whether to display the aggregate count
vi: Có hiển thị tổng số lượng hay không

source: Pie shape
vi: Hình dạng biểu đồ tròn

source: Outer Radius
vi: Bán kính ngoài

source: Outer edge of Pie chart
vi: Cạnh ngoài của biểu đồ tròn

source: Inner Radius
vi: Bán kính trong

source: Inner radius of donut hole
vi: Bán kính trong của lỗ donut

source: The classic. Great for showing how much of a company each investor gets, what demographics follow your blog, or what portion of the budget goes to the military industrial complex. Pie charts can be difficult to interpret precisely. If clarity of relative proportion is important, consider using a bar or other chart type instead.
vi: Kinh điển. Tuyệt vời để hiển thị mỗi nhà đầu tư nhận được bao nhiêu phần của công ty, những nhân khẩu học nào theo dõi blog của bạn hoặc phần ngân sách nào dành cho phức hợp công nghiệp quân sự. Biểu đồ tròn có thể khó diễn giải chính xác. Nếu độ rõ ràng của tỷ lệ tương đối là quan trọng, hãy cân nhắc sử dụng biểu đồ cột hoặc loại biểu đồ khác.

source: Pie Chart
vi: Biểu đồ tròn

source: Total: %s
vi: Tổng: %s

source: The maximum value of metrics. It is an optional configuration
vi: Giá trị tối đa của các chỉ số. Đây là cấu hình tùy chọn

source: Label position
vi: Vị trí nhãn

source: Customize Metrics
vi: Tùy chỉnh chỉ số

source: Further customize how to display each metric
vi: Tùy chỉnh thêm cách hiển thị mỗi chỉ số

source: Circle radar shape
vi: Hình radar tròn

source: Radar render type, whether to display 'circle' shape.
vi: Loại hiển thị radar, có hiển thị hình 'tròn' hay không.

source: Visualize a parallel set of metrics across multiple groups. Each group is visualized using its own line of points and each metric is represented as an edge in the chart.
vi: Hiển thị một tập hợp chỉ số song song trên nhiều nhóm. Mỗi nhóm được hiển thị bằng dòng điểm riêng của nó và mỗi chỉ số được biểu diễn như một cạnh trong biểu đồ.

source: Radar Chart
vi: Biểu đồ Radar

source: Primary Metric
vi: Chỉ số chính

source: The primary metric is used to define the arc segment sizes
vi: Chỉ số chính được sử dụng để xác định kích thước của các đoạn cung

source: Secondary Metric
vi: Chỉ số phụ

source: [optional] this secondary metric is used to define the color as a ratio against the primary metric. When omitted, the color is categorical and based on labels
vi: [tùy chọn] chỉ số phụ này được sử dụng để xác định màu sắc như một tỷ lệ so với chỉ số chính. Khi bị bỏ qua, màu sắc là phân loại và dựa trên các nhãn

source: When only a primary metric is provided, a categorical color scale is used.
vi: Khi chỉ có một chỉ số chính được cung cấp, một thang màu phân loại được sử dụng.

source: When a secondary metric is provided, a linear color scale is used.
vi: Khi có một chỉ số phụ được cung cấp, một thang màu tuyến tính được sử dụng.

source: Hierarchy
vi: Hệ thống phân cấp

source: Sets the hierarchy levels of the chart. Each level is represented by one ring with the innermost circle as the top of the hierarchy.
vi: Thiết lập các cấp bậc của biểu đồ. Mỗi cấp được biểu thị bằng một vòng với vòng trong cùng là đỉnh của hệ thống phân cấp.
