Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Form data not found in cache, reverting to chart metadata.
vi: Không tìm thấy dữ liệu biểu mẫu trong bộ nhớ đệm, chuyển về siêu dữ liệu biểu đồ.

source: Form data not found in cache, reverting to dataset metadata.
vi: Không tìm thấy dữ liệu biểu mẫu trong bộ nhớ đệm, chuyển về siêu dữ liệu tập dữ liệu.

source: [Missing Dataset]
vi: [Thiếu Tập dữ liệu]

source: Saved queries could not be deleted.
vi: Không thể xóa các truy vấn đã lưu.

source: Saved query not found.
vi: Không tìm thấy truy vấn đã lưu.

source: Import saved query failed for an unknown reason.
vi: Nhập truy vấn đã lưu thất bại vì lý do không xác định.

source: Saved query parameters are invalid.
vi: Tham số truy vấn đã lưu không hợp lệ.

source: Alert query returned more than one row. %(num_rows)s rows returned
vi: Truy vấn cảnh báo trả về nhiều hơn một hàng. %(num_rows)s hàng đã được trả về

source: Alert query returned more than one column. %(num_cols)s columns returned
vi: Truy vấn cảnh báo trả về nhiều hơn một cột. %(num_cols)s cột đã được trả về

source: An error occurred when running alert query
vi: Đã xảy ra lỗi khi chạy truy vấn cảnh báo

source: Invalid tab ids: %s(tab_ids)
vi: ID tab không hợp lệ: %s(tab_ids)

source: Dashboard does not exist
vi: Báo cáo không tồn tại

source: Chart does not exist
vi: Biểu đồ không tồn tại

source: Database is required for alerts
vi: Cơ sở dữ liệu là bắt buộc cho các cảnh báo

source: Type is required
vi: Loại là bắt buộc

source: Choose a chart or dashboard not both
vi: Chọn một biểu đồ hoặc báo cáo, không phải cả hai

source: Must choose either a chart or a dashboard
vi: Phải chọn hoặc một biểu đồ hoặc một báo cáo

source: Please save your chart first, then try creating a new email report.
vi: Vui lòng lưu biểu đồ của bạn trước, sau đó thử tạo một báo cáo email mới.

source: Please save your dashboard first, then try creating a new email report.
vi: Vui lòng lưu báo cáo của bạn trước, sau đó thử tạo một báo cáo email mới.

source: Report Schedule parameters are invalid.
vi: Tham số Lịch biểu báo cáo không hợp lệ.

source: Report Schedule could not be created.
vi: Không thể tạo Lịch biểu báo cáo.

source: Report Schedule could not be updated.
vi: Không thể cập nhật Lịch biểu báo cáo.

source: Report Schedule not found.
vi: Không tìm thấy Lịch biểu báo cáo.

source: Report Schedule delete failed.
vi: Xóa Lịch biểu báo cáo thất bại.

source: Report Schedule log prune failed.
vi: Tỉa nhật ký Lịch biểu báo cáo thất bại.

source: Report Schedule execution failed when generating a screenshot.
vi: Thực thi Lịch biểu báo cáo thất bại khi tạo ảnh chụp màn hình.

source: Report Schedule execution failed when generating a pdf.
vi: Thực thi Lịch biểu báo cáo thất bại khi tạo PDF.

source: Report Schedule execution failed when generating a csv.
vi: Thực thi Lịch biểu báo cáo thất bại khi tạo CSV.

source: Report Schedule execution failed when generating a dataframe.
vi: Thực thi Lịch biểu báo cáo thất bại khi tạo dataframe.

source: Report Schedule execution got an unexpected error.
vi: Thực thi Lịch biểu báo cáo gặp lỗi không mong đợi.

source: Report Schedule is still working, refusing to re-compute.
vi: Lịch biểu báo cáo vẫn đang hoạt động, từ chối tính toán lại.

source: Report Schedule reached a working timeout.
vi: Lịch biểu báo cáo đã đạt đến thời gian chờ hoạt động.

source: A report named "%(name)s" already exists
vi: Một báo cáo tên "%(name)s" đã tồn tại

source: An alert named "%(name)s" already exists
vi: Một cảnh báo tên "%(name)s" đã tồn tại

source: Resource already has an attached report.
vi: Tài nguyên đã có một báo cáo đính kèm.

source: Alert query returned more than one row.
vi: Truy vấn cảnh báo trả về nhiều hơn một hàng.

source: Alert validator config error.
vi: Lỗi cấu hình bộ kiểm tra cảnh báo.

source: Alert query returned more than one column.
vi: Truy vấn cảnh báo trả về nhiều hơn một cột.

source: Alert query returned a non-number value.
vi: Truy vấn cảnh báo trả về một giá trị không phải là số.

source: Alert found an error while executing a query.
vi: Cảnh báo phát hiện lỗi khi thực hiện truy vấn.

source: A timeout occurred while executing the query.
vi: Đã xảy ra thời gian chờ khi thực hiện truy vấn.

source: A timeout occurred while taking a screenshot.
vi: Đã xảy ra thời gian chờ khi chụp ảnh màn hình.

source: A timeout occurred while generating a csv.
vi: Đã xảy ra thời gian chờ khi tạo CSV.

source: A timeout occurred while generating a dataframe.
vi: Đã xảy ra thời gian chờ khi tạo dataframe.

source: Alert fired during grace period.
vi: Cảnh báo được kích hoạt trong thời gian gia hạn.

source: Alert ended grace period.
vi: Cảnh báo đã kết thúc thời gian gia hạn.

source: Alert on grace period
vi: Cảnh báo trong thời gian gia hạn

source: Report Schedule state not found
vi: Không tìm thấy trạng thái Lịch biểu báo cáo

source: Report schedule system error
vi: Lỗi hệ thống Lịch biểu báo cáo

source: Report schedule client error
vi: Lỗi khách hàng Lịch biểu báo cáo

source: Report schedule unexpected error
vi: Lỗi không mong đợi trong Lịch biểu báo cáo

source: Changing this report is forbidden
vi: Thay đổi báo cáo này bị cấm

source: An error occurred while pruning logs
vi: Đã xảy ra lỗi khi tỉa nhật ký

source: RLS Rule not found.
vi: Không tìm thấy Quy tắc RLS.

source: RLS rules could not be deleted.
vi: Không thể xóa các quy tắc RLS.

source: The database could not be found
vi: Không tìm thấy cơ sở dữ liệu

source: The query estimation was killed after %(sqllab_timeout)s seconds. It might be too complex, or the database might be under heavy load.
vi: Ước lượng truy vấn đã bị hủy sau %(sqllab_timeout)s giây. Có thể truy vấn quá phức tạp, hoặc cơ sở dữ liệu đang chịu tải nặng.

source: The database referenced in this query was not found. Please contact an administrator for further assistance or try again.
vi: Không tìm thấy cơ sở dữ liệu được tham chiếu trong truy vấn này. Vui lòng liên hệ với quản trị viên để được hỗ trợ thêm hoặc thử lại.

source: The query associated with these results could not be found. You need to re-run the original query.
vi: Không thể tìm thấy truy vấn liên quan đến các kết quả này. Bạn cần chạy lại truy vấn ban đầu.

source: Cannot access the query
vi: Không thể truy cập truy vấn

source: Data could not be retrieved from the results backend. You need to re-run the original query.
vi: Không thể truy xuất dữ liệu từ backend kết quả. Bạn cần chạy lại truy vấn ban đầu.

source: Data could not be deserialized from the results backend. The storage format might have changed, rendering the old data stake. You need to re-run the original query.
vi: Không thể giải tuần tự dữ liệu từ backend kết quả. Định dạng lưu trữ có thể đã thay đổi, làm cho dữ liệu cũ không hợp lệ. Bạn cần chạy lại truy vấn ban đầu.

source: Tag parameters are invalid.
vi: Tham số thẻ không hợp lệ.

source: Tag could not be created.
vi: Không thể tạo thẻ.

source: Tag could not be updated.
vi: Không thể cập nhật thẻ.

source: Tag could not be deleted.
vi: Không thể xóa thẻ.

source: Tagged Object could not be deleted.
vi: Không thể xóa Đối tượng được gắn thẻ.

source: An error occurred while creating the value.
vi: Đã xảy ra lỗi khi tạo giá trị.

source: An error occurred while accessing the value.
vi: Đã xảy ra lỗi khi truy cập giá trị.

source: An error occurred while deleting the value.
vi: Đã xảy ra lỗi khi xóa giá trị.

source: An error occurred while updating the value.
vi: Đã xảy ra lỗi khi cập nhật giá trị.

source: You don't have permission to modify the value.
vi: Bạn không có quyền sửa đổi giá trị.

source: Resource was not found.
vi: Không tìm thấy tài nguyên.

source: Invalid result type: %(result_type)s
vi: Loại kết quả không hợp lệ: %(result_type)s

source: Columns missing in dataset: %(invalid_columns)s
vi: Các cột thiếu trong tập dữ liệu: %(invalid_columns)s

source: Time Grain must be specified when using Time Shift.
vi: Phải chỉ định Mức độ thời gian khi sử dụng Dịch chuyển Thời gian.

source: A time column must be specified when using a Time Comparison.
vi: Phải chỉ định một cột thời gian khi sử dụng So sánh Thời gian.

source: The chart does not exist
vi: Biểu đồ không tồn tại

source: The chart datasource does not exist
vi: Nguồn dữ liệu biểu đồ không tồn tại

source: The chart query context does not exist
vi: Ngữ cảnh truy vấn biểu đồ không tồn tại

source: Duplicate column/metric labels: %(labels)s. Please make sure all columns and metrics have a unique label.
vi: Nhãn cột/chỉ số bị trùng lặp: %(labels)s. Vui lòng đảm bảo tất cả các cột và chỉ số đều có nhãn duy nhất.

source: The following entries in `series_columns` are missing in `columns`: %(columns)s.
vi: Các mục sau trong `series_columns` đang thiếu trong `columns`: %(columns)s.

source: `operation` property of post processing object undefined
vi: Thuộc tính `operation` của đối tượng xử lý hậu không được xác định

source: Unsupported post processing operation: %(operation)s
vi: Hoạt động xử lý hậu không được hỗ trợ: %(operation)s

source: [asc]
vi: [tăng dần]

source: [desc]
vi: [giảm dần]

source: Error in jinja expression in fetch values predicate: %(msg)s
vi: Lỗi trong biểu thức jinja trong điều kiện truy xuất giá trị: %(msg)s

source: Virtual dataset query must be read-only
vi: Truy vấn tập dữ liệu ảo phải ở chế độ chỉ đọc

source: Error in jinja expression in RLS filters: %(msg)s
vi: Lỗi trong biểu thức jinja trong bộ lọc RLS: %(msg)s

source: Metric '%(metric)s' does not exist
vi: Chỉ số '%(metric)s' không tồn tại

source: Db engine did not return all queried columns
vi: Động cơ cơ sở dữ liệu không trả về tất cả các cột đã truy vấn

source: Virtual dataset query cannot be empty
vi: Truy vấn tập dữ liệu ảo không thể trống

source: Only `SELECT` statements are allowed
vi: Chỉ cho phép các câu lệnh `SELECT`

source: Only single queries supported
vi: Chỉ hỗ trợ các truy vấn đơn lẻ

source: Columns
vi: Các cột

source: Show Column
vi: Hiển thị Cột

source: Add Column
vi: Thêm Cột

source: Edit Column
vi: Chỉnh sửa Cột

source: Whether to make this column available as a [Time Granularity] option, column has to be DATETIME or DATETIME-like
vi: Có nên làm cho cột này khả dụng như một tùy chọn [Mức độ Thời gian], cột phải là DATETIME hoặc tương tự DATETIME

source: Whether this column is exposed in the `Filters` section of the explore view.
vi: Có nên hiển thị cột này trong phần `Bộ lọc` của chế độ xem khám phá hay không.

source: The data type that was inferred by the database. It may be necessary to input a type manually for expression-defined columns in some cases. In most case users should not need to alter this.
vi: Loại dữ liệu được suy luận bởi cơ sở dữ liệu. Có thể cần phải nhập loại thủ công cho các cột được định nghĩa bằng biểu thức trong một số trường hợp. Trong hầu hết các trường hợp, người dùng không cần thay đổi điều này.

source: Column
vi: Cột

source: Verbose Name
vi: Tên Chi tiết

source: Description
vi: Mô tả

source: Groupable
vi: Có thể nhóm

source: Filterable
vi: Có thể lọc

source: Table
vi: Bảng

source: Expression
vi: Biểu thức

source: Is temporal
vi: Là tạm thời

source: Datetime Format
vi: Định dạng Ngày giờ

source: Type
vi: Loại

source: Business Data Type
vi: Loại Dữ liệu Kinh doanh

source: Invalid date/timestamp format
vi: Định dạng ngày/nhãn thời gian không hợp lệ

source: Metrics
vi: Chỉ số

source: Show Metric
vi: Hiển thị Chỉ số

source: Add Metric
vi: Thêm Chỉ số

source: Edit Metric
vi: Chỉnh sửa Chỉ số

source: Metric
vi: Chỉ số

source: SQL Expression
vi: Biểu thức SQL

source: D3 Format
vi: Định dạng D3

source: Extra
vi: Thêm

source: Warning Message
vi: Thông báo Cảnh báo

source: Tables
vi: Các Bảng

source: Show Table
vi: Hiển thị Bảng

source: Import a table definition
vi: Nhập định nghĩa bảng

source: Edit Table
vi: Chỉnh sửa Bảng

source: The list of charts associated with this table. By altering this datasource, you may change how these associated charts behave. Also note that charts need to point to a datasource, so this form will fail at saving if removing charts from a datasource. If you want to change the datasource for a chart, overwrite the chart from the 'explore view'
vi: Danh sách biểu đồ liên kết với bảng này. Bằng cách thay đổi nguồn dữ liệu này, bạn có thể thay đổi cách các biểu đồ liên kết này hoạt động. Lưu ý rằng các biểu đồ cần trỏ đến nguồn dữ liệu, do đó biểu mẫu này sẽ không lưu nếu loại bỏ biểu đồ từ nguồn dữ liệu. Nếu bạn muốn thay đổi nguồn dữ liệu cho một biểu đồ, hãy ghi đè lên biểu đồ từ 'góc nhìn khám phá'

source: Timezone offset (in hours) for this datasource
vi: Độ lệch múi giờ (theo giờ) cho nguồn dữ liệu này

source: Name of the table that exists in the source database
vi: Tên của bảng tồn tại trong cơ sở dữ liệu nguồn

source: Schema, as used only in some databases like Postgres, Redshift and DB2
vi: Schema, chỉ được sử dụng trong một số cơ sở dữ liệu như Postgres, Redshift và DB2

source: This fields acts a Superset view, meaning that Superset will run a query against this string as a subquery.
vi: Trường này hoạt động như một chế độ xem Superset, có nghĩa là Superset sẽ chạy một truy vấn đối với chuỗi này như một truy vấn phụ.

source: Predicate applied when fetching distinct value to populate the filter control component. Supports jinja template syntax. Applies only when `Enable Filter Select` is on.
vi: Predicate được áp dụng khi lấy giá trị riêng biệt để điền vào thành phần điều khiển bộ lọc. Hỗ trợ cú pháp mẫu jinja. Chỉ áp dụng khi `Enable Filter Select` được bật.

source: Redirects to this endpoint when clicking on the table from the table list
vi: Chuyển hướng đến điểm cuối này khi nhấp vào bảng từ danh sách bảng

source: Whether to populate the filter's dropdown in the explore view's filter section with a list of distinct values fetched from the backend on the fly
vi: Có nên điền vào danh sách thả xuống của bộ lọc trong phần bộ lọc của chế độ xem khám phá với danh sách các giá trị riêng biệt được lấy từ backend ngay lập tức hay không

source: Whether the table was generated by the 'Visualize' flow in SQL Lab
vi: Bảng được tạo ra bởi luồng 'Visualize' trong SQL Lab hay không

source: A set of parameters that become available in the query using Jinja templating syntax
vi: Một tập hợp các tham số trở nên có sẵn trong truy vấn bằng cú pháp mẫu Jinja

source: Duration (in seconds) of the caching timeout for this table. A timeout of 0 indicates that the cache never expires. Note this defaults to the database timeout if undefined.
vi: Thời gian chờ (theo giây) của thời gian chờ lưu trữ cho bảng này. Một thời gian chờ của 0 cho biết rằng bộ nhớ cache không bao giờ hết hạn. Lưu ý rằng điều này mặc định thành thời gian chờ của cơ sở dữ liệu nếu không xác định.

source: Allow column names to be changed to case insensitive format, if supported (e.g. Oracle, Snowflake).
vi: Cho phép đổi tên cột thành định dạng không phân biệt chữ hoa chữ thường, nếu được hỗ trợ (ví dụ: Oracle, Snowflake).

source: Datasets can have a main temporal column (main_dttm_col), but can also have secondary time columns. When this attribute is true, whenever the secondary columns are filtered, the same filter is applied to the main datetime column.
vi: Các tập dữ liệu có thể có một cột thời gian chính (main_dttm_col), nhưng cũng có thể có các cột thời gian phụ. Khi thuộc tính này là đúng, bất cứ khi nào các cột phụ được lọc, bộ lọc giống nhau được áp dụng cho cột thời gian chính.

source: Associated Charts
vi: Biểu đồ liên quan

source: Changed By
vi: Được thay đổi bởi

source: Database
vi: Cơ sở dữ liệu

source: Last Changed
vi: Lần thay đổi cuối cùng

source: Enable Filter Select
vi: Bật lựa chọn bộ lọc

source: Default Endpoint
vi: Điểm cuối mặc định

source: Offset
vi: Độ lệch

source: Cache Timeout
vi: Thời gian chờ cache

source: Table Name
vi: Tên bảng

source: Fetch Values Predicate
vi: Thuộc tính Lấy giá trị

source: Owners
vi: Chủ sở hữu

source: Main Datetime Column
vi: Cột Ngày giờ chính

source: SQL Lab View
vi: Chế độ xem SQL Lab

source: Template parameters
vi: Tham số mẫu

source: Modified
vi: Đã sửa đổi

source: The table was created. As part of this two-phase configuration process, you should now click the edit button by the new table to configure it.
vi: Bảng đã được tạo. Là một phần của quá trình cấu hình hai giai đoạn này, bạn nên bây giờ nhấp vào nút chỉnh sửa bên cạnh bảng mới để cấu hình nó.

source: Dataset schema is invalid, caused by: %(error)s
vi: Schema của tập dữ liệu không hợp lệ, gây ra bởi: %(error)s

source: Title or Slug
vi: Tiêu đề hoặc Slug

source: Role
vi: Vai trò

source: Invalid state.
vi: Trạng thái không hợp lệ.

source: Table name undefined
vi: Tên bảng không xác định

source: Upload Enabled
vi: Tải lên được kích hoạt

source: Invalid connection string, a valid string usually follows: backend+driver://user:password@database-host/database-name
vi: Chuỗi kết nối không hợp lệ, chuỗi hợp lệ thường là: backend+driver://user:password@database-host/database-name

source: Field cannot be decoded by JSON. %(msg)s
vi: Trường không thể giải mã bằng JSON. %(msg)s

source: The metadata_params in Extra field is not configured correctly. The key %(key)s is invalid.
vi: metadata_params trong trường Extra không được cấu hình đúng. Khóa %(key)s không hợp lệ.

source: An engine must be specified when passing individual parameters to a database.
vi: Một engine phải được chỉ định khi chuyển các tham số riêng lẻ vào một cơ sở dữ liệu.

source: Engine spec "InvalidEngine" does not support being configured via individual parameters.
vi: Spec Engine "InvalidEngine" không hỗ trợ việc được cấu hình thông qua các tham số riêng lẻ.

source: Null or Empty
vi: Null hoặc Rỗng

source: Please check your query for syntax errors at or near "%(syntax_error)s". Then, try running your query again.
vi: Vui lòng kiểm tra truy vấn của bạn để tìm lỗi cú pháp ở gần "%(syntax_error)s". Sau đó, hãy thử chạy truy vấn của bạn lại.

source: Second
vi: Giây

source: 5 second
vi: 5 giây

source: 30 second
vi: 30 giây

source: Minute
vi: Phút

source: 5 minute
vi: 5 phút

source: 10 minute
vi: 10 phút

source: 15 minute
vi: 15 phút

source: 30 minute
vi: 30 phút

source: Hour
vi: Giờ

source: 6 hour
vi: 6 giờ

source: Day
vi: Ngày

source: Week
vi: Tuần

source: Month
vi: Tháng

source: Quarter
vi: Quý

source: Year
vi: Năm

source: Week starting Sunday
vi: Tuần bắt đầu từ Chủ nhật

source: Week starting Monday
vi: Tuần bắt đầu từ Thứ Hai

source: Week ending Saturday
vi: Tuần kết thúc vào Thứ Bảy

source: Week ending Sunday
vi: Tuần kết thúc vào Chủ Nhật

source: Username
vi: Tên người dùng

source: Password
vi: Mật khẩu

source: Hostname or IP address
vi: Tên máy chủ hoặc địa chỉ IP

source: Database port
vi: Cổng cơ sở dữ liệu

source: Database name
vi: Tên cơ sở dữ liệu

source: Additional parameters
vi: Tham số bổ sung

source: Use an encrypted connection to the database
vi: Sử dụng kết nối được mã hóa đến cơ sở dữ liệu

source: Use an ssh tunnel connection to the database
vi: Sử dụng kết nối ssh tunnel đến cơ sở dữ liệu

source: Unable to connect. Verify that the following roles are set on the service account: "BigQuery Data Viewer", "BigQuery Metadata Viewer", "BigQuery Job User" and the following permissions are set "bigquery.readsessions.create", "bigquery.readsessions.getData"
vi: Không thể kết nối. Hãy xác minh rằng các vai trò sau đã được thiết lập trên tài khoản dịch vụ: "BigQuery Data Viewer", "BigQuery Metadata Viewer", "BigQuery Job User" và các quyền sau đã được thiết lập "bigquery.readsessions.create", "bigquery.readsessions.getData"

source: The table "%(table)s" does not exist. A valid table must be used to run this query.
vi: Bảng "%(table)s" không tồn tại. Phải sử dụng một bảng hợp lệ để chạy truy vấn này.

source: We can't seem to resolve column "%(column)s" at line %(location)s.
vi: Chúng tôi không thể giải quyết cột "%(column)s" tại dòng %(location)s.

source: The schema "%(schema)s" does not exist. A valid schema must be used to run this query.
vi: Schema "%(schema)s" không tồn tại. Phải sử dụng một schema hợp lệ để chạy truy vấn này.

source: Either the username "%(username)s" or the password is incorrect.
vi: Hoặc tên người dùng "%(username)s" hoặc mật khẩu không chính xác.

source: Unknown Doris server host "%(hostname)s".
vi: Máy chủ Doris không xác định "% (hostname) s ".

source: The host "%(hostname)s" might be down and can't be reached.
vi: Máy chủ "% (hostname)s"có thể đã tắt và không thể tiếp cận.

source: Unable to connect to database "%(database)s".
vi: Không thể kết nối đến cơ sở dữ liệu "%(database)s".

source: Please check your query for syntax errors near "%(server_error)s". Then, try running your query again.
vi: Vui lòng kiểm tra truy vấn của bạn để tìm lỗi cú pháp gần "% (server_error) s ". Sau đó, hãy thử chạy truy vấn của bạn lại.

source: We can't seem to resolve the column "%(column_name)s"
vi: Chúng tôi không thể giải quyết cột "%(column_name)s"

source: Either the username "%(username)s", password, or database name "%(database)s" is incorrect.
vi: Hoặc tên người dùng "%(username)s", mật khẩu, hoặc tên cơ sở dữ liệu "%(database)s" không chính xác.

source: The hostname "%(hostname)s" cannot be resolved.
vi: Tên máy chủ "% (hostname)s"không thể phân giải.

source: Port %(port)s on hostname "%(hostname)s" refused the connection.
vi: Cổng %(port)s trên máy chủ "%(hostname)s"từ chối kết nối.

source: The host "%(hostname)s" might be down, and can't be reached on port %(port)s.
vi: Máy chủ "%(hostname)s"có thể đã tắt và không thể tiếp cận trên cổng %(port) s.

source: Unknown MySQL server host "%(hostname)s".
vi: Máy chủ MySQL không xác định "%(hostname)s".

source: The username "%(username)s" does not exist.
vi: Tên người dùng "%(username)s"không tồn tại.

source: The user/password combination is not valid (Incorrect password for user).
vi: Kết hợp tên người dùng/mật khẩu không hợp lệ (Mật khẩu không chính xác cho người dùng).

source: Could not connect to database: "%(database)s"
vi: Không thể kết nối đến cơ sở dữ liệu: "%(database)s"

source: Could not resolve hostname: "%(host)s".
vi: Không thể giải quyết tên máy chủ: "%(host)s".

source: Port out of range 0-65535
vi: Cổng nằm ngoài phạm vi 0-65535

source: Invalid Connection String: Expecting String of the form 'ocient://user:pass@host:port/database'.
vi: Chuỗi Kết nối không hợp lệ: Đang mong đợi Chuỗi của dạng 'ocient://user:pass@host:port/database'.

source: Syntax Error: %(qualifier)s input "%(input)s" expecting "%(expected)s
vi: Lỗi cú pháp: %(qualifier)s đầu vào "% (input) s" mong đợi "% (expected) s

source: Table or View "%(table)s" does not exist.
vi: Bảng hoặc Chế độ xem "% (table) s" không tồn tại.

source: Invalid reference to column: "%(column)s"
vi: Tham chiếu không hợp lệ đến cột: "% (column) s"

source: The password provided for username "%(username)s" is incorrect.
vi: Mật khẩu được cung cấp cho tên người dùng "% (username) s" không chính xác.

source: Please re-enter the password.
vi: Vui lòng nhập lại mật khẩu.

source: We can't seem to resolve the column "%(column_name)s" at line %(location)s.
vi: Chúng tôi không thể giải quyết cột "%(column_name)s" tại dòng %(location)s.

source: Users are not allowed to set a search path for security reasons.
vi: Người dùng không được phép đặt một đường dẫn tìm kiếm vì lý do bảo mật.

source: The table "%(table_name)s" does not exist. A valid table must be used to run this query.
vi: Bảng "%(table_name)s" không tồn tại. Phải sử dụng một bảng hợp lệ để chạy truy vấn này.

source: The schema "%(schema_name)s" does not exist. A valid schema must be used to run this query.
vi: Không có schema "%(schema_name)s" tồn tại. Phải sử dụng một schema hợp lệ để chạy truy vấn này.

source: Unable to connect to catalog named "%(catalog_name)s".
vi: Không thể kết nối với danh mục có tên "%(catalog_name)s".
