Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Uses circles to visualize the flow of data through different stages of a system. Hover over individual paths in the visualization to understand the stages a value took. Useful for multi-stage, multi-group visualizing funnels and pipelines.
vi: Sử dụng các vòng tròn để hiển thị luồng dữ liệu qua các giai đoạn khác nhau của một hệ thống. Di chuột qua các đường dẫn riêng lẻ trong hình trực quan để hiểu các giai đoạn mà một giá trị đã trải qua. Hữu ích cho việc hình dung các phễu và đường ống đa giai đoạn, đa nhóm.

source: Sunburst Chart
vi: Biểu đồ Sunburst

source: Multi-Levels
vi: Nhiều cấp độ

source: When using other than adaptive formatting, labels may overlap
vi: Khi sử dụng định dạng khác ngoài định dạng thích ứng, các nhãn có thể chồng lên nhau

source: Swiss army knife for visualizing data. Choose between step, line, scatter, and bar charts. This viz type has many customization options as well.
vi: Công cụ đa năng để hiển thị dữ liệu. Chọn giữa các biểu đồ bước, đường, phân tán và cột. Loại hình trực quan này cũng có nhiều tùy chọn tùy chỉnh.

source: Generic Chart
vi: Biểu đồ tổng quát

source: zoom area
vi: khu vực thu phóng

source: restore zoom
vi: khôi phục thu phóng

source: Series Style
vi: Phong cách chuỗi

source: Area chart opacity
vi: Độ mờ của biểu đồ vùng

source: Opacity of Area Chart. Also applies to confidence band.
vi: Độ mờ của biểu đồ vùng. Cũng áp dụng cho dải tin cậy.

source: Marker Size
vi: Kích thước ký hiệu

source: Area charts are similar to line charts in that they represent variables with the same scale, but area charts stack the metrics on top of each other.
vi: Biểu đồ vùng tương tự như biểu đồ đường ở chỗ chúng đại diện cho các biến số với cùng một thang đo, nhưng biểu đồ vùng chồng các chỉ số lên nhau.

source: Area Chart
vi: Biểu đồ Vùng

source: Axis Title
vi: Tiêu đề Trục

source: AXIS TITLE MARGIN
vi: LỀ TIÊU ĐỀ TRỤC

source: AXIS TITLE POSITION
vi: VỊ TRÍ TIÊU ĐỀ TRỤC

source: Axis Format
vi: Định dạng Trục

source: Logarithmic axis
vi: Trục logarit

source: Draw split lines for minor axis ticks
vi: Vẽ các đường phân tách cho các vạch nhỏ trên trục

source: Truncate Axis
vi: Cắt ngắn Trục

source: It’s not recommended to truncate axis in Bar chart.
vi: Không nên cắt ngắn trục trong biểu đồ cột.

source: Axis Bounds
vi: Giới hạn Trục

source: Bounds for the axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
vi: Giới hạn cho trục. Khi để trống, giới hạn sẽ được xác định động dựa trên giá trị tối thiểu/tối đa của dữ liệu. Lưu ý rằng tính năng này chỉ mở rộng phạm vi trục. Nó sẽ không thu hẹp phạm vi dữ liệu.

source: Chart Orientation
vi: Hướng Biểu đồ

source: Bar orientation
vi: Hướng cột

source: Vertical
vi: Dọc

source: Horizontal
vi: Ngang

source: Orientation of bar chart
vi: Hướng của biểu đồ cột

source: Bar Charts are used to show metrics as a series of bars.
vi: Biểu đồ cột được sử dụng để hiển thị các chỉ số dưới dạng một chuỗi các thanh.

source: Bar Chart
vi: Biểu đồ Cột

source: Line chart is used to visualize measurements taken over a given category. Line chart is a type of chart which displays information as a series of data points connected by straight line segments. It is a basic type of chart common in many fields.
vi: Biểu đồ đường được sử dụng để hiển thị các phép đo được thực hiện trên một danh mục nhất định. Biểu đồ đường là một loại biểu đồ hiển thị thông tin dưới dạng một chuỗi các điểm dữ liệu được kết nối bằng các đoạn thẳng. Đây là loại biểu đồ cơ bản phổ biến trong nhiều lĩnh vực.

source: Line Chart
vi: Biểu đồ Đường

source: Scatter Plot has the horizontal axis in linear units, and the points are connected in order. It shows a statistical relationship between two variables.
vi: Biểu đồ phân tán có trục ngang theo đơn vị tuyến tính và các điểm được kết nối theo thứ tự. Nó cho thấy mối quan hệ thống kê giữa hai biến.

source: Scatter Plot
vi: Biểu đồ Phân tán

source: Smooth-line is a variation of the line chart. Without angles and hard edges, Smooth-line sometimes looks smarter and more professional.
vi: Đường mịn là một biến thể của biểu đồ đường. Không có góc cạnh và cạnh cứng, Đường mịn đôi khi trông thông minh và chuyên nghiệp hơn.

source: Step type
vi: Loại bước

source: Start
vi: Bắt đầu

source: Middle
vi: Giữa

source: End
vi: Kết thúc

source: Defines whether the step should appear at the beginning, middle or end between two data points
vi: Xác định liệu bước này nên xuất hiện ở đầu, giữa hoặc cuối giữa hai điểm dữ liệu

source: Stepped-line graph (also called step chart) is a variation of line chart but with the line forming a series of steps between data points. A step chart can be useful when you want to show the changes that occur at irregular intervals.
vi: Biểu đồ đường bước (còn gọi là biểu đồ bước) là một biến thể của biểu đồ đường nhưng với đường tạo thành một chuỗi các bước giữa các điểm dữ liệu. Biểu đồ bước có thể hữu ích khi bạn muốn hiển thị các thay đổi xảy ra ở các khoảng không đều đặn.

source: Stepped Line
vi: Đường Bước

source: Name of the id column
vi: Tên của cột id

source: Parent
vi: Cha mẹ

source: Name of the column containing the id of the parent node
vi: Tên của cột chứa id của nút cha

source: Optional name of the data column.
vi: Tên tùy chọn của cột dữ liệu.

source: Root node id
vi: Id nút gốc

source: Id of root node of the tree.
vi: Id của nút gốc của cây.

source: Metric for node values
vi: Chỉ số cho giá trị nút

source: Tree layout
vi: Bố cục cây

source: Orthogonal
vi: Vuông góc

source: Radial
vi: Hướng tâm

source: Layout type of tree
vi: Loại bố cục cây

source: Tree orientation
vi: Hướng cây

source: Left to Right
vi: Trái sang Phải

source: Right to Left
vi: Phải sang Trái

source: Top to Bottom
vi: Trên xuống Dưới

source: Bottom to Top
vi: Dưới lên Trên

source: Orientation of tree
vi: Hướng của cây

source: Node label position
vi: Vị trí nhãn nút

source: left
vi: trái

source: top
vi: trên

source: right
vi: phải

source: bottom
vi: dưới

source: Position of intermediate node label on tree
vi: Vị trí của nhãn nút trung gian trên cây

source: Child label position
vi: Vị trí nhãn con trên cây

source: Position of child node label on tree
vi: Vị trí nhãn nút con trên cây

source: Emphasis
vi: Nhấn mạnh

source: ancestor
vi: tổ tiên

source: descendant
vi: hậu duệ

source: Which relatives to highlight on hover
vi: Các quan hệ nào nên được nhấn mạnh khi di chuột qua

source: Symbol
vi: Biểu tượng

source: Empty circle
vi: Vòng tròn trống

source: Circle
vi: Vòng tròn

source: Rectangle
vi: Hình chữ nhật

source: Triangle
vi: Hình tam giác

source: Diamond
vi: Hình thoi

source: Pin
vi: Đinh ghim

source: Arrow
vi: Mũi tên

source: Symbol size
vi: Kích thước biểu tượng

source: Size of edge symbols
vi: Kích thước của các biểu tượng cạnh

source: Visualize multiple levels of hierarchy using a familiar tree-like structure.
vi: Hiển thị nhiều cấp độ của bộ phận bằng cách sử dụng một cấu trúc giống cây quen thuộc.

source: Tree Chart
vi: Biểu đồ Cây

source: Show Upper Labels
vi: Hiển thị nhãn trên khi nút có con.

source: Show labels when the node has children.
vi: Hiển thị nhãn khi nút có con.

source: Key
vi: Khóa

source: Show hierarchical relationships of data, with the value represented by area, showing proportion and contribution to the whole.
vi: Hiển thị các mối quan hệ phân cấp của dữ liệu, với giá trị được biểu diễn bằng diện tích, thể hiện tỷ lệ và đóng góp vào toàn bộ.

source: Treemap
vi: Biểu đồ Bản đồ cây

source: Total
vi: Tổng

source: Assist
vi: Hỗ trợ

source: Increase
vi: Tăng

source: Decrease
vi: Giảm

source: Series colors
vi: Màu của chuỗi

source: Breaks down the series by the category specified in this control. This can help viewers understand how each category affects the overall value.
vi: Phân loại chuỗi theo danh mục được chỉ định trong điều khiển này. Điều này có thể giúp người xem hiểu được mỗi danh mục làm thế nào ảnh hưởng đến giá trị tổng thể.

source: A waterfall chart is a form of data visualization that helps in understanding the cumulative effect of sequentially introduced positive or negative values. These intermediate values can either be time based or category based.
vi: Biểu đồ thác nước là một hình thức trực quan hóa dữ liệu giúp hiểu được tác động tích lũy của các giá trị dương hoặc âm được giới thiệu theo trình tự. Các giá trị trung gian này có thể dựa trên thời gian hoặc dựa trên danh mục.

source: Waterfall Chart
vi: Biểu đồ Thác nước

source: page_size.all
vi: Tất cả

source: Loading...
vi: Đang tải...

source: Write a handlebars template to render the data
vi: Viết một mẫu handlebars để hiển thị dữ liệu

source: must have a value
vi: phải có một giá trị

source: Handlebars Template
vi: Mẫu Handlebars

source: A handlebars template that is applied to the data
vi: Một mẫu handlebars được áp dụng vào dữ liệu

source: Include time
vi: Bao gồm thời gian

source: Whether to include the time granularity as defined in the time section
vi: Có bao gồm độ tinh tế về thời gian như được xác định trong phần thời gian không

source: Percentage metrics
vi: Chỉ số phần trăm

source: Select one or many metrics to display, that will be displayed in the percentages of total. Percentage metrics will be calculated only from data within the row limit. You can use an aggregation function on a column or write custom SQL to create a percentage metric.
vi: Chọn một hoặc nhiều chỉ số để hiển thị, sẽ được hiển thị dưới dạng phần trăm của tổng. Chỉ số phần trăm sẽ được tính toán chỉ từ dữ liệu trong giới hạn hàng. Bạn có thể sử dụng một hàm tổng hợp trên một cột hoặc viết SQL tùy chỉnh để tạo một chỉ số phần trăm.

source: Show totals
vi: Hiển thị tổng

source: Show total aggregations of selected metrics. Note that row limit does not apply to the result.
vi: Hiển thị tổng tổng hợp của các chỉ số đã chọn. Lưu ý rằng giới hạn hàng không áp dụng cho kết quả.

source: Ordering
vi: Sắp xếp

source: Order results by selected columns
vi: Sắp xếp kết quả theo cột đã chọn

source: Sort descending
vi: Sắp xếp giảm dần

source: Server pagination
vi: Phân trang máy chủ

source: Enable server side pagination of results (experimental feature)
vi: Bật chức năng phân trang máy chủ cho kết quả (chức năng thử nghiệm)

source: Server Page Length
vi: Số hàng trên mỗi trang, 0 có nghĩa là không phân trang

source: Rows per page, 0 means no pagination
vi: Số hàng trên mỗi trang, 0 có nghĩa là không phân trang

source: Query mode
vi: Chế độ truy vấn

source: Group By, Metrics or Percentage Metrics must have a value
vi: Nhóm theo, Chỉ số hoặc Chỉ số phần trăm phải có một giá trị

source: You need to configure HTML sanitization to use CSS
vi: Bạn cần cấu hình vệ sinh HTML để sử dụng CSS

source: CSS Styles
vi: Kiểu CSS

source: CSS applied to the chart
vi: CSS được áp dụng cho biểu đồ

source: Columns to group by on the columns
vi: Cột để nhóm theo trên các cột

source: Rows
vi: Hàng

source: Columns to group by on the rows
vi: Cột để nhóm theo trên các hàng

source: Apply metrics on
vi: Áp dụng chỉ số cho

source: Use metrics as a top level group for columns or for rows
vi: Sử dụng chỉ số như một nhóm cấp độ cao nhất cho các cột hoặc cho các hàng

source: Cell limit
vi: Giới hạn số ô lấy

source: Limits the number of cells that get retrieved.
vi: Giới hạn số ô lấy được.

source: Metric used to define how the top series are sorted if a series or cell limit is present. If undefined reverts to the first metric (where appropriate).
vi: Chỉ số được sử dụng để xác định cách sắp xếp chuỗi hàng đầu nếu có một chuỗi hoặc giới hạn ô. Nếu không xác định, sẽ quay lại chỉ số đầu tiên (nếu thích hợp).

source: Aggregation function
vi: Hàm tổng hợp

source: Count
vi: Số lượng

source: Count Unique Values
vi: Số giá trị duy nhất

source: List Unique Values
vi: Liệt kê các giá trị duy nhất

source: Sum
vi: Tổng

source: Average
vi: Trung bình

source: Median
vi: Trung vị

source: Sample Variance
vi: Phương sai mẫu

source: Sample Standard Deviation
vi: Độ lệch chuẩn mẫu

source: Minimum
vi: Tối thiểu

source: Maximum
vi: Tối đa

source: First
vi: Đầu tiên

source: Last
vi: Cuối cùng

source: Sum as Fraction of Total
vi: Tổng số là phần của Tổng

source: Sum as Fraction of Rows
vi: Tổng số là phần của Hàng

source: Sum as Fraction of Columns
vi: Tổng số là phần của Cột

source: Count as Fraction of Total
vi: Số lượng là phần của Tổng

source: Count as Fraction of Rows
vi: Số lượng là phần của Hàng

source: Count as Fraction of Columns
vi: Số lượng là phần của Cột

source: Aggregate function to apply when pivoting and computing the total rows and columns
vi: Hàm tổng hợp được áp dụng khi xoay và tính toán tổng số hàng và cột

source: Show rows total
vi: Hiển thị tổng hàng

source: Display row level total
vi: Hiển thị tổng cấp độ hàng

source: Show rows subtotal
vi: Hiển thị tổng phụ hàng

source: Display row level subtotal
vi: Hiển thị cấp độ phụ hàng

source: Show columns total
vi: Hiển thị tổng cột

source: Display column level total
vi: Hiển thị tổng cấp độ cột

source: Show columns subtotal
vi: Hiển thị tổng phụ cột

source: Display column level subtotal
vi: Hiển thị cấp độ phụ cột

source: Transpose pivot
vi: Chuyển vị xoay

source: Swap rows and columns
vi: Hoán đổi hàng và cột

source: Combine metrics
vi: Kết hợp chỉ số

source: Display metrics side by side within each column, as opposed to each column being displayed side by side for each metric.
vi: Hiển thị các chỉ số cạnh nhau trong mỗi cột, không giống như mỗi cột được hiển thị cạnh nhau cho mỗi chỉ số.

source: D3 time format for datetime columns
vi: Định dạng thời gian D3 cho các cột ngày giờ

source: Sort rows by
vi: Sắp xếp hàng theo

source: key a-z
vi: chìa khóa a-z

source: key z-a
vi: chìa khóa z-a

source: value ascending
vi: giá trị tăng dần

source: value descending
vi: giá trị giảm dần

source: Change order of rows.
vi: Thay đổi thứ tự các hàng.

source: Available sorting modes:
vi: Chế độ sắp xếp có sẵn:

source: By key: use row names as sorting key
vi: Theo khóa: sử dụng tên hàng làm khóa sắp xếp

source: By value: use metric values as sorting key
vi: Theo giá trị: sử dụng giá trị chỉ số làm khóa sắp xếp

source: Sort columns by
vi: Sắp xếp các cột theo

source: Change order of columns.
vi: Thay đổi thứ tự các cột.

source: By key: use column names as sorting key
vi: Theo khóa: sử dụng tên cột làm khóa sắp xếp

source: Rows subtotal position
vi: Vị trí tổng phụ hàng

source: Position of row level subtotal
vi: Vị trí tổng phụ cấp độ hàng

source: Columns subtotal position
vi: Vị trí tổng phụ cột

source: Position of column level subtotal
vi: Vị trí tổng phụ cấp độ cột

source: Conditional formatting
vi: Định dạng có điều kiện

source: Apply conditional color formatting to metrics
vi: Áp dụng định dạng màu có điều kiện cho các chỉ số

source: Used to summarize a set of data by grouping together multiple statistics along two axes. Examples: Sales numbers by region and month, tasks by status and assignee, active users by age and location. Not the most visually stunning visualization, but highly informative and versatile.
vi: Được sử dụng để tóm tắt một tập hợp dữ liệu bằng cách nhóm nhiều thống kê lại với nhau theo hai trục. Ví dụ: Số lượng bán hàng theo khu vực và tháng, nhiệm vụ theo trạng thái và người được giao, người dùng hoạt động theo tuổi và vị trí. Không phải là trực quan hóa đẹp nhất, nhưng rất thông tin và linh hoạt.

source: Pivot Table
vi: Bảng Pivot

source: metric
vi: chỉ số

source: Total (%(aggregatorName)s)
vi: Tổng cộng (%(aggregatorName)s)

source: Unknown input format
vi: Định dạng đầu vào không xác định

source: search.num_records
vi: Tìm kiếm %s hồ sơ

source: Search %s records
vi: Tìm kiếm %s hồ sơ

source: page_size.show
vi: Hiển thị

source: page_size.entries
vi: hồ sơ

source: No matching records found
vi: Không tìm thấy hồ sơ phù hợp

source: Shift + Click to sort by multiple columns
vi: Nhấn Shift + Click để sắp xếp theo nhiều cột

source: Totals
vi: Tổng

source: Timestamp format
vi: Định dạng thời gian

source: Page length
vi: Độ dài trang

source: Search box
vi: Hộp tìm kiếm

source: Whether to include a client-side search box
vi: Có bao gồm một hộp tìm kiếm ở phía máy khách không

source: Cell bars
vi: Thanh ô

source: Whether to display a bar chart background in table columns
vi: Có hiển thị nền biểu đồ cột trong các cột bảng không

source: Align +/-
vi: Căn chỉnh +/-

source: Whether to align background charts with both positive and negative values at 0
vi: Có căn chỉnh biểu đồ nền với cả giá trị dương và âm ở 0 không

source: Color +/-
vi: Màu +/-

source: Whether to colorize numeric values by whether they are positive or negative
vi: Có nên tô màu các giá trị số dương hoặc số âm không

source: Allow columns to be rearranged
vi: Cho phép sắp xếp lại các cột

source: Allow end user to drag-and-drop column headers to rearrange them. Note their changes won't persist for the next time they open the chart.
vi: Cho phép người dùng cuối kéo và thả tiêu đề cột để sắp xếp lại chúng. Lưu ý rằng các thay đổi của họ sẽ không được lưu lại cho lần mở biểu đồ tiếp theo.

source: Render columns in HTML format
vi: Hiển thị cột dưới dạng HTML

source: Render data in HTML format if applicable.
vi: Hiển thị dữ liệu dưới dạng HTML nếu có thể.

source: Customize columns
vi: Tùy chỉnh cột

source: Further customize how to display each column
vi: Tùy chỉnh chi tiết cách hiển thị từng cột

source: Apply conditional color formatting to numeric columns
vi: Áp dụng định dạng màu có điều kiện cho các cột số

source: Classic row-by-column spreadsheet like view of a dataset. Use tables to showcase a view into the underlying data or to show aggregated metrics.
vi: Dạng hiển thị bảng dữ liệu theo hàng và cột, giống như bảng tính. Sử dụng bảng để hiển thị dữ liệu cơ bản hoặc các chỉ số được tổng hợp.

source: Show
vi: Hiển thị

source: entries
vi: bản ghi

source: Word Cloud
vi: Đám mây từ

source: Minimum Font Size
vi: Cỡ chữ tối thiểu

source: Font size for the smallest value in the list
vi: Cỡ chữ cho giá trị nhỏ nhất trong danh sách

source: Maximum Font Size
vi: Cỡ chữ tối đa

source: Font size for the biggest value in the list
vi: Cỡ chữ cho giá trị lớn nhất trong danh sách

source: Word Rotation
vi: Xoay từ

source: random
vi: ngẫu nhiên

source: square
vi: vuông

source: Rotation to apply to words in the cloud
vi: Góc xoay được áp dụng cho các từ trong đám mây

source: Visualizes the words in a column that appear the most often. Bigger font corresponds to higher frequency.
vi: Hiển thị các từ trong một cột xuất hiện nhiều nhất. Cỡ chữ lớn tương ứng với tần suất cao.

source: N/A
vi: Không áp dụng

source: offline
vi: ngoại tuyến

source: failed
vi: thất bại

source: pending
vi: đang chờ

source: fetching
vi: đang tải

source: running
vi: đang chạy

source: stopped
vi: đã dừng

source: success
vi: thành công

source: The query couldn't be loaded
vi: Không thể tải truy vấn

source: Your query has been scheduled. To see details of your query, navigate to Saved queries
vi: Truy vấn của bạn đã được lên lịch. Để xem chi tiết của truy vấn, điều hướng đến Truy vấn đã lưu

source: Your query could not be scheduled
vi: Không thể lên lịch truy vấn của bạn

source: Failed at retrieving results
vi: Lấy kết quả thất bại

source: Unknown error
vi: Lỗi không xác định

source: Query was stopped.
vi: Truy vấn đã bị dừng lại.

source: Failed at stopping query. %s
vi: Lỗi khi dừng truy vấn. %s

source: Unable to migrate table schema state to backend. Superset will retry later. Please contact your administrator if this problem persists.
vi: Không thể di chuyển trạng thái lược đồ bảng sang backend. Superset sẽ thử lại sau. Vui lòng liên hệ quản trị viên nếu vấn đề này vẫn tiếp tục.

source: Unable to migrate query state to backend. Superset will retry later. Please contact your administrator if this problem persists.
vi: Không thể di chuyển trạng thái truy vấn sang backend. Superset sẽ thử lại sau. Vui lòng liên hệ quản trị viên nếu vấn đề này vẫn tiếp tục.

source: Unable to migrate query editor state to backend. Superset will retry later. Please contact your administrator if this problem persists.
vi: Không thể di chuyển trạng thái trình soạn thảo truy vấn sang backend. Superset sẽ thử lại sau. Vui lòng liên hệ quản trị viên nếu vấn đề này vẫn tiếp tục.

source: Unable to add a new tab to the backend. Please contact your administrator.
vi: Không thể thêm tab mới vào backend. Vui lòng liên hệ quản trị viên.

source: -- Note: Unless you save your query, these tabs will NOT persist if you clear your cookies or change browsers.
vi: -- Lưu ý: Trừ khi bạn lưu truy vấn của mình, các tab này SẼ KHÔNG DỤNG nếu bạn xóa cookie hoặc thay đổi trình duyệt.

source: Copy of %s
vi: Bản sao của %s

source: An error occurred while setting the active tab. Please contact your administrator.
vi: Đã xảy ra lỗi khi thiết lập tab hoạt động. Vui lòng liên hệ quản trị viên.

source: An error occurred while fetching tab state
vi: Đã xảy ra lỗi khi truy xuất trạng thái tab.

source: An error occurred while removing tab. Please contact your administrator.
vi: Đã xảy ra lỗi khi xóa tab. Vui lòng liên hệ quản trị viên.

source: An error occurred while removing query. Please contact your administrator.
vi: Đã xảy ra lỗi khi xóa truy vấn. Vui lòng liên hệ quản trị viên.

source: Your query could not be saved
vi: Truy vấn của bạn không thể được lưu

source: Your query was not properly saved
vi: Truy vấn của bạn không được lưu một cách chính xác

source: Your query was saved
vi: Truy vấn của bạn đã được lưu

source: Your query was updated
vi: Truy vấn của bạn đã được cập nhật

source: Your query could not be updated
vi: Truy vấn của bạn không thể được cập nhật

source: An error occurred while storing your query in the backend. To avoid losing your changes, please save your query using the "Save Query" button.
vi: Đã xảy ra lỗi khi lưu truy vấn của bạn trong backend. Để tránh mất dữ liệu, vui lòng lưu truy vấn của bạn bằng cách sử dụng nút "Lưu Truy Vấn".

source: An error occurred while fetching table metadata. Please contact your administrator.
vi: Đã xảy ra lỗi khi truy xuất siêu dữ liệu bảng. Vui lòng liên hệ quản trị viên.

source: An error occurred while expanding the table schema. Please contact your administrator.
vi: Đã xảy ra lỗi khi mở rộng lược đồ bảng. Vui lòng liên hệ quản trị viên.

source: An error occurred while collapsing the table schema. Please contact your administrator.
vi: Đã xảy ra lỗi khi thu gọn lược đồ bảng. Vui lòng liên hệ quản trị viên.

source: An error occurred while removing the table schema. Please contact your administrator.
vi: Đã xảy ra lỗi khi xóa lược đồ bảng. Vui lòng liên hệ quản trị viên.

source: Shared query
vi: Truy vấn đã được chia sẻ

source: The datasource couldn't be loaded
vi: Dữ liệu nguồn không thể được tải

source: An error occurred while creating the data source
vi: Đã xảy ra lỗi khi tạo nguồn dữ liệu

source: An error occurred while fetching function names.
vi: Đã xảy ra lỗi khi truy xuất tên hàm.
