Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: No Results
vi: Không có Kết quả

source: ERROR
vi: LỖI

source: Found invalid orderby options
vi: Tìm thấy các tùy chọn orderby không hợp lệ

source: Invalid input
vi: Đầu vào không hợp lệ

source: Unexpected error:
vi: Lỗi không mong muốn:

source: (no description, click to see stack trace)
vi: (không có mô tả, nhấp để xem ngăn xếp)

source: Network error
vi: Lỗi mạng

source: Request timed out
vi: Yêu cầu đã hết thời gian

source: Issue 1000 - The dataset is too large to query.
vi: Vấn đề 1000 - Bộ dữ liệu quá lớn để truy vấn.

source: Issue 1001 - The database is under an unusual load.
vi: Vấn đề 1001 - Cơ sở dữ liệu đang gặp tải không bình thường.

source: An error occurred
vi: Đã xảy ra lỗi

source: Sorry, an unknown error occurred.
vi: Xin lỗi, đã xảy ra một lỗi không xác định.

source: Sorry, there was an error saving this %s: %s
vi: Xin lỗi, đã xảy ra lỗi khi lưu %s này: %s

source: You do not have permission to edit this %s
vi: Bạn không có quyền chỉnh sửa %s này

source: is expected to be an integer
vi: được mong đợi là một số nguyên

source: is expected to be a number
vi: được mong đợi là một số

source: is expected to be a Mapbox URL
vi: được mong đợi là một URL Mapbox

source: Value cannot exceed %s
vi: Giá trị không thể vượt quá %s

source: cannot be empty
vi: không thể trống

source: Filters for comparison must have a value
vi: Bộ lọc để so sánh phải có một giá trị

source: Domain
vi: Miền

source: hour
vi: giờ

source: day
vi: ngày

source: The time unit used for the grouping of blocks
vi: Đơn vị thời gian được sử dụng để nhóm các khối

source: Subdomain
vi: Miền con

source: min
vi: phút

source: The time unit for each block. Should be a smaller unit than domain_granularity. Should be larger or equal to Time Grain
vi: Đơn vị thời gian cho mỗi khối. Nên là một đơn vị nhỏ hơn so với domain_granularity. Nên lớn hơn hoặc bằng Đơn vị thời gian

source: Chart Options
vi: Tùy chọn biểu đồ

source: Cell Size
vi: Kích thước ô

source: The size of the square cell, in pixels
vi: Kích thước của ô vuông, tính bằng pixel

source: Cell Padding
vi: Đệm ô

source: The distance between cells, in pixels
vi: Khoảng cách giữa các ô, tính bằng pixel

source: Cell Radius
vi: Bán kính ô

source: The pixel radius
vi: Bán kính tính bằng pixel

source: Color Steps
vi: Bước màu

source: The number color "steps"
vi: Số "bước" màu

source: Time Format
vi: Định dạng thời gian

source: Legend
vi: Chú giải

source: Whether to display the legend (toggles)
vi: Cho phép hiển thị chú giải (chuyển đổi)

source: Show Values
vi: Hiển thị giá trị

source: Whether to display the numerical values within the cells
vi: Cho phép hiển thị các giá trị số trong các ô

source: Show Metric Names
vi: Hiển thị Tên chỉ số

source: Whether to display the metric name as a title
vi: Cho phép hiển thị tên chỉ số như một tiêu đề

source: Number Format
vi: Định dạng số

source: Correlation
vi: Tương quan

source: Visualizes how a metric has changed over a time using a color scale and a calendar view. Gray values are used to indicate missing values and the linear color scheme is used to encode the magnitude of each day's value.
vi: Hình dung cách một chỉ số đã thay đổi qua thời gian bằng cách sử dụng một thang màu và một chế độ xem lịch. Giá trị xám được sử dụng để chỉ các giá trị thiếu và hệ màu tuyến tính được sử dụng để mã hóa lượng mỗi giá trị của mỗi ngày.

source: Business
vi: Doanh nghiệp

source: Comparison
vi: So sánh

source: Intensity
vi: Cường độ

source: Pattern
vi: Mẫu

source: Report
vi: Báo cáo

source: Trend
vi: Xu hướng

source: less than {min} {name}
vi: nhỏ hơn {min} {name}

source: between {down} and {up} {name}
vi: giữa {down} và {up} {name}

source: more than {max} {name}
vi: lớn hơn {max} {name}

source: Sort by metric
vi: Sắp xếp theo chỉ số

source: Whether to sort results by the selected metric in descending order.
vi: Cho phép sắp xếp kết quả theo chỉ số đã chọn theo thứ tự giảm dần.

source: Number format
vi: Định dạng số

source: Choose a number format
vi: Chọn một định dạng số

source: Source
vi: Nguồn

source: Choose a source
vi: Chọn một nguồn

source: Target
vi: Đích

source: Choose a target
vi: Chọn một đích

source: Flow
vi: Dòng chảy

source: Showcases the flow or link between categories using thickness of chords. The value and corresponding thickness can be different for each side.
vi: Trưng bày dòng chảy hoặc liên kết giữa các danh mục bằng cách sử dụng độ dày của dây. Giá trị và độ dày tương ứng có thể khác nhau cho mỗi bên.

source: Relationships between community channels
vi: Mối quan hệ giữa các kênh cộng đồng

source: Chord Diagram
vi: Biểu đồ dây

source: Circular
vi: Tròn

source: Legacy
vi: Di sản

source: Proportional
vi: Tỷ lệ

source: Relational
vi: Liên kết

source: Country
vi: Quốc gia

source: Which country to plot the map for?
vi: Chọn quốc gia để vẽ bản đồ?

source: ISO 3166-2 Codes
vi: Mã ISO 3166-2

source: Column containing ISO 3166-2 codes of region/province/department in your table.
vi: Cột chứa mã ISO 3166-2 của vùng/tỉnh/phòng ban trong bảng của bạn.

source: Metric to display bottom title
vi: Chỉ số để hiển thị tiêu đề phía dưới

source: Map
vi: Bản đồ

source: Visualizes how a single metric varies across a country's principal subdivisions (states, provinces, etc) on a choropleth map. Each subdivision's value is elevated when you hover over the corresponding geographic boundary.
vi: Trực quan hóa cách một chỉ số duy nhất thay đổi qua các phần chính của một quốc gia (bang, tỉnh, v.v.) trên một bản đồ choropleth. Giá trị của mỗi phần được nâng lên khi bạn di chuột qua ranh giới địa lý tương ứng.

source: Geo
vi: Địa lý

source: Range
vi: Phạm vi

source: Stacked
vi: Chồng lên nhau

source: Sorry, there appears to be no data
vi: Xin lỗi, có vẻ không có dữ liệu

source: Event definition
vi: Định nghĩa sự kiện

source: Event Names
vi: Tên sự kiện

source: Columns to display
vi: Cột để hiển thị

source: Order by entity id
vi: Sắp xếp theo id thực thể

source: Important! Select this if the table is not already sorted by entity id, else there is no guarantee that all events for each entity are returned.
vi: Quan trọng! Chọn điều này nếu bảng chưa được sắp xếp theo id thực thể, nếu không không đảm bảo rằng tất cả các sự kiện cho mỗi thực thể sẽ được trả về.

source: Minimum leaf node event count
vi: Số sự kiện tối thiểu của nút lá

source: Leaf nodes that represent fewer than this number of events will be initially hidden in the visualization
vi: Các nút lá đại diện cho ít hơn số lượng sự kiện này sẽ được ẩn ban đầu trong trực quan hóa

source: Additional metadata
vi: Dữ liệu siêu dữ liệu bổ sung

source: Metadata
vi: Siêu dữ liệu

source: Select any columns for metadata inspection
vi: Chọn bất kỳ cột nào để kiểm tra siêu dữ liệu

source: Entity ID
vi: ID thực thể

source: e.g., a "user id" column
vi: ví dụ, một cột "id người dùng"

source: Max Events
vi: Sự kiện tối đa

source: The maximum number of events to return, equivalent to the number of rows
vi: Số lượng sự kiện tối đa để trả về, tương đương với số hàng

source: Compares the lengths of time different activities take in a shared timeline view.
vi: So sánh độ dài thời gian mà các hoạt động khác nhau mất trong một chế độ xem dòng thời gian chung.

source: Event Flow
vi: Dòng sự kiện

source: Progressive
vi: Tiến triển

source: Axis ascending
vi: Trục tăng dần

source: Axis descending
vi: Trục giảm dần

source: Metric ascending
vi: Chỉ số tăng dần

source: Metric descending
vi: Chỉ số giảm dần

source: Heatmap Options
vi: Tùy chọn biểu đồ nhiệt

source: XScale Interval
vi: Khoảng cách XScale

source: Number of steps to take between ticks when displaying the X scale
vi: Số bước để thực hiện giữa các đánh dấu khi hiển thị tỷ lệ X

source: YScale Interval
vi: Khoảng cách YScale

source: Number of steps to take between ticks when displaying the Y scale
vi: Số bước để thực hiện giữa các đánh dấu khi hiển thị tỷ lệ Y

source: Rendering
vi: Kết xuất

source: pixelated (Sharp)
vi: pixelated (Sắc nét)

source: auto (Smooth)
vi: auto (Mượt)

source: image-rendering CSS attribute of the canvas object that defines how the browser scales up the image
vi: Thuộc tính CSS image-rendering của đối tượng canvas xác định cách trình duyệt phóng to hình ảnh

source: Normalize Across
vi: Chuẩn hóa Qua

source: heatmap
vi: biểu đồ nhiệt

source: Color will be shaded based the normalized (0% to 100%) value of a given cell against the other cells in the selected range:
vi: Màu sẽ được tô dựa trên giá trị được chuẩn hóa (từ 0% đến 100%) của một ô cụ thể so với các ô khác trong phạm vi đã chọn:

source: x: values are normalized within each column
vi: x: các giá trị được chuẩn hóa trong mỗi cột

source: y: values are normalized within each row
vi: y: các giá trị được chuẩn hóa trong mỗi hàng

source: heatmap: values are normalized across the entire heatmap
vi: biểu đồ nhiệt: các giá trị được chuẩn hóa trên toàn bộ biểu đồ nhiệt

source: Left Margin
vi: Lề Trái

source: auto
vi: tự động

source: Left margin, in pixels, allowing for more room for axis labels
vi: Lề trái, tính bằng pixel, cho phép nhiều không gian hơn cho nhãn trục

source: Bottom Margin
vi: Lề Dưới

source: Bottom margin, in pixels, allowing for more room for axis labels
vi: Lề dưới, tính bằng pixel, cho phép nhiều không gian hơn cho nhãn trục

source: Value bounds
vi: Giới hạn giá trị

source: Hard value bounds applied for color coding. Is only relevant and applied when the normalization is applied against the whole heatmap.
vi: Giới hạn giá trị cứng được áp dụng cho mã màu. Chỉ có liên quan và được áp dụng khi chuẩn hóa được áp dụng trên toàn bộ biểu đồ nhiệt.

source: Sort X Axis
vi: Sắp xếp Trục X

source: Sort Y Axis
vi: Sắp xếp Trục Y

source: Show percentage
vi: Hiển thị phần trăm

source: Whether to include the percentage in the tooltip
vi: Cho phép bao gồm phần trăm trong gợi ý công cụ

source: Normalized
vi: Đã chuẩn hóa

source: Whether to apply a normal distribution based on rank on the color scale
vi: Cho phép áp dụng phân phối chuẩn dựa trên thứ hạng trên thang màu

source: Value Format
vi: Định dạng Giá trị

source: Visualize a related metric across pairs of groups. Heatmaps excel at showcasing the correlation or strength between two groups. Color is used to emphasize the strength of the link between each pair of groups.
vi: Trực quan hóa một chỉ số liên quan qua các cặp nhóm. Biểu đồ nhiệt xuất sắc trong việc trưng bày mối tương quan hoặc sức mạnh giữa hai nhóm. Màu sắc được sử dụng để nhấn mạnh sức mạnh của liên kết giữa mỗi cặp nhóm.

source: Sizes of vehicles
vi: Kích thước của các phương tiện

source: Employment and education
vi: Việc làm và giáo dục

source: Heatmap (legacy)
vi: Biểu đồ nhiệt (di sản)

source: Density
vi: Mật độ

source: Predictive
vi: Dự đoán

source: Single Metric
vi: Chỉ số Đơn

source: Deprecated
vi: Đã lạc hậu

source: to
vi: đến

source: count
vi: số lượng

source: cumulative
vi: tích lũy

source: percentile (exclusive)
vi: phân vị (độc quyền)

source: Select the numeric columns to draw the histogram
vi: Chọn các cột số để vẽ biểu đồ tần số

source: No of Bins
vi: Số lượng Bins

source: Select the number of bins for the histogram
vi: Chọn số lượng bins cho biểu đồ tần số

source: X Axis Label
vi: Nhãn Trục X

source: Y Axis Label
vi: Nhãn Trục Y

source: Whether to normalize the histogram
vi: Cho phép chuẩn hóa biểu đồ tần số

source: Cumulative
vi: Tích lũy

source: Whether to make the histogram cumulative
vi: Cho phép làm cho biểu đồ tần số tích lũy

source: Distribution
vi: Phân phối

source: Take your data points, and group them into "bins" to see where the densest areas of information lie
vi: Lấy các điểm dữ liệu của bạn và nhóm chúng vào "bins" để xem các khu vực chứa thông tin dày đặc nhất nằm ở đâu

source: Population age data
vi: Dữ liệu dân số theo độ tuổi

source: Contribution
vi: Đóng góp

source: Compute the contribution to the total
vi: Tính toán đóng góp vào tổng

source: Series Height
vi: Chiều cao của loạt

source: Pixel height of each series
vi: Chiều cao của mỗi loạt tính bằng pixel

source: Value Domain
vi: Miền giá trị

source: series
vi: loạt

source: overall
vi: toàn bộ

source: change
vi: thay đổi

source: series: Treat each series independently; overall: All series use the same scale; change: Show changes compared to the first data point in each series
vi: loạt: Xem xét mỗi loạt một cách độc lập; toàn bộ: Tất cả các loạt sử dụng cùng một tỷ lệ; thay đổi: Hiển thị các thay đổi so với điểm dữ liệu đầu tiên trong mỗi loạt

source: Compares how a metric changes over time between different groups. Each group is mapped to a row and change over time is visualized bar lengths and color.
vi: So sánh cách một chỉ số thay đổi theo thời gian giữa các nhóm khác nhau. Mỗi nhóm được ánh xạ vào một hàng và sự thay đổi theo thời gian được trực quan hóa qua độ dài thanh và màu sắc.

source: Horizon Chart
vi: Biểu đồ ngang

source: Dark Cyan
vi: Xanh Lam Đậm

source: Purple
vi: Tím

source: Gold
vi: Vàng

source: Dim Gray
vi: Xám Tối

source: Crimson
vi: Đỏ Tươi

source: Forest Green
vi: Xanh Rừng

source: Longitude
vi: Kinh độ

source: Column containing longitude data
vi: Cột chứa dữ liệu kinh độ

source: Latitude
vi: Vĩ độ

source: Column containing latitude data
vi: Cột chứa dữ liệu vĩ độ

source: Clustering Radius
vi: Bán kính phân cụm

source: The radius (in pixels) the algorithm uses to define a cluster. Choose 0 to turn off clustering, but beware that a large number of points (>1000) will cause lag.
vi: Bán kính (tính bằng pixel) mà thuật toán sử dụng để xác định một cụm. Chọn 0 để tắt phân cụm, nhưng hãy cẩn thận với việc một số lượng lớn điểm (>1000) sẽ gây trễ.

source: Points
vi: Điểm

source: Point Radius
vi: Bán kính điểm

source: The radius of individual points (ones that are not in a cluster). Either a numerical column or `Auto`, which scales the point based on the largest cluster
vi: Bán kính của các điểm cá nhân (những điểm không thuộc một cụm nào). Hoặc là một cột số hoặc `Tự động`, làm tỷ lệ điểm dựa trên cụm lớn nhất

source: Auto
vi: Tự động

source: Point Radius Unit
vi: Đơn vị bán kính điểm

source: Pixels
vi: Pixel

source: Miles
vi: Dặm

source: Kilometers
vi: Kilômét

source: The unit of measure for the specified point radius
vi: Đơn vị đo lường cho bán kính điểm đã được chỉ định

source: Labelling
vi: Đánh nhãn

source: label
vi: nhãn

source: `count` is COUNT(*) if a group by is used. Numerical columns will be aggregated with the aggregator. Non-numerical columns will be used to label points. Leave empty to get a count of points in each cluster.
vi: `count` là COUNT(*) nếu được sử dụng nhóm theo. Các cột số sẽ được tổng hợp với trình tự. Các cột không phải số sẽ được sử dụng để đánh nhãn cho điểm. Để trống để nhận được số lượng điểm trong mỗi cụm.

source: Cluster label aggregator
vi: Tổng hợp nhãn cụm

source: sum
vi: tổng

source: mean
vi: trung bình

source: max
vi: lớn nhất

source: std
vi: độ lệch chuẩn

source: var
vi: phương sai

source: Aggregate function applied to the list of points in each cluster to produce the cluster label.
vi: Hàm tổng hợp được áp dụng vào danh sách điểm trong mỗi cụm để tạo ra nhãn cụm.

source: Visual Tweaks
vi: Điều chỉnh Trực quan

source: Live render
vi: Kết xuất trực tiếp

source: Points and clusters will update as the viewport is being changed
vi: Các điểm và cụm sẽ được cập nhật khi khung nhìn đang được thay đổi

source: Map Style
vi: Kiểu Bản đồ

source: Streets
vi: Đường phố

source: Dark
vi: Tối

source: Light
vi: Sáng

source: Satellite Streets
vi: Đường phố vệ tinh

source: Satellite
vi: Vệ tinh

source: Outdoors
vi: Ngoài trời

source: Base layer map style. See Mapbox documentation: %s
vi: Kiểu bản đồ lớp cơ sở. Xem tài liệu Mapbox: %s

source: Opacity
vi: Độ mờ

source: Opacity of all clusters, points, and labels. Between 0 and 1.
vi: Độ mờ của tất cả các cụm, điểm và nhãn. Từ 0 đến 1.

source: RGB Color
vi: Màu RGB

source: The color for points and clusters in RGB
vi: Màu cho điểm và cụm ở chế độ RGB

source: Viewport
vi: Khung nhìn

source: Default longitude
vi: Kinh độ mặc định

source: Longitude of default viewport
vi: Kinh độ mặc định của khung nhìn

source: Default latitude
vi: Vĩ độ mặc định

source: Latitude of default viewport
vi: Vĩ độ mặc định của khung nhìn

source: Zoom
vi: Thu phóng

source: Zoom level of the map
vi: Mức độ thu phóng của bản đồ

source: One or many controls to group by. If grouping, latitude and longitude columns must be present.
vi: Một hoặc nhiều điều khiển để nhóm theo. Nếu nhóm, các cột vĩ độ và kinh độ phải có mặt.

source: Light mode
vi: Chế độ Sáng

source: Dark mode
vi: Chế độ Tối

source: Scatter
vi: Phân tán

source: Transformable
vi: Có thể biến đổi

source: Significance Level
vi: Mức độ ý nghĩa

source: Threshold alpha level for determining significance
vi: Ngưỡng mức alpha để xác định sự ý nghĩa

source: p-value precision
vi: Độ chính xác của giá trị p

source: Number of decimal places with which to display p-values
vi: Số chữ số thập phân để hiển thị giá trị p

source: Lift percent precision
vi: Độ chính xác phần trăm nâng lên

source: Number of decimal places with which to display lift values
vi: Số chữ số thập phân để hiển thị giá trị nâng lên

source: Table that visualizes paired t-tests, which are used to understand statistical differences between groups.
vi: Bảng trực quan hóa kiểm định t cặp, được sử dụng để hiểu sự khác biệt thống kê giữa các nhóm.

source: Paired t-test Table
vi: Bảng kiểm định t cặp

source: Statistical
vi: Thống kê

source: Tabular
vi: Bảng

source: Options
vi: Tùy chọn

source: Data Table
vi: Bảng dữ liệu

source: Whether to display the interactive data table
vi: Có hiển thị bảng dữ liệu tương tác không

source: Include Series
vi: Bao gồm loạt

source: Include series name as an axis
vi: Bao gồm tên loạt như một trục

source: Ranking
vi: Xếp hạng

source: Plots the individual metrics for each row in the data vertically and links them together as a line. This chart is useful for comparing multiple metrics across all of the samples or rows in the data.
vi: Vẽ các chỉ số cá nhân cho mỗi hàng dữ liệu theo chiều dọc và liên kết chúng lại với nhau bằng một đường kẻ. Biểu đồ này hữu ích để so sánh nhiều chỉ số qua tất cả các mẫu hoặc hàng dữ liệu.

source: Directional
vi: Hướng

source: Time Series Options
vi: Tùy chọn chuỗi thời gian

source: Not Time Series
vi: Không phải chuỗi thời gian

source: Ignore time
vi: Bỏ qua thời gian

source: Time Series
vi: Chuỗi thời gian

source: Standard time series
vi: Chuỗi thời gian tiêu chuẩn

source: Aggregate Mean
vi: Trung bình tổng hợp

source: Mean of values over specified period
vi: Giá trị trung bình trong khoảng thời gian xác định

source: Aggregate Sum
vi: Tổng hợp tổng

source: Sum of values over specified period
vi: Tổng giá trị trong khoảng thời gian xác định

source: Metric change in value from `since` to `until`
vi: Thay đổi chỉ số giá trị từ `kể từ khi` đến `cho đến khi`

source: Percent Change
vi: Thay đổi phần trăm

source: Metric percent change in value from `since` to `until`
vi: Thay đổi phần trăm chỉ số giá trị từ `kể từ khi` đến `cho đến khi`

source: Factor
vi: Yếu tố

source: Metric factor change from `since` to `until`
vi: Thay đổi yếu tố chỉ số từ `kể từ khi` đến `cho đến khi`

source: Advanced Analytics
vi: Phân tích nâng cao

source: Use the Advanced Analytics options below
vi: Sử dụng các tùy chọn Phân tích nâng cao dưới đây

source: Settings for time series
vi: Cài đặt cho chuỗi thời gian

source: Date Time Format
vi: Định dạng Ngày Giờ

source: Partition Limit
vi: Giới hạn phân vùng

source: The maximum number of subdivisions of each group; lower values are pruned first
vi: Số lượng phân khu tối đa của mỗi nhóm; các giá trị thấp hơn sẽ bị cắt tỉa trước

source: Partition Threshold
vi: Ngưỡng phân vùng

source: Partitions whose height to parent height proportions are below this value are pruned
vi: Các phân vùng có tỷ lệ chiều cao so với chiều cao gốc dưới giá trị này sẽ bị cắt tỉa

source: Log Scale
vi: Thang logarit

source: Use a log scale
vi: Sử dụng thang logarit

source: Equal Date Sizes
vi: Kích thước ngày bằng nhau

source: Check to force date partitions to have the same height
vi: Kiểm tra để buộc các phân vùng ngày có cùng chiều cao

source: Rich Tooltip
vi: Chú giải phong phú

source: The rich tooltip shows a list of all series for that point in time
vi: Chú giải phong phú hiển thị danh sách tất cả các loạt cho điểm thời gian đó

source: Rolling Window
vi: Cửa sổ cuộn

source: Rolling Function
vi: Chức năng cuộn

source: cumsum
vi: tổng tích lũy

source: Min Periods
vi: Khoảng thời gian tối thiểu

source: Time Comparison
vi: So sánh thời gian

source: Time Shift
vi: Thay đổi thời gian

source: 1 week
vi: 1 tuần

source: 28 days
vi: 28 ngày

source: 30 days
vi: 30 ngày

source: 52 weeks
vi: 52 tuần

source: 1 year
vi: 1 năm

source: 104 weeks
vi: 104 tuần

source: 2 years
vi: 2 năm

source: 156 weeks
vi: 156 tuần

source: 3 years
vi: 3 năm

source: Overlay one or more timeseries from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported.
vi: Chồng lên một hoặc nhiều chuỗi thời gian từ một khoảng thời gian tương đối. Mong đợi các delta thời gian tương đối bằng ngôn ngữ tự nhiên (ví dụ: 24 giờ, 7 ngày, 52 tuần, 365 ngày). Hỗ trợ văn bản tự do.

source: Actual Values
vi: Giá trị thực tế

source: Method
vi: Phương pháp

source: median
vi: trung vị

source: Part of a Whole
vi: Một phần của toàn bộ

source: Compare the same summarized metric across multiple groups.
vi: So sánh cùng một chỉ số tóm tắt qua nhiều nhóm.

source: Partition Chart
vi: Biểu đồ phân vùng

source: Categorical
vi: Phân loại

source: Use Area Proportions
vi: Sử dụng tỷ lệ diện tích

source: Check if the Rose Chart should use segment area instead of segment radius for proportioning
vi: Kiểm tra xem Biểu đồ Hoa hồng có nên sử dụng diện tích đoạn thay vì bán kính đoạn để tỷ lệ không

source: A polar coordinate chart where the circle is broken into wedges of equal angle, and the value represented by any wedge is illustrated by its area, rather than its radius or sweep angle.
vi: Một biểu đồ tọa độ cực nơi vòng tròn được chia thành các phần hình nêm có góc bằng nhau, và giá trị được đại diện bởi bất kỳ hình nêm nào được minh họa bằng diện tích của nó, thay vì bán kính hoặc góc quét.

source: Nightingale Rose Chart
vi: Biểu đồ Hoa hồng Nightingale

source: Advanced-Analytics
vi: Phân tích nâng cao

source: Multi-Layers
vi: Đa lớp

source: Source / Target
vi: Nguồn / Đích

source: Choose a source and a target
vi: Chọn một nguồn và một đích

source: Limiting rows may result in incomplete data and misleading charts. Consider filtering or grouping source/target names instead.
vi: Giới hạn số hàng có thể dẫn đến dữ liệu không đầy đủ và biểu đồ sai lệch. Hãy xem xét lọc hoặc nhóm tên nguồn/đích thay thế.

source: Visualizes the flow of different group's values through different stages of a system. New stages in the pipeline are visualized as nodes or layers. The thickness of the bars or edges represent the metric being visualized.
vi: Hình dung luồng giá trị của các nhóm khác nhau qua các giai đoạn khác nhau của một hệ thống. Các giai đoạn mới trong quy trình được hiển thị dưới dạng các nút hoặc lớp. Độ dày của thanh hoặc cạnh đại diện cho chỉ số đang được hình dung.

source: Demographics
vi: Nhân khẩu học

source: Survey Responses
vi: Phản hồi khảo sát

source: Sankey Diagram
vi: Biểu đồ Sankey

source: Percentages
vi: Phần trăm

source: Sankey Diagram with Loops
vi: Biểu đồ Sankey có vòng lặp

source: Country Field Type
vi: Loại trường quốc gia

source: Full name
vi: Tên đầy đủ

source: code International Olympic Committee (cioc)
vi: mã Ủy ban Olympic Quốc tế (cioc)
