Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: SQL Lab uses your browser's local storage to store queries and results. Currently, you are using %(currentUsage)s KB out of %(maxStorage)d KB storage space. To keep SQL Lab from crashing, please delete some query tabs. You can re-access these queries by using the Save feature before you delete the tab. Note that you will need to close other SQL Lab windows before you do this.
vi: SQL Lab sử dụng bộ nhớ địa phương của trình duyệt của bạn để lưu trữ truy vấn và kết quả. Hiện tại, bạn đang sử dụng %(currentUsage)s KB trên tổng số %(maxStorage)d KB không gian lưu trữ. Để tránh SQL Lab bị crash, vui lòng xóa một số tab truy vấn. Bạn có thể truy cập lại các truy vấn này bằng cách sử dụng tính năng Lưu trước khi xóa tab. Lưu ý rằng bạn sẽ cần đóng các cửa sổ SQL Lab khác trước khi thực hiện điều này.

source: Primary key
vi: Khóa chính

source: Foreign key
vi: Khóa ngoại

source: Index
vi: Chỉ mục

source: Estimate selected query cost
vi: Ước lượng chi phí truy vấn được chọn

source: Estimate cost
vi: Ước lượng chi phí

source: Cost estimate
vi: Ước lượng chi phí

source: Creating a data source and creating a new tab
vi: Tạo nguồn dữ liệu và tạo một tab mới

source: Explore the result set in the data exploration view
vi: Khám phá kết quả trong chế độ khám phá dữ liệu

source: explore
vi: khám phá

source: Create Chart
vi: Tạo biểu đồ

source: Source SQL
vi: SQL Nguồn

source: Executed SQL
vi: SQL đã thực thi

source: Run query
vi: Chạy truy vấn

source: Run current query
vi: Chạy truy vấn hiện tại

source: Stop query
vi: Dừng truy vấn

source: New tab
vi: Tab mới

source: Previous Line
vi: Dòng Trước

source: Format SQL
vi: Định dạng SQL

source: Find
vi: Tìm

source: Keyboard shortcuts
vi: Phím tắt bàn phím

source: Run a query to display query history
vi: Chạy một truy vấn để hiển thị lịch sử truy vấn

source: LIMIT
vi: GIỚI HẠN

source: State
vi: Trạng thái

source: Started
vi: Bắt đầu

source: Duration
vi: Thời lượng

source: Results
vi: Kết quả

source: Actions
vi: Hành động

source: Success
vi: Thành công

source: Failed
vi: Thất bại

source: Running
vi: Đang chạy

source: Fetching
vi: Đang tải

source: Offline
vi: Ngoại tuyến

source: Scheduled
vi: Đã lên lịch

source: Unknown Status
vi: Trạng thái không xác định

source: Edit
vi: Chỉnh sửa

source: View
vi: Xem

source: Data preview
vi: Xem trước dữ liệu

source: Overwrite text in the editor with a query on this table
vi: Ghi đè văn bản trong biên tập viên bằng một truy vấn trên bảng này

source: Run query in a new tab
vi: Chạy truy vấn trong một tab mới

source: Remove query from log
vi: Xóa truy vấn khỏi log

source: Unable to create chart without a query id.
vi: Không thể tạo biểu đồ mà không có ID truy vấn.

source: Save & Explore
vi: Lưu & Khám phá

source: Overwrite & Explore
vi: Ghi đè & Khám phá

source: Save this query as a virtual dataset to continue exploring
vi: Lưu truy vấn này dưới dạng bộ dữ liệu ảo để tiếp tục khám phá

source: Download to CSV
vi: Tải xuống CSV

source: Copy to Clipboard
vi: Sao chép vào Clipboard

source: Filter results
vi: Lọc kết quả

source: The number of results displayed is limited to %(rows)d by the configuration DISPLAY_MAX_ROW. Please add additional limits/filters or download to csv to see more rows up to the %(limit)d limit.
vi: Số kết quả hiển thị được giới hạn đến %(rows)d bởi cấu hình DISPLAY_MAX_ROW. Vui lòng thêm các giới hạn/bộ lọc bổ sung hoặc tải xuống csv để xem thêm hàng đến giới hạn %(limit)d.

source: The number of results displayed is limited to %(rows)d. Please add additional limits/filters, download to csv, or contact an admin to see more rows up to the %(limit)d limit.
vi: Số kết quả hiển thị được giới hạn đến %(rows)d. Vui lòng thêm các giới hạn/bộ lọc bổ sung, tải xuống csv, hoặc liên hệ với quản trị viên để xem thêm hàng đến giới hạn %(limit)d.

source: The number of rows displayed is limited to %(rows)d by the query
vi: Số hàng hiển thị được giới hạn đến %(rows)d bởi truy vấn

source: The number of rows displayed is limited to %(rows)d by the limit dropdown.
vi: Số hàng hiển thị được giới hạn đến %(rows)d bởi danh sách thả xuống giới hạn.

source: The number of rows displayed is limited to %(rows)d by the query and limit dropdown.
vi: Số hàng hiển thị được giới hạn đến %(rows)d bởi truy vấn và danh sách thả xuống giới hạn.

source: %(rows)d rows returned
vi: %(rows)d hàng được trả về

source: The number of rows displayed is limited to %(rows)d by the dropdown.
vi: Số hàng hiển thị được giới hạn đến %(rows)d bởi danh sách thả xuống.

source: Track job
vi: Theo dõi công việc

source: See query details
vi: Xem chi tiết truy vấn

source: Query was stopped
vi: Truy vấn đã bị dừng lại

source: Database error
vi: Lỗi cơ sở dữ liệu

source: was created
vi: đã được tạo

source: Query in a new tab
vi: Truy vấn trong một tab mới

source: The query returned no data
vi: Truy vấn không trả về dữ liệu

source: Fetch data preview
vi: Tải xem trước dữ liệu

source: Refetch results
vi: Tải lại kết quả

source: Stop
vi: Dừng

source: Run selection
vi: Chạy lựa chọn

source: Run
vi: Chạy

source: Stop running (Ctrl + x)
vi: Dừng chạy (Ctrl + x)

source: Stop running (Ctrl + e)
vi: Dừng chạy (Ctrl + e)

source: Run query (Ctrl + Return)
vi: Chạy truy vấn (Ctrl + Return)

source: Save
vi: Lưu

source: Untitled Dataset
vi: Bộ dữ liệu Chưa đặt tên

source: An error occurred saving dataset
vi: Đã xảy ra lỗi khi lưu bộ dữ liệu

source: Save or Overwrite Dataset
vi: Lưu hoặc Ghi đè bộ dữ liệu

source: Back
vi: Quay lại

source: Save as new
vi: Lưu dưới dạng mới

source: Overwrite existing
vi: Ghi đè lên hiện tại

source: Select or type dataset name
vi: Chọn hoặc nhập tên bộ dữ liệu

source: Existing dataset
vi: Bộ dữ liệu hiện có

source: Are you sure you want to overwrite this dataset?
vi: Bạn có chắc chắn muốn ghi đè lên bộ dữ liệu này không?

source: Undefined
vi: Chưa xác định

source: Save dataset
vi: Lưu bộ dữ liệu

source: Save as
vi: Lưu dưới dạng

source: Save query
vi: Lưu truy vấn

source: Cancel
vi: Hủy

source: Update
vi: Cập nhật

source: Label for your query
vi: Nhãn cho truy vấn của bạn

source: Write a description for your query
vi: Viết mô tả cho truy vấn của bạn

source: Submit
vi: Gửi

source: Schedule query
vi: Lên lịch truy vấn

source: Schedule
vi: Lên lịch

source: There was an error with your request
vi: Đã xảy ra lỗi với yêu cầu của bạn

source: Please save the query to enable sharing
vi: Vui lòng lưu truy vấn để kích hoạt chia sẻ

source: Copy query link to your clipboard
vi: Sao chép liên kết truy vấn vào Clipboard của bạn

source: Save the query to enable this feature
vi: Lưu truy vấn để kích hoạt tính năng này

source: Copy link
vi: Sao chép liên kết

source: Run a query to display results
vi: Chạy một truy vấn để hiển thị kết quả

source: No stored results found, you need to re-run your query
vi: Không tìm thấy kết quả đã lưu, bạn cần phải chạy lại truy vấn của mình

source: Query history
vi: Lịch sử truy vấn

source: Preview: `%s`
vi: Xem trước: `%s`

source: Schedule the query periodically
vi: Lên lịch truy vấn định kỳ

source: You must run the query successfully first
vi: Bạn phải chạy truy vấn thành công trước

source: Render HTML
vi: Hiển thị HTML

source: Autocomplete
vi: Tự động hoàn thành

source: CREATE TABLE AS
vi: Tạo BẢNG NHƯ

source: CREATE VIEW AS
vi: Tạo XEM NHƯ

source: Estimate the cost before running a query
vi: Ước lượng chi phí trước khi chạy một truy vấn

source: Specify name to CREATE VIEW AS schema in: public
vi: Chỉ định tên để TẠO XEM NHƯ như lược đồ trong: public

source: Specify name to CREATE TABLE AS schema in: public
vi: Chỉ định tên để TẠO BẢNG NHƯ như lược đồ trong: public

source: Select a database to write a query
vi: Chọn một cơ sở dữ liệu để viết truy vấn

source: Choose one of the available databases from the panel on the left.
vi: Chọn một trong số các cơ sở dữ liệu có sẵn từ bảng điều khiển bên trái.

source: Create
vi: Tạo

source: Collapse table preview
vi: Thu gọn xem trước bảng

source: Expand table preview
vi: Mở rộng xem trước bảng

source: Reset state
vi: Đặt lại trạng thái

source: Enter a new title for the tab
vi: Nhập tiêu đề mới cho tab

source: Close tab
vi: Đóng tab

source: Rename tab
vi: Đổi tên tab

source: Expand tool bar
vi: Mở rộng thanh công cụ

source: Hide tool bar
vi: Ẩn thanh công cụ

source: Close all other tabs
vi: Đóng tất cả các tab khác

source: Duplicate tab
vi: Sao chép tab

source: Add a new tab
vi: Thêm một tab mới

source: New tab (Ctrl + q)
vi: Tab mới (Ctrl + q)

source: New tab (Ctrl + t)
vi: Tab mới (Ctrl + t)

source: Add a new tab to create SQL Query
vi: Thêm một tab mới để tạo Truy vấn SQL

source: An error occurred while fetching table metadata
vi: Đã xảy ra lỗi khi lấy dữ liệu siêu dữ liệu bảng

source: Copy partition query to clipboard
vi: Sao chép truy vấn phân vùng vào bảng ghi tạm

source: latest partition:
vi: phân vùng mới nhất:

source: Keys for table
vi: Khóa cho bảng

source: View keys & indexes (%s)
vi: Xem khóa và chỉ mục (%s)

source: Original table column order
vi: Thứ tự cột ban đầu của bảng

source: Sort columns alphabetically
vi: Sắp xếp cột theo thứ tự chữ cái

source: Copy SELECT statement to the clipboard
vi: Sao chép câu lệnh SELECT vào bảng ghi tạm

source: Show CREATE VIEW statement
vi: Hiển thị câu lệnh TẠO XEM NHƯ

source: CREATE VIEW statement
vi: Câu lệnh TẠO XEM NHƯ

source: Remove table preview
vi: Xóa xem trước bảng

source: Assign a set of parameters as
vi: Gán một tập hợp các tham số như

source: below (example:
vi: dưới đây (ví dụ:

source: ), and they become available in your SQL (example:
vi: ), và chúng sẽ có sẵn trong SQL của bạn (ví dụ:

source: by using
vi: bằng cách sử dụng

source: Jinja templating
vi: templating Jinja

source: syntax.
vi: cú pháp.

source: Edit template parameters
vi: Chỉnh sửa tham số mẫu

source: Parameters
vi: Tham số

source: Invalid JSON
vi: JSON không hợp lệ

source: Untitled query
vi: Truy vấn không có tiêu đề

source: Control
vi: Điều khiển

source: Before
vi: Trước

source: After
vi: Sau

source: Click to see difference
vi: Nhấp để xem sự khác biệt

source: Altered
vi: Thay đổi

source: Chart changes
vi: Thay đổi biểu đồ

source: Modified by: %s
vi: Được sửa đổi bởi: %s

source: Loaded data cached
vi: Dữ liệu đã tải được lưu vào bộ nhớ đệm

source: Loaded from cache
vi: Đã tải từ bộ nhớ đệm

source: Click to force-refresh
vi: Nhấp để làm mới bắt buộc

source: Cached
vi: Được lưu vào bộ nhớ đệm

source: Waiting on %s
vi: Đang chờ trên %s

source: Waiting on database...
vi: Đang chờ trên cơ sở dữ liệu...

source: Add required control values to preview chart
vi: Thêm các giá trị điều khiển cần thiết để xem trước biểu đồ

source: Your chart is ready to go!
vi: Biểu đồ của bạn đã sẵn sàng!

source: Click on "Create chart" button in the control panel on the left to preview a visualization or
vi: Nhấp vào nút "Tạo biểu đồ" trong báo cáo bên trái để xem trước một trực quan hoá hoặc

source: click here
vi: nhấp vào đây

source: No results were returned for this query
vi: Không có kết quả nào được trả về cho truy vấn này

source: Make sure that the controls are configured properly and the datasource contains data for the selected time range
vi: Đảm bảo rằng các điều khiển được cấu hình đúng và nguồn dữ liệu chứa dữ liệu cho phạm vi thời gian đã chọn

source: An error occurred while loading the SQL
vi: Đã xảy ra lỗi khi tải SQL

source: Sorry, an error occurred
vi: Xin lỗi, đã xảy ra lỗi

source: Updating chart was stopped
vi: Đã dừng việc cập nhật biểu đồ

source: An error occurred while rendering the visualization: %s
vi: Đã xảy ra lỗi khi hiển thị trực quan hóa: %s

source: Network error.
vi: Lỗi mạng.

source: Cross-filter will be applied to all of the charts that use this dataset.
vi: Bộ lọc chéo sẽ được áp dụng cho tất cả các biểu đồ sử dụng bộ dữ liệu này.

source: You can also just click on the chart to apply cross-filter.
vi: Bạn cũng có thể chỉ cần nhấp vào biểu đồ để áp dụng bộ lọc chéo.

source: Cross-filtering is not enabled for this dashboard.
vi: Bộ lọc chéo không được kích hoạt cho báo cáo này.

source: This visualization type does not support cross-filtering.
vi: Loại trực quan hoá này không hỗ trợ bộ lọc chéo.

source: You can't apply cross-filter on this data point.
vi: Bạn không thể áp dụng bộ lọc chéo cho điểm dữ liệu này.

source: Remove cross-filter
vi: Xóa bộ lọc chéo

source: Add cross-filter
vi: Thêm bộ lọc chéo

source: Failed to load dimensions for drill by
vi: Không thể tải các chiều để xem chi tiết

source: Drill by is not yet supported for this chart type
vi: Chức năng xem chi tiết vẫn chưa được hỗ trợ cho loại biểu đồ này

source: Drill by is not available for this data point
vi: Xem chi tiết theo không khả dụng cho điểm dữ liệu này

source: Drill by
vi: Xem chi tiết theo

source: Search columns
vi: Tìm kiếm cột

source: No columns found
vi: Không tìm thấy cột nào

source: Failed to generate chart edit URL
vi: Không thể tạo URL chỉnh sửa biểu đồ

source: You do not have sufficient permissions to edit the chart
vi: Bạn không có đủ quyền để chỉnh sửa biểu đồ

source: Edit chart
vi: Chỉnh sửa biểu đồ

source: Close
vi: Đóng

source: Failed to load chart data.
vi: Không thể tải dữ liệu biểu đồ.

source: Drill by: %s
vi: Xem chi tiết theo: %s

source: There was an error loading the chart data
vi: Đã xảy ra lỗi khi tải dữ liệu biểu đồ

source: Results %s
vi: Kết quả %s

source: Drill to detail
vi: Xem chi tiết

source: Drill to detail by
vi: Xem chi tiết theo

source: Drill to detail is disabled for this database. Change the database settings to enable it.
vi: Chức năng xem chi tiết bị vô hiệu hóa cho cơ sở dữ liệu này. Hãy thay đổi cài đặt cơ sở dữ liệu để kích hoạt nó.

source: Drill to detail is disabled because this chart does not group data by dimension value.
vi: Chức năng xem chi tiết bị vô hiệu hóa vì biểu đồ này không nhóm dữ liệu theo giá trị chiều.

source: Right-click on a dimension value to drill to detail by that value.
vi: Nhấp chuột phải vào một giá trị chiều để xem chi tiết theo giá trị đó.

source: Drill to detail by value is not yet supported for this chart type.
vi: Chức năng xem chi tiết theo giá trị vẫn chưa được hỗ trợ cho loại biểu đồ này.

source: Drill to detail: %s
vi: Xem chi tiết: %s

source: Formatting
vi: Định dạng

source: Formatted value
vi: Giá trị đã định dạng

source: No rows were returned for this dataset
vi: Không có hàng nào được trả về cho tập dữ liệu này

source: Reload
vi: Tải lại

source: Copy
vi: Sao chép

source: Copy to clipboard
vi: Sao chép vào bảng tạm

source: Copied to clipboard!
vi: Đã sao chép vào bảng tạm!

source: Sorry, your browser does not support copying. Use Ctrl / Cmd + C!
vi: Xin lỗi, trình duyệt của bạn không hỗ trợ sao chép. Sử dụng Ctrl / Cmd + C!

source: every
vi: mỗi

source: every month
vi: mỗi tháng

source: every day of the month
vi: mỗi ngày của tháng

source: day of the month
vi: ngày của tháng

source: every day of the week
vi: mỗi ngày của tuần

source: day of the week
vi: ngày của tuần

source: every hour
vi: mỗi giờ

source: every minute
vi: mỗi phút

source: minute
vi: phút

source: reboot
vi: khởi động lại

source: Every
vi: Mỗi

source: in
vi: trong

source: on
vi: vào

source: or
vi: hoặc

source: at
vi: vào lúc

source: minute(s)
vi: phút

source: Invalid cron expression
vi: Biểu thức cron không hợp lệ

source: Clear
vi: Xóa

source: Sunday
vi: Chủ nhật

source: Monday
vi: Thứ hai

source: Tuesday
vi: Thứ ba

source: Wednesday
vi: Thứ tư

source: Thursday
vi: Thứ năm

source: Friday
vi: Thứ sáu

source: Saturday
vi: Thứ bảy

source: January
vi: Tháng Một

source: February
vi: Tháng Hai

source: March
vi: Tháng Ba

source: April
vi: Tháng Tư

source: May
vi: Tháng Năm

source: June
vi: Tháng Sáu

source: July
vi: Tháng Bảy

source: August
vi: Tháng Tám

source: September
vi: Tháng Chín

source: October
vi: Tháng Mười

source: November
vi: Tháng Mười Một

source: December
vi: Tháng Mười Hai

source: SUN
vi: CN

source: MON
vi: T2

source: TUE
vi: T3

source: WED
vi: T4

source: THU
vi: T5

source: FRI
vi: T6

source: SAT
vi: T7

source: JAN
vi: THG 1

source: FEB
vi: THG 2

source: MAR
vi: THG 3

source: APR
vi: THG 4

source: MAY
vi: THG 5

source: JUN
vi: THG 6

source: JUL
vi: THG 7

source: AUG
vi: THG 8

source: SEP
vi: THG 9

source: OCT
vi: THG 10

source: NOV
vi: THG 11

source: DEC
vi: THG 12

source: There was an error loading the schemas
vi: Đã xảy ra lỗi khi tải các schema

source: Select database or type to search databases
vi: Chọn cơ sở dữ liệu hoặc gõ để tìm kiếm cơ sở dữ liệu

source: Force refresh schema list
vi: Làm mới danh sách schema

source: Select schema or type to search schemas
vi: Chọn schema hoặc gõ để tìm kiếm schema

source: No compatible schema found
vi: Không tìm thấy schema tương thích

source: Warning! Changing the dataset may break the chart if the metadata does not exist.
vi: Cảnh báo! Thay đổi tập dữ liệu có thể làm hỏng biểu đồ nếu không có dữ liệu metadata.

source: Changing the dataset may break the chart if the chart relies on columns or metadata that does not exist in the target dataset
vi: Thay đổi tập dữ liệu có thể làm hỏng biểu đồ nếu biểu đồ phụ thuộc vào các cột hoặc metadata không tồn tại trong tập dữ liệu đích

source: dataset
vi: tập dữ liệu

source: Successfully changed dataset!
vi: Thay đổi tập dữ liệu thành công!

source: Connection
vi: Kết nối

source: Swap dataset
vi: Đổi tập dữ liệu

source: Proceed
vi: Tiếp tục

source: Warning!
vi: Cảnh báo!

source: Search / Filter
vi: Tìm kiếm / Lọc

source: Add item
vi: Thêm mục

source: STRING
vi: CHUỖI

source: NUMERIC
vi: SỐ

source: DATETIME
vi: NGÀY THÁNG

source: Physical (table or view)
vi: Vật lý (bảng hoặc view)

source: Virtual (SQL)
vi: Ảo (SQL)

source: Data type
vi: Kiểu dữ liệu

source: Advanced data type
vi: Kiểu dữ liệu nâng cao

source: Advanced Data type
vi: Kiểu dữ liệu Nâng cao

source: Datetime format
vi: Định dạng ngày tháng

source: The pattern of timestamp format. For strings use
vi: Mẫu định dạng timestamp. Đối với chuỗi, sử dụng

source: Python datetime string pattern
vi: Mẫu chuỗi datetime của Python

source: expression which needs to adhere to the
vi: biểu thức cần tuân thủ

source: standard to ensure that the lexicographical ordering coincides with the chronological ordering. If the timestamp format does not adhere to the ISO 8601 standard you will need to define an expression and type for transforming the string into a date or timestamp. Note currently time zones are not supported. If time is stored in epoch format, put `epoch_s` or `epoch_ms`. If no pattern is specified we fall back to using the optional defaults on a per database/column name level via the extra parameter.
vi: tiêu chuẩn để đảm bảo rằng sắp xếp theo thứ tự từ điển tương ứng với sắp xếp theo thời gian. Nếu định dạng timestamp không tuân thủ tiêu chuẩn ISO 8601 bạn sẽ cần xác định một biểu thức và kiểu dữ liệu để chuyển đổi chuỗi thành ngày tháng hoặc timestamp. Lưu ý hiện tại không hỗ trợ múi giờ. Nếu thời gian được lưu dưới dạng epoch, hãy đặt `epoch_s` hoặc `epoch_ms`. Nếu không có mẫu được chỉ định, chúng tôi sẽ trở lại việc sử dụng các giá trị mặc định tùy chọn trên mỗi cơ sở dữ liệu/tên cột thông qua tham số extra.

source: Certified By
vi: Chứng nhận Bởi

source: Person or group that has certified this metric
vi: Người hoặc nhóm đã chứng nhận chỉ số này

source: Certified by
vi: Được chứng nhận bởi

source: Certification details
vi: Chi tiết chứng nhận

source: Details of the certification
vi: Chi tiết của chứng nhận

source: Is dimension
vi: Là chiều

source: Default datetime
vi: Ngày giờ mặc định

source: Is filterable
vi: Có thể lọc

source: <new column>
vi: <cột mới>

source: Select owners
vi: Chọn chủ sở hữu

source: Modified columns: %s
vi: Các cột đã được sửa đổi: %s

source: Removed columns: %s
vi: Các cột đã bị xóa: %s

source: New columns added: %s
vi: Các cột mới được thêm: %s

source: Metadata has been synced
vi: Metadata đã được đồng bộ hóa

source: An error has occurred
vi: Đã xảy ra lỗi

source: Column name [%s] is duplicated
vi: Tên cột [%s] đã bị trùng

source: Metric name [%s] is duplicated
vi: Tên chỉ số [%s] đã bị trùng

source: Calculated column [%s] requires an expression
vi: Cột tính toán [%s] yêu cầu một biểu thức

source: Invalid currency code in saved metrics
vi: Mã tiền tệ không hợp lệ trong chỉ số đã lưu

source: Basic
vi: Cơ bản

source: Default URL
vi: URL mặc định

source: Default URL to redirect to when accessing from the dataset list page
vi: URL mặc định để chuyển hướng đến khi truy cập từ trang danh sách tập dữ liệu

source: Autocomplete filters
vi: Bộ lọc tự động hoàn chỉnh

source: Whether to populate autocomplete filters options
vi: Có nên điền vào các tùy chọn bộ lọc tự động hoàn chỉnh không

source: Autocomplete query predicate
vi: Khi sử dụng "Bộ lọc tự động hoàn chỉnh", điều này có thể được sử dụng để cải thiện hiệu suất của câu truy vấn lấy giá trị. Sử dụng tùy chọn này để áp dụng một điều kiện (mệnh đề WHERE) cho câu truy vấn chọn các giá trị phân biệt từ bảng. Thông thường mục đích sẽ là giới hạn quét bằng cách áp dụng bộ lọc thời gian tương đối trên một trường liên quan đến thời gian được phân vùng hoặc được chỉ mục.

source: When using "Autocomplete filters", this can be used to improve performance of the query fetching the values. Use this option to apply a predicate (WHERE clause) to the query selecting the distinct values from the table. Typically the intent would be to limit the scan by applying a relative time filter on a partitioned or indexed time-related field.
vi: Khi sử dụng "Bộ lọc tự động hoàn chỉnh", điều này có thể được sử dụng để cải thiện hiệu suất của câu truy vấn lấy giá trị. Sử dụng tùy chọn này để áp dụng một điều kiện (mệnh đề WHERE) cho câu truy vấn chọn các giá trị phân biệt từ bảng. Thông thường mục đích sẽ là giới hạn quét bằng cách áp dụng bộ lọc thời gian tương đối trên một trường liên quan đến thời gian được phân vùng hoặc được chỉ mục.

source: Extra data to specify table metadata. Currently supports metadata of the format: `{ "certification": { "certified_by": "Data Platform Team", "details": "This table is the source of truth." }, "warning_markdown": "This is a warning." }`.
vi: Dữ liệu bổ sung để chỉ định siêu dữ liệu bảng. Hiện đang hỗ trợ siêu dữ liệu của định dạng: `{ "chứng nhận": { "được chứng nhận bởi": "Nhóm Nền tảng Dữ liệu", "chi tiết": "Bảng này là nguồn tin cậy." }, "cảnh báo_markdown": "Đây là cảnh báo." }`.

source: Cache timeout
vi: Thời gian chờ cache

source: The duration of time in seconds before the cache is invalidated. Set to -1 to bypass the cache.
vi: Thời lượng thời gian tính bằng giây trước khi bộ nhớ cache bị vô hiệu hóa. Đặt -1 để bỏ qua bộ nhớ cache.

source: Hours offset
vi: Độ lệch giờ

source: The number of hours, negative or positive, to shift the time column. This can be used to move UTC time to local time.
vi: Số giờ, âm hoặc dương, để dời cột thời gian. Điều này có thể được sử dụng để chuyển đổi thời gian UTC thành thời gian địa phương.

source: Normalize column names
vi: Chuẩn hóa tên cột

source: Always filter main datetime column
vi: Luôn lọc cột ngày giờ chính

source: When the secondary temporal columns are filtered, apply the same filter to the main datetime column.
vi: Khi các cột thời gian phụ được lọc, áp dụng cùng bộ lọc cho cột ngày giờ chính.

source: <new spatial>
vi: <không có loại>

source: <no type>
vi: <không có loại>

source: Click the lock to make changes.
vi: Nhấp vào khóa để thực hiện các thay đổi.

source: Click the lock to prevent further changes.
vi: Nhấp vào khóa để ngăn chặn các thay đổi tiếp theo.

source: virtual
vi: ảo

source: Dataset name
vi: Tên tập dữ liệu
