Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: This controls whether the time grain field from the current view should be passed down to the chart containing the annotation data.
vi: Điều này điều khiển liệu trường thời gian từ chế độ xem hiện tại có nên được chuyển xuống biểu đồ chứa dữ liệu chú thích hay không.

source: Time delta in natural language (example: 24 hours, 7 days, 56 weeks, 365 days)
vi: Chênh lệch thời gian bằng ngôn ngữ tự nhiên (ví dụ: 24 giờ, 7 ngày, 56 tuần, 365 ngày)

source: Display configuration
vi: Cấu hình hiển thị

source: Configure your how you overlay is displayed here.
vi: Cấu hình cách hiển thị lớp chồng lên của bạn ở đây.

source: Annotation layer stroke
vi: Đường nét của lớp chú thích

source: Style
vi: Kiểu

source: Solid
vi: Cứng

source: Dashed
vi: Gạch

source: Long dashed
vi: Gạch nối dài

source: Dotted
vi: Chấm

source: Annotation layer opacity
vi: Độ mờ của lớp chú thích

source: Color
vi: Màu sắc

source: Automatic Color
vi: Màu tự động

source: Shows or hides markers for the time series
vi: Hiển thị hoặc ẩn đánh dấu cho chuỗi thời gian

source: Hide Line
vi: Ẩn đường

source: Hides the Line for the time series
vi: Ẩn đường cho chuỗi thời gian

source: Layer configuration
vi: Cấu hình lớp

source: Configure the basics of your Annotation Layer.
vi: Cấu hình cơ bản của lớp chú thích của bạn.

source: Mandatory
vi: Bắt buộc

source: Hide layer
vi: Ẩn lớp

source: Show label
vi: Hiển thị nhãn

source: Whether to always show the annotation label
vi: Cho phép luôn hiển thị nhãn chú thích

source: Annotation layer type
vi: Loại lớp chú thích

source: Choose the annotation layer type
vi: Chọn loại lớp chú thích

source: Annotation source type
vi: Loại nguồn chú thích

source: Choose the source of your annotations
vi: Chọn nguồn của các chú thích của bạn

source: Annotation source
vi: Nguồn chú thích

source: Remove
vi: Xóa

source: Time series
vi: Dãy thời gian

source: Edit annotation layer
vi: Chỉnh sửa lớp chú thích

source: Add annotation layer
vi: Thêm lớp chú thích

source: Empty collection
vi: Bộ sưu tập trống

source: Add an item
vi: Thêm một mục

source: Remove item
vi: Xóa mục

source: This color scheme is being overridden by custom label colors. Check the JSON metadata in the Advanced settings
vi: Bảng màu này đang được ghi đè bởi các màu nhãn tùy chỉnh. Kiểm tra dữ liệu siêu văn bản JSON trong các cài đặt Nâng cao

source: The color scheme is determined by the related dashboard. Edit the color scheme in the dashboard properties.
vi: Bảng màu được xác định bởi báo cáo liên quan. Chỉnh sửa bảng màu trong thuộc tính báo cáo.

source: dashboard
vi: báo cáo

source: Dashboard scheme
vi: Kế hoạch của báo cáo

source: Select color scheme
vi: Chọn bảng màu

source: Select scheme
vi: Chọn kế hoạch

source: Show less columns
vi: Hiển thị ít cột hơn

source: Show all columns
vi: Hiển thị tất cả cột

source: Fraction digits
vi: Chữ số phần

source: Number of decimal digits to round numbers to
vi: Số lượng chữ số thập phân để làm tròn số

source: Min Width
vi: Chiều rộng tối thiểu

source: Default minimal column width in pixels, actual width may still be larger than this if other columns don't need much space
vi: Chiều rộng cột tối thiểu mặc định tính bằng pixel, chiều rộng thực tế có thể lớn hơn nếu các cột khác không cần nhiều không gian

source: Text align
vi: Căn chỉnh văn bản

source: Horizontal alignment
vi: Căn chỉnh ngang

source: Show cell bars
vi: Hiển thị thanh

source: Whether to align positive and negative values in cell bar chart at 0
vi: Có nên căn chỉnh các giá trị dương và âm trong biểu đồ thanh ô tại 0 không

source: Whether to colorize numeric values by if they are positive or negative
vi: Có nên tô màu các giá trị số dương hoặc số âm không

source: Truncate Cells
vi: Cắt giảm ô

source: Truncate long cells to the "min width" set above
vi: Cắt giảm ô dài thành chiều rộng tối thiểu được thiết lập ở trên

source: Customize chart metrics or columns with currency symbols as prefixes or suffixes. Choose a symbol from dropdown or type your own.
vi: Tùy chỉnh các chỉ số hoặc cột biểu đồ với các ký hiệu tiền tệ là tiền tố hoặc hậu tố. Chọn một ký hiệu từ danh sách thả xuống hoặc nhập ký hiệu của riêng bạn.

source: Small number format
vi: Định dạng số nhỏ

source: D3 number format for numbers between -1.0 and 1.0, useful when you want to have different significant digits for small and large numbers
vi: Định dạng số D3 cho các số trong khoảng từ -1.0 đến 1.0, hữu ích khi bạn muốn có các chữ số quan trọng khác nhau cho các số nhỏ và lớn

source: Display
vi: Hiển thị

source: Number formatting
vi: Định dạng số

source: Edit formatter
vi: Chỉnh sửa định dạng

source: Add new formatter
vi: Thêm định dạng mới

source: Add new color formatter
vi: Thêm định dạng màu mới

source: alert
vi: cảnh báo

source: error
vi: lỗi

source: success dark
vi: thành công tối

source: alert dark
vi: cảnh báo tối

source: error dark
vi: lỗi tối

source: This value should be smaller than the right target value
vi: Giá trị này phải nhỏ hơn giá trị mục tiêu bên phải

source: This value should be greater than the left target value
vi: Giá trị này phải lớn hơn giá trị mục tiêu bên trái

source: Required
vi: Bắt buộc

source: Operator
vi: Toán tử

source: Left value
vi: Giá trị bên trái

source: Right value
vi: Giá trị bên phải

source: Target value
vi: Giá trị mục tiêu

source: Select column
vi: Chọn cột

source: Color:
vi: Màu sắc:

source: Lower threshold must be lower than upper threshold
vi: Ngưỡng dưới phải thấp hơn ngưỡng trên

source: Upper threshold must be greater than lower threshold
vi: Ngưỡng trên phải lớn hơn ngưỡng dưới

source: Isoline
vi: Đường cùng giá trị

source: Threshold
vi: Ngưỡng

source: Defines the value that determines the boundary between different regions or levels in the data
vi: Xác định giá trị xác định ranh giới giữa các khu vực hoặc cấp độ khác nhau trong dữ liệu

source: The width of the Isoline in pixels
vi: Chiều rộng của Đường cùng giá trị tính bằng pixel

source: The color of the isoline
vi: Màu sắc của đường cùng giá trị

source: Isoband
vi: Dải đồng mức

source: Lower Threshold
vi: Ngưỡng dưới

source: The lower limit of the threshold range of the Isoband
vi: Giới hạn dưới của phạm vi ngưỡng của Dải đồng mức

source: Upper Threshold
vi: Ngưỡng trên

source: The upper limit of the threshold range of the Isoband
vi: Giới hạn trên của phạm vi ngưỡng của Dải đồng mức

source: The color of the isoband
vi: Màu sắc của Dải đồng mức

source: Click to add a contour
vi: Nhấn để thêm đường đồng mức

source: Prefix
vi: Tiền tố

source: Suffix
vi: Hậu tố

source: Currency prefix or suffix
vi: Tiền tố hoặc hậu tố tiền tệ

source: Prefix or suffix
vi: Tiền tố hoặc hậu tố

source: Currency symbol
vi: Ký hiệu tiền tệ

source: Currency
vi: Tiền tệ

source: Edit dataset
vi: Chỉnh sửa tập dữ liệu

source: You must be a dataset owner in order to edit. Please reach out to a dataset owner to request modifications or edit access.
vi: Bạn phải là chủ sở hữu tập dữ liệu để chỉnh sửa. Vui lòng liên hệ với chủ sở hữu tập dữ liệu để yêu cầu sửa đổi hoặc truy cập chỉnh sửa.

source: View in SQL Lab
vi: Xem trong SQL Lab

source: Query preview
vi: Xem trước truy vấn

source: Save as dataset
vi: Lưu dưới dạng tập dữ liệu

source: Missing URL parameters
vi: Thiếu tham số URL

source: The URL is missing the dataset_id or slice_id parameters.
vi: URL thiếu các tham số dataset_id hoặc slice_id.

source: The dataset linked to this chart may have been deleted.
vi: Tập dữ liệu liên kết với biểu đồ này có thể đã bị xóa.

source: RANGE TYPE
vi: LOẠI PHẠM VI

source: Actual time range
vi: Phạm vi thời gian thực

source: APPLY
vi: ÁP DỤNG

source: Edit time range
vi: Chỉnh sửa phạm vi thời gian

source: Configure Advanced Time Range
vi: Cấu hình Phạm vi Thời gian Nâng cao

source: START (INCLUSIVE)
vi: BẮT ĐẦU (Bao gồm)

source: Start date included in time range
vi: Ngày bắt đầu được bao gồm trong phạm vi thời gian

source: END (EXCLUSIVE)
vi: KẾT THÚC (Không bao gồm)

source: End date excluded from time range
vi: Ngày kết thúc không được bao gồm trong phạm vi thời gian

source: Configure Time Range: Previous...
vi: Cấu hình Phạm vi Thời gian: Trước...

source: Configure Time Range: Last...
vi: Cấu hình Phạm vi Thời gian: Cuối...

source: Configure custom time range
vi: Cấu hình phạm vi thời gian tùy chỉnh

source: Relative quantity
vi: Số lượng tương đối

source: Relative period
vi: Giai đoạn tương đối

source: Anchor to
vi: Móc vào

source: NOW
vi: BÂY GIỜ

source: Date/Time
vi: Ngày/Giờ

source: Return to specific datetime.
vi: Trở về ngày/giờ cụ thể.

source: Syntax
vi: Cú pháp

source: Example
vi: Ví dụ

source: Moves the given set of dates by a specified interval.
vi: Di chuyển tập hợp ngày đã cho bằng một khoảng thời gian cụ thể.

source: Truncates the specified date to the accuracy specified by the date unit.
vi: Cắt giảm ngày đã chỉ định thành độ chính xác được chỉ định bởi đơn vị ngày.

source: Get the last date by the date unit.
vi: Lấy ngày cuối cùng theo đơn vị ngày.

source: Get the specify date for the holiday
vi: Lấy ngày chỉ định cho ngày lễ

source: Previous
vi: Trước đó

source: Custom
vi: Tùy chỉnh

source: Last day
vi: Ngày cuối cùng

source: Last week
vi: Tuần cuối cùng

source: Last month
vi: Tháng trước

source: Last quarter
vi: Quý trước

source: Last year
vi: Năm trước

source: previous calendar week
vi: tuần lịch trước

source: previous calendar month
vi: tháng lịch trước

source: previous calendar year
vi: năm lịch trước

source: Seconds %s
vi: Giây %s

source: Minutes %s
vi: Phút %s

source: Hours %s
vi: Giờ %s

source: Days %s
vi: Ngày %s

source: Weeks %s
vi: Tuần %s

source: Months %s
vi: Tháng %s

source: Quarters %s
vi: Quý %s

source: Years %s
vi: Năm %s

source: Specific Date/Time
vi: Ngày/Giờ Cụ thể

source: Relative Date/Time
vi: Ngày/Giờ Tương đối

source: Now
vi: Bây giờ

source: Midnight
vi: Nửa đêm

source: Saved expressions
vi: Các biểu thức đã lưu

source: Saved
vi: Đã lưu

source: %s column(s)
vi: %s cột

source: No temporal columns found
vi: Không tìm thấy cột thời gian

source: No saved expressions found
vi: Không tìm thấy biểu thức đã lưu

source: Add calculated temporal columns to dataset in "Edit datasource" modal
vi: Thêm các cột thời gian tính toán vào tập dữ liệu trong hộp thoại "Chỉnh sửa nguồn dữ liệu"

source: Add calculated columns to dataset in "Edit datasource" modal
vi: Thêm cột tính toán vào tập dữ liệu trong hộp thoại "Chỉnh sửa nguồn dữ liệu"

source: to mark a column as a time column
vi: để đánh dấu một cột là cột thời gian

source: to add calculated columns
vi: để thêm các cột tính toán

source: Simple
vi: Đơn giản

source: Mark a column as temporal in "Edit datasource" modal
vi: Đánh dấu một cột là thời gian trong hộp thoại "Chỉnh sửa nguồn dữ liệu"

source: Custom SQL
vi: SQL Tùy chỉnh

source: My column
vi: Cột của tôi

source: This filter might be incompatible with current dataset
vi: Bộ lọc này có thể không tương thích với tập dữ liệu hiện tại

source: This column might be incompatible with current dataset
vi: Cột này có thể không tương thích với tập dữ liệu hiện tại

source: Click to edit label
vi: Nhấp để chỉnh sửa nhãn

source: Drop columns/metrics here or click
vi: Kéo các cột/đánh giá vào đây hoặc nhấp

source: This metric might be incompatible with current dataset
vi: Đánh giá này có thể không tương thích với tập dữ liệu hiện tại

source: This filter was inherited from the dashboard's context. It won't be saved when saving the chart.
vi: Bộ lọc này được kế thừa từ ngữ cảnh của báo cáo. Nó sẽ không được lưu khi lưu biểu đồ.

source: %s option(s)
vi: %s tùy chọn

source: Select subject
vi: Chọn chủ đề

source: No such column found. To filter on a metric, try the Custom SQL tab.
vi: Không tìm thấy cột nào như vậy. Để lọc theo một đánh giá, hãy thử tab SQL Tùy chỉnh.

source: To filter on a metric, use Custom SQL tab.
vi: Để lọc theo một đánh giá, sử dụng tab SQL Tùy chỉnh.

source: %s operator(s)
vi: %s toán tử

source: Select operator
vi: Chọn toán tử

source: Comparator option
vi: Tùy chọn so sánh

source: Type a value here
vi: Nhập một giá trị vào đây

source: Filter value (case sensitive)
vi: Giá trị bộ lọc (phân biệt chữ hoa, chữ thường)

source: Failed to retrieve advanced type
vi: Không thể truy xuất loại nâng cao

source: choose WHERE or HAVING...
vi: chọn WHERE hoặc HAVING...

source: Filters by columns
vi: Lọc theo cột

source: Filters by metrics
vi: Lọc theo đánh giá

source: Fixed
vi: Cố định

source: Based on a metric
vi: Dựa trên một đánh giá

source: My metric
vi: Đánh giá của tôi

source: Add metric
vi: Thêm đánh giá

source: Select aggregate options
vi: Chọn tùy chọn tổng hợp

source: %s aggregates(s)
vi: %s tổng hợp

source: Select saved metrics
vi: Chọn đánh giá đã lưu

source: %s saved metric(s)
vi: %s đánh giá đã lưu

source: Saved metric
vi: Đánh giá đã lưu

source: No saved metrics found
vi: Không tìm thấy đánh giá đã lưu

source: Add metrics to dataset in "Edit datasource" modal
vi: Thêm đánh giá vào tập dữ liệu trong hộp thoại "Chỉnh sửa nguồn dữ liệu"

source: to add metrics
vi: để thêm đánh giá

source: Simple ad-hoc metrics are not enabled for this dataset
vi: Các đánh giá tạm thời đơn giản không được bật cho tập dữ liệu này

source: column
vi: cột

source: aggregate
vi: đánh giá

source: Custom SQL ad-hoc metrics are not enabled for this dataset
vi: Các đánh giá tạm thời SQL tùy chỉnh không được bật cho tập dữ liệu này

source: Error while fetching data: %s
vi: Lỗi khi truy xuất dữ liệu: %s

source: Time series columns
vi: Cột chuỗi thời gian

source: Actual value
vi: Giá trị thực tế

source: Sparkline
vi: Biểu đồ Sparkline

source: Period average
vi: Trung bình kỳ

source: The column header label
vi: Nhãn tiêu đề cột

source: Column header tooltip
vi: Chú giải tiêu đề cột

source: Type of comparison, value difference or percentage
vi: Loại so sánh, chênh lệch giá trị hoặc phần trăm

source: Width
vi: Chiều rộng

source: Width of the sparkline
vi: Chiều rộng của biểu đồ Sparkline

source: Height of the sparkline
vi: Chiều cao của biểu đồ Sparkline

source: Time lag
vi: Độ trễ thời gian

source: Number of periods to compare against. You can use negative numbers to compare from the beginning of the time range.
vi: Số kỳ để so sánh. Bạn có thể sử dụng số âm để so sánh từ đầu của phạm vi thời gian.

source: Time Lag
vi: Độ trễ thời gian

source: Time ratio
vi: Tỷ lệ thời gian

source: Number of periods to ratio against
vi: Số lượng chu kỳ để tính tỷ lệ

source: Time Ratio
vi: Tỷ lệ thời gian

source: Show Y-axis
vi: Hiển thị trục Y

source: Show Y-axis on the sparkline. Will display the manually set min/max if set or min/max values in the data otherwise.
vi: Hiển thị trục Y trên biểu đồ Sparkline. Sẽ hiển thị giá trị tối thiểu/tối đa được thiết lập thủ công nếu được thiết lập hoặc giá trị tối thiểu/tối đa trong dữ liệu nếu không.

source: Y-axis bounds
vi: Giới hạn trục Y

source: Manually set min/max values for the y-axis.
vi: Thiết lập thủ công giá trị tối thiểu/tối đa cho trục Y.

source: Color bounds
vi: Giới hạn màu sắc

source: Number bounds used for color encoding from red to blue. Reverse the numbers for blue to red. To get pure red or blue, you can enter either only min or max.
vi: Giới hạn số được sử dụng cho mã hóa màu từ đỏ đến xanh. Đảo ngược các số cho màu xanh đến đỏ. Để có màu đỏ hoặc xanh tinh khiết, bạn có thể nhập chỉ tối thiểu hoặc tối đa.

source: Optional d3 number format string
vi: Xâu định dạng số tùy chọn d3

source: Number format string
vi: Xâu định dạng số

source: Optional d3 date format string
vi: Xâu định dạng ngày tùy chọn d3

source: Date format string
vi: Xâu định dạng ngày

source: Column Configuration
vi: Cấu hình cột

source: Select Viz Type
vi: Chọn loại trực quan

source: Currently rendered: %s
vi: Đang được hiển thị: %s

source: Featured
vi: Nổi bật

source: Search all charts
vi: Tìm kiếm tất cả biểu đồ

source: No description available.
vi: Không có mô tả nào.

source: Examples
vi: Ví dụ

source: This visualization type is not supported.
vi: Loại trực quan hóa này không được hỗ trợ.

source: View all charts
vi: Xem tất cả biểu đồ

source: Select a visualization type
vi: Chọn một loại trực quan hóa

source: No results found
vi: Không tìm thấy kết quả

source: Superset Chart
vi: Biểu đồ Superset

source: New chart
vi: Biểu đồ mới

source: Edit chart properties
vi: Chỉnh sửa thuộc tính biểu đồ

source: Export to original .CSV
vi: Xuất ra .CSV gốc

source: Export to pivoted .CSV
vi: Xuất ra .CSV quay

source: Export to .JSON
vi: Xuất ra .JSON

source: Embed code
vi: Mã nhúng

source: Run in SQL Lab
vi: Chạy trong SQL Lab

source: Code
vi: Mã

source: Markup type
vi: Loại đánh dấu

source: Pick your favorite markup language
vi: Chọn ngôn ngữ đánh dấu yêu thích của bạn

source: Put your code here
vi: Đặt mã của bạn vào đây

source: URL parameters
vi: Tham số URL

source: Extra parameters for use in jinja templated queries
vi: Các tham số phụ để sử dụng trong các truy vấn mẫu jinja

source: Annotations and layers
vi: Chú thích và lớp

source: Annotation layers
vi: Lớp chú thích

source: My beautiful colors
vi: Những màu sắc đẹp của tôi

source: < (Smaller than)
vi: < (Nhỏ hơn)

source: > (Larger than)
vi: > (Lớn hơn)

source: <= (Smaller or equal)
vi: <= (Nhỏ hơn hoặc bằng)

source: >= (Larger or equal)
vi: >= (Lớn hơn hoặc bằng)

source: == (Is equal)
vi: == (Bằng)

source: != (Is not equal)
vi: != (Không bằng)

source: Not null
vi: Không rỗng

source: 60 days
vi: 60 ngày

source: 90 days
vi: 90 ngày

source: Send as PDF
vi: Gửi dưới dạng PDF

source: Send as PNG
vi: Gửi dưới dạng PNG

source: Send as CSV
vi: Gửi dưới dạng CSV

source: Send as text
vi: Gửi dưới dạng văn bản

source: General information
vi: Thông tin chung

source: Alert condition
vi: Điều kiện cảnh báo

source: Alert contents
vi: Nội dung cảnh báo

source: Report contents
vi: Nội dung báo cáo

source: Notification method
vi: Phương pháp thông báo

source: owners
vi: chủ sở hữu

source: content type
vi: loại nội dung

source: database
vi: cơ sở dữ liệu

source: alert condition
vi: điều kiện cảnh báo

source: working timeout
vi: thời gian chờ làm việc

source: recipients
vi: người nhận

source: Not all required fields are complete. Please provide the following:
vi: Không phải tất cả các trường bắt buộc đã được điền. Vui lòng cung cấp các thông tin sau:

source: Add another notification method
vi: Thêm một phương thức thông báo khác

source: Add delivery method
vi: Thêm phương thức giao hàng

source: report
vi: báo cáo

source: %s updated
vi: %s đã được cập nhật

source: Edit Report
vi: Chỉnh sửa báo cáo

source: Edit Alert
vi: Chỉnh sửa cảnh báo

source: Add Report
vi: Thêm báo cáo

source: Add Alert
vi: Thêm cảnh báo

source: Add
vi: Thêm

source: Set up basic details, such as name and description.
vi: Thiết lập các chi tiết cơ bản, như tên và mô tả.

source: Report name
vi: Tên báo cáo

source: Alert name
vi: Tên cảnh báo

source: Enter report name
vi: Nhập tên báo cáo

source: Enter alert name
vi: Nhập tên cảnh báo

source: Include description to be sent with %s
vi: Bao gồm mô tả được gửi cùng với %s

source: Report is active
vi: Báo cáo đang hoạt động

source: Alert is active
vi: Cảnh báo đang hoạt động

source: Define the database, SQL query, and triggering conditions for alert.
vi: Xác định cơ sở dữ liệu, truy vấn SQL, và điều kiện kích hoạt cho cảnh báo.

source: Select database
vi: Chọn cơ sở dữ liệu

source: SQL Query
vi: Truy vấn SQL

source: The result of this query must be a value capable of numeric interpretation e.g. 1, 1.0, or "1" (compatible with Python's float() function).
vi: Kết quả của truy vấn này phải là một giá trị có thể được diễn giải dưới dạng số, ví dụ: 1, 1.0, hoặc "1" (tương thích với hàm float() của Python).

source: Trigger Alert If...
vi: Kích hoạt Cảnh báo Nếu...

source: Condition
vi: Điều kiện

source: Customize data source, filters, and layout.
vi: Tùy chỉnh nguồn dữ liệu, bộ lọc và bố cục.

source: Content type
vi: Loại nội dung

source: Select content type
vi: Chọn loại nội dung

source: Select chart to use
vi: Chọn biểu đồ để sử dụng

source: Select dashboard to use
vi: Chọn báo cáo để sử dụng

source: Content format
vi: Định dạng nội dung

source: Select format
vi: Chọn định dạng

source: Screenshot width
vi: Chiều rộng ảnh chụp màn hình

source: Input custom width in pixels
vi: Nhập chiều rộng tùy chỉnh theo pixel

source: Ignore cache when generating report
vi: Bỏ qua bộ nhớ cache khi tạo báo cáo

source: Define delivery schedule, timezone, and frequency settings.
vi: Xác định lịch giao hàng, múi giờ, và cài đặt tần suất.

source: Timezone
vi: Múi giờ

source: Log retention
vi: Lưu giữ nhật ký

source: Working timeout
vi: Thời gian chờ làm việc

source: Time in seconds
vi: Thời gian theo giây

source: seconds
vi: giây

source: Grace period
vi: Khoảng thời gian ưu đãi

source: Choose notification method and recipients.
vi: Chọn phương thức thông báo và người nhận.

source: Recurring (every)
vi: Định kỳ (mỗi)

source: CRON Schedule
vi: Lịch CRON

source: Schedule type
vi: Loại lịch

source: CRON expression
vi: Biểu thức CRON

source: Report sent
vi: Báo cáo đã được gửi

source: Alert triggered, notification sent
vi: Cảnh báo được kích hoạt, thông báo đã được gửi

source: Report sending
vi: Đang gửi báo cáo

source: Alert running
vi: Đang chạy cảnh báo

source: Report failed
vi: Báo cáo thất bại

source: Alert failed
vi: Cảnh báo thất bại

source: Nothing triggered
vi: Không có gì được kích hoạt

source: Alert Triggered, In Grace Period
vi: Cảnh báo đã được kích hoạt, Đang trong khoảng thời gian ưu đãi

source: Notification Method
vi: Phương thức thông báo

source: Delivery method
vi: Phương thức giao hàng

source: Select Delivery Method
vi: Chọn Phương thức giao hàng

source: %s recipients
vi: %s người nhận

source: Recipients are separated by "," or ";"
vi: Các người nhận được phân tách bằng "," hoặc ";"

source: Queries
vi: Truy vấn

source: No entities have this tag currently assigned
vi: Hiện không có thực thể nào được gán thẻ này

source: Add tag to entities
vi: Thêm thẻ vào các thực thể

source: annotation_layer
vi: Lớp chú thích

source: Annotation template updated
vi: Mẫu chú thích đã được cập nhật

source: Annotation template created
vi: Mẫu chú thích đã được tạo

source: Edit annotation layer properties
vi: Chỉnh sửa thuộc tính lớp chú thích

source: Annotation layer name
vi: Tên lớp chú thích

source: Description (this can be seen in the list)
vi: Mô tả (có thể được nhìn thấy trong danh sách)

source: annotation
vi: Chú thích

source: The annotation has been updated
vi: Chú thích đã được cập nhật

source: The annotation has been saved
vi: Chú thích đã được lưu

source: Edit annotation
vi: Chỉnh sửa chú thích

source: Add annotation
vi: Thêm chú thích

source: date
vi: Ngày

source: Additional information
vi: Thông tin bổ sung

source: Please confirm
vi: Vui lòng xác nhận

source: Are you sure you want to delete
vi: Bạn có chắc chắn muốn xóa

source: Modified %s
vi: Đã sửa đổi %s

source: css_template
vi: Mẫu CSS

source: Edit CSS template properties
vi: Chỉnh sửa thuộc tính mẫu CSS

source: Add CSS template
vi: Thêm mẫu CSS

source: Adjust how this database will interact with SQL Lab.
vi: Điều chỉnh cách cơ sở dữ liệu này tương tác với SQL Lab.

source: Expose database in SQL Lab
vi: Hiển thị cơ sở dữ liệu trong SQL Lab

source: Allow this database to be queried in SQL Lab
vi: Cho phép truy vấn cơ sở dữ liệu này trong SQL Lab

source: Allow creation of new tables based on queries
vi: Cho phép tạo bảng mới dựa trên các truy vấn

source: Allow creation of new views based on queries
vi: Cho phép tạo chế độ xem mới dựa trên các truy vấn

source: Create or select schema...
vi: Tạo hoặc chọn schema...
