Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: code ISO 3166-1 alpha-2 (cca2)
vi: mã ISO 3166-1 alpha-2 (cca2)

source: code ISO 3166-1 alpha-3 (cca3)
vi: mã ISO 3166-1 alpha-3 (cca3)

source: The country code standard that Superset should expect to find in the [country] column
vi: Tiêu chuẩn mã quốc gia mà Superset nên mong đợi tìm thấy trong cột [quốc gia]

source: Show Bubbles
vi: Hiển thị bong bóng

source: Whether to display bubbles on top of countries
vi: Có hiển thị bong bóng trên các quốc gia hay không

source: Max Bubble Size
vi: Kích thước bong bóng tối đa

source: Color by
vi: Màu theo

source: Choose whether a country should be shaded by the metric, or assigned a color based on a categorical color palette
vi: Chọn xem một quốc gia nên được tô bóng theo chỉ số, hay được chỉ định màu dựa trên bảng màu phân loại

source: Country Column
vi: Cột quốc gia

source: 3 letter code of the country
vi: Mã 3 chữ cái của quốc gia

source: Metric that defines the size of the bubble
vi: Chỉ số xác định kích thước của bong bóng

source: Bubble Color
vi: Màu bong bóng

source: Country Color Scheme
vi: Bảng màu quốc gia

source: A map of the world, that can indicate values in different countries.
vi: Bản đồ thế giới, có thể chỉ ra các giá trị ở các quốc gia khác nhau.

source: Multi-Dimensions
vi: Đa chiều

source: Multi-Variables
vi: Đa biến

source: Popular
vi: Phổ biến

source: deck.gl charts
vi: Biểu đồ deck.gl

source: Pick a set of deck.gl charts to layer on top of one another
vi: Chọn một tập hợp các biểu đồ deck.gl để xếp chồng lên nhau

source: Select charts
vi: Chọn biểu đồ

source: Error while fetching charts
vi: Lỗi khi lấy biểu đồ

source: Compose multiple layers together to form complex visuals.
vi: Kết hợp nhiều lớp lại với nhau để tạo thành hình ảnh phức tạp.

source: deck.gl Multiple Layers
vi: Nhiều lớp deck.gl

source: Start (Longitude, Latitude):
vi: Bắt đầu (Kinh độ, Vĩ độ):

source: End (Longitude, Latitude):
vi: Kết thúc (Kinh độ, Vĩ độ):

source: Start Longitude & Latitude
vi: Kinh độ & Vĩ độ bắt đầu

source: Point to your spatial columns
vi: Chỉ đến các cột không gian của bạn

source: End Longitude & Latitude
vi: Kinh độ & Vĩ độ kết thúc

source: Arc
vi: Cung

source: Target Color
vi: Màu đích

source: Color of the target location
vi: Màu của vị trí đích

source: Categorical Color
vi: Màu phân loại

source: Pick a dimension from which categorical colors are defined
vi: Chọn một chiều từ đó màu phân loại được xác định

source: Stroke Width
vi: Độ rộng nét

source: Advanced
vi: Nâng cao

source: Plot the distance (like flight paths) between origin and destination.
vi: Vẽ khoảng cách (như đường bay) giữa điểm xuất phát và điểm đến.

source: deck.gl Arc
vi: Cung deck.gl

source: Centroid (Longitude and Latitude):
vi: Trọng tâm (Kinh độ và Vĩ độ):

source: Threshold:
vi: Ngưỡng:

source: The size of each cell in meters
vi: Kích thước của mỗi ô tính bằng mét

source: Aggregation
vi: Tổng hợp

source: The function to use when aggregating points into groups
vi: Chức năng để sử dụng khi tổng hợp các điểm thành các nhóm

source: Contours
vi: Đường viền

source: Define contour layers. Isolines represent a collection of line segments that serparate the area above and below a given threshold. Isobands represent a collection of polygons that fill the are containing values in a given threshold range.
vi: Định nghĩa các lớp đường viền. Đường đẳng trị đại diện cho một tập hợp các đoạn thẳng phân tách khu vực trên và dưới một ngưỡng cho trước. Dải đẳng trị đại diện cho một tập hợp các đa giác lấp đầy khu vực chứa các giá trị trong một khoảng ngưỡng cho trước.

source: Weight
vi: Trọng số

source: Metric used as a weight for the grid's coloring
vi: Chỉ số được sử dụng làm trọng số cho màu sắc của lưới

source: Uses Gaussian Kernel Density Estimation to visualize spatial distribution of data
vi: Sử dụng ước lượng mật độ hạt nhân Gaussian để hình dung sự phân bố không gian của dữ liệu

source: deck.gl Contour
vi: Đường viền deck.gl

source: Spatial
vi: Không gian

source: GeoJson Settings
vi: Cài đặt GeoJson

source: Line width unit
vi: Đơn vị độ rộng đường

source: meters
vi: mét

source: pixels
vi: pixel

source: Point Radius Scale
vi: Tỷ lệ bán kính điểm

source: The GeoJsonLayer takes in GeoJSON formatted data and renders it as interactive polygons, lines and points (circles, icons and/or texts).
vi: GeoJsonLayer nhận dữ liệu định dạng GeoJSON và hiển thị nó dưới dạng các đa giác, đường và điểm tương tác (hình tròn, biểu tượng và/hoặc văn bản).

source: Longitude and Latitude
vi: Kinh độ và Vĩ độ

source: Height
vi: Chiều cao

source: Metric used to control height
vi: Chỉ số được sử dụng để kiểm soát chiều cao

source: Visualize geospatial data like 3D buildings, landscapes, or objects in grid view.
vi: Hình dung dữ liệu không gian địa lý như các tòa nhà 3D, cảnh quan, hoặc các đối tượng dưới dạng lưới.

source: deck.gl Grid
vi: Lưới deck.gl

source: Intensity is the value multiplied by the weight to obtain the final weight
vi: Cường độ là giá trị nhân với trọng số để thu được trọng số cuối cùng

source: Intensity Radius
vi: Bán kính cường độ

source: Intensity Radius is the radius at which the weight is distributed
vi: Bán kính cường độ là bán kính tại đó trọng số được phân bố

source: deck.gl Heatmap
vi: Bản đồ nhiệt deck.gl

source: Dynamic Aggregation Function
vi: Chức năng tổng hợp động

source: variance
vi: phương sai

source: deviation
vi: độ lệch

source: Overlays a hexagonal grid on a map, and aggregates data within the boundary of each cell.
vi: Lớp phủ một lưới hình lục giác trên bản đồ, và tổng hợp dữ liệu trong phạm vi của mỗi ô.

source: deck.gl 3D Hexagon
vi: Hình lục giác 3D deck.gl

source: Polyline
vi: Đường đa tuyến

source: Visualizes connected points, which form a path, on a map.
vi: Hình dung các điểm kết nối, tạo thành một đường dẫn, trên bản đồ.

source: deck.gl Path
vi: Đường dẫn deck.gl

source: name
vi: tên

source: Polygon Column
vi: Cột đa giác

source: Polygon Encoding
vi: Mã hóa đa giác

source: Elevation
vi: Độ cao

source: Polygon Settings
vi: Cài đặt đa giác

source: Opacity, expects values between 0 and 100
vi: Độ mờ, mong đợi giá trị từ 0 đến 100

source: Number of buckets to group data
vi: Số lượng thùng để nhóm dữ liệu

source: How many buckets should the data be grouped in.
vi: Số lượng thùng dữ liệu nên được nhóm vào.

source: Bucket break points
vi: Điểm ngắt thùng

source: List of n+1 values for bucketing metric into n buckets.
vi: Danh sách các giá trị n+1 để phân loại chỉ số vào n thùng.

source: Emit Filter Events
vi: Phát hành sự kiện lọc

source: Whether to apply filter when items are clicked
vi: Có áp dụng bộ lọc khi các mục được nhấp hay không

source: Multiple filtering
vi: Lọc nhiều lần

source: Allow sending multiple polygons as a filter event
vi: Cho phép gửi nhiều đa giác dưới dạng sự kiện lọc

source: Visualizes geographic areas from your data as polygons on a Mapbox rendered map. Polygons can be colored using a metric.
vi: Hình dung các khu vực địa lý từ dữ liệu của bạn dưới dạng các đa giác trên bản đồ được hiển thị bởi Mapbox. Các đa giác có thể được tô màu bằng cách sử dụng một chỉ số.

source: deck.gl Polygon
vi: Đa giác deck.gl

source: Category
vi: Danh mục

source: Point Size
vi: Kích thước điểm

source: Point Unit
vi: Đơn vị điểm

source: Square meters
vi: Mét vuông

source: Square kilometers
vi: Kilômét vuông

source: Square miles
vi: Dặm vuông

source: Radius in meters
vi: Bán kính tính bằng mét

source: Radius in kilometers
vi: Bán kính tính bằng kilômét

source: Radius in miles
vi: Bán kính tính bằng dặm

source: Minimum Radius
vi: Bán kính tối thiểu

source: Minimum radius size of the circle, in pixels. As the zoom level changes, this insures that the circle respects this minimum radius.
vi: Kích thước bán kính tối thiểu của hình tròn, tính bằng pixel. Khi mức độ thu phóng thay đổi, điều này đảm bảo rằng hình tròn tôn trọng bán kính tối thiểu này.

source: Maximum Radius
vi: Bán kính tối đa

source: Maximum radius size of the circle, in pixels. As the zoom level changes, this insures that the circle respects this maximum radius.
vi: Kích thước bán kính tối đa của hình tròn, tính bằng pixel. Khi mức độ thu phóng thay đổi, điều này đảm bảo rằng hình tròn tôn trọng bán kính tối đa này.

source: Point Color
vi: Màu điểm

source: A map that takes rendering circles with a variable radius at latitude/longitude coordinates
vi: Một bản đồ hiển thị các vòng tròn với bán kính thay đổi tại tọa độ kinh độ/vĩ độ

source: deck.gl Scatterplot
vi: Biểu đồ phân tán deck.gl

source: Grid
vi: Lưới

source: Aggregates data within the boundary of grid cells and maps the aggregated values to a dynamic color scale
vi: Tổng hợp dữ liệu trong phạm vi của các ô lưới và ánh xạ các giá trị tổng hợp đến một thang màu động

source: deck.gl Screen Grid
vi: Lưới màn hình deck.gl

source: For more information about objects are in context in the scope of this function, refer to the
vi: Để biết thêm thông tin về các đối tượng trong ngữ cảnh trong phạm vi của chức năng này, tham khảo

source: This functionality is disabled in your environment for security reasons.
vi: Chức năng này bị vô hiệu hóa trong môi trường của bạn vì lý do bảo mật.

source: Ignore null locations
vi: Bỏ qua các vị trí null

source: Whether to ignore locations that are null
vi: Có bỏ qua các vị trí null hay không

source: Auto Zoom
vi: Tự động thu phóng

source: When checked, the map will zoom to your data after each query
vi: Khi được chọn, bản đồ sẽ phóng to dữ liệu của bạn sau mỗi truy vấn

source: Select a dimension
vi: Chọn một chiều

source: Extra data for JS
vi: Dữ liệu bổ sung cho JS

source: List of extra columns made available in JavaScript functions
vi: Danh sách các cột bổ sung có sẵn trong các hàm JavaScript

source: JavaScript data interceptor
vi: Chặn dữ liệu JavaScript

source: Define a javascript function that receives the data array used in the visualization and is expected to return a modified version of that array. This can be used to alter properties of the data, filter, or enrich the array.
vi: Định nghĩa một hàm JavaScript nhận mảng dữ liệu được sử dụng trong trực quan hóa và dự kiến trả về một phiên bản đã sửa đổi của mảng đó. Điều này có thể được sử dụng để thay đổi thuộc tính của dữ liệu, lọc hoặc làm giàu mảng.

source: JavaScript tooltip generator
vi: Trình tạo chú giải công cụ JavaScript

source: Define a function that receives the input and outputs the content for a tooltip
vi: Định nghĩa một hàm nhận đầu vào và xuất nội dung cho chú giải công cụ

source: JavaScript onClick href
vi: Liên kết onClick JavaScript

source: Define a function that returns a URL to navigate to when user clicks
vi: Định nghĩa một hàm trả về URL để điều hướng khi người dùng nhấp

source: Legend Format
vi: Định dạng chú giải

source: Choose the format for legend values
vi: Chọn định dạng cho các giá trị chú giải

source: Legend Position
vi: Vị trí chú giải

source: Choose the position of the legend
vi: Chọn vị trí của chú giải

source: Top left
vi: Trên cùng bên trái

source: Top right
vi: Trên cùng bên phải

source: Bottom left
vi: Dưới cùng bên trái

source: Bottom right
vi: Dưới cùng bên phải

source: Lines column
vi: Cột đường

source: The database columns that contains lines information
vi: Các cột cơ sở dữ liệu chứa thông tin về các đường

source: Line width
vi: Độ rộng đường

source: The width of the lines
vi: Độ rộng của các đường

source: Fill Color
vi: Màu nền

source: Set the opacity to 0 if you do not want to override the color specified in the GeoJSON
vi: Đặt độ mờ thành 0 nếu bạn không muốn ghi đè màu được chỉ định trong GeoJSON

source: Stroke Color
vi: Màu viền

source: Filled
vi: Đã tô màu

source: Whether to fill the objects
vi: Có tô màu cho các đối tượng hay không

source: Stroked
vi: Có viền

source: Whether to display the stroke
vi: Có hiển thị viền hay không

source: Extruded
vi: Đùn

source: Whether to make the grid 3D
vi: Có làm lưới 3D hay không

source: Grid Size
vi: Kích thước lưới

source: Defines the grid size in pixels
vi: Định nghĩa kích thước lưới tính bằng pixel

source: Parameters related to the view and perspective on the map
vi: Các thông số liên quan đến chế độ xem và góc nhìn trên bản đồ

source: Longitude & Latitude
vi: Kinh độ & Vĩ độ

source: Fixed point radius
vi: Bán kính điểm cố định

source: Multiplier
vi: Hệ số nhân

source: Factor to multiply the metric by
vi: Hệ số nhân của chỉ số

source: Lines encoding
vi: Mã hóa đường

source: The encoding format of the lines
vi: Định dạng mã hóa của các đường

source: geohash (square)
vi: geohash (vuông)

source: Reverse Lat & Long
vi: Đảo ngược Vĩ độ & Kinh độ

source: GeoJson Column
vi: Cột GeoJson

source: Select the geojson column
vi: Chọn cột Geojson

source: Right Axis Format
vi: Định dạng trục phải

source: Show Markers
vi: Hiển thị đánh dấu

source: Show data points as circle markers on the lines
vi: Hiển thị các điểm dữ liệu dưới dạng các vòng tròn đánh dấu trên các đường

source: Y bounds
vi: Giới hạn Y

source: Whether to display the min and max values of the Y-axis
vi: Có hiển thị giá trị nhỏ nhất và lớn nhất của trục Y hay không

source: Y 2 bounds
vi: Giới hạn Y 2

source: Line Style
vi: Kiểu đường

source: linear
vi: tuyến tính

source: basis
vi: cơ sở

source: cardinal
vi: chính

source: monotone
vi: đơn điệu

source: step-before
vi: bước-trước

source: step-after
vi: bước-sau

source: Line interpolation as defined by d3.js
vi: Nội suy đường như được định nghĩa bởi d3.js

source: Show Range Filter
vi: Hiển thị bộ lọc phạm vi

source: Whether to display the time range interactive selector
vi: Có hiển thị bộ chọn phạm vi thời gian tương tác hay không

source: Extra Controls
vi: Điều khiển bổ sung

source: Whether to show extra controls or not. Extra controls include things like making mulitBar charts stacked or side by side.
vi: Có hiển thị các điều khiển bổ sung hay không. Các điều khiển bổ sung bao gồm các tính năng như tạo biểu đồ nhiều thanh chồng lên nhau hoặc cạnh nhau.

source: X Tick Layout
vi: Bố trí dấu tích X

source: flat
vi: phẳng

source: staggered
vi: so le

source: The way the ticks are laid out on the X-axis
vi: Cách các dấu tích được bố trí trên trục X

source: X Axis Format
vi: Định dạng trục X

source: Y Log Scale
vi: Thang log Y

source: Use a log scale for the Y-axis
vi: Sử dụng thang log cho trục Y

source: Y Axis Bounds
vi: Giới hạn trục Y

source: Bounds for the Y-axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
vi: Giới hạn cho trục Y. Khi để trống, các giới hạn được định nghĩa động dựa trên giá trị nhỏ nhất/lớn nhất của dữ liệu. Lưu ý rằng tính năng này chỉ mở rộng phạm vi của trục. Nó sẽ không thu hẹp phạm vi dữ liệu.

source: Y Axis 2 Bounds
vi: Giới hạn trục Y 2

source: X bounds
vi: Giới hạn X

source: Whether to display the min and max values of the X-axis
vi: Có hiển thị giá trị nhỏ nhất và lớn nhất của trục X hay không

source: Bar Values
vi: Giá trị thanh

source: Show the value on top of the bar
vi: Hiển thị giá trị trên đầu thanh

source: Stacked Bars
vi: Thanh xếp chồng

source: Reduce X ticks
vi: Giảm dấu tích X

source: Reduces the number of X-axis ticks to be rendered. If true, the x-axis will not overflow and labels may be missing. If false, a minimum width will be applied to columns and the width may overflow into an horizontal scroll.
vi: Giảm số lượng dấu tích trục X sẽ được hiển thị. Nếu đúng, trục X sẽ không tràn và nhãn có thể bị thiếu. Nếu sai, một chiều rộng tối thiểu sẽ được áp dụng cho các cột và chiều rộng có thể tràn vào cuộn ngang.

source: You cannot use 45° tick layout along with the time range filter
vi: Bạn không thể sử dụng bố trí dấu tích 45° cùng với bộ lọc phạm vi thời gian

source: Stacked Style
vi: Kiểu xếp chồng

source: stack
vi: chồng lên nhau

source: stream
vi: dòng chảy

source: expand
vi: mở rộng

source: Evolution
vi: Tiến hóa

source: A time series chart that visualizes how a related metric from multiple groups vary over time. Each group is visualized using a different color.
vi: Một biểu đồ chuỗi thời gian hiển thị cách một chỉ số liên quan từ nhiều nhóm thay đổi theo thời gian. Moi nhóm được hiển thị bằng một màu khác nhau.

source: Stretched style
vi: Kiểu kéo dài

source: Stacked style
vi: Kiểu xếp chồng

source: Video game consoles
vi: Máy chơi game

source: Vehicle Types
vi: Loại xe

source: Time-series Area Chart (legacy)
vi: Biểu đồ khu vực chuỗi thời gian (cũ)

source: Continuous
vi: Liên tục

source: Line
vi: Đường

source: Series Limit Sort By
vi: Sắp xếp Giới hạn Dãy theo

source: Metric used to order the limit if a series limit is present. If undefined reverts to the first metric (where appropriate).
vi: Chỉ số được sử dụng để sắp xếp giới hạn nếu có giới hạn dãy. Nếu không được định nghĩa, nó sẽ quay lại chỉ số đầu tiên (khi thích hợp).

source: Series Limit Sort Descending
vi: Sắp xếp Giới hạn Dãy Giảm dần

source: Whether to sort descending or ascending if a series limit is present
vi: Có sắp xếp giảm dần hoặc tăng dần nếu có giới hạn dãy hay không

source: Visualize how a metric changes over time using bars. Add a group by column to visualize group level metrics and how they change over time.
vi: Trực quan hóa cách một chỉ số thay đổi theo thời gian bằng cách sử dụng các thanh. Thêm cột nhóm để trực quan hóa các chỉ số cấp nhóm và cách chúng thay đổi theo thời gian.

source: Time-series Bar Chart (legacy)
vi: Biểu đồ thanh chuỗi thời gian (cũ)

source: Bar
vi: Thanh

source: Box Plot
vi: Biểu đồ hộp

source: X Log Scale
vi: Thang log X

source: Use a log scale for the X-axis
vi: Sử dụng thang log cho trục X

source: Visualizes a metric across three dimensions of data in a single chart (X axis, Y axis, and bubble size). Bubbles from the same group can be showcased using bubble color.
vi: Trực quan hóa một chỉ số qua ba chiều dữ liệu trong một biểu đồ duy nhất (trục X, trục Y và kích thước bong bóng). Các bong bóng từ cùng một nhóm có thể được hiển thị bằng màu bong bóng.

source: Bubble Chart (legacy)
vi: Biểu đồ bong bóng (cũ)

source: Ranges
vi: Phạm vi

source: Ranges to highlight with shading
vi: Các phạm vi để làm nổi bật bằng cách tô bóng

source: Range labels
vi: Nhãn phạm vi

source: Labels for the ranges
vi: Nhãn cho các phạm vi

source: Markers
vi: Đánh dấu

source: List of values to mark with triangles
vi: Danh sách các giá trị để đánh dấu bằng hình tam giác

source: Marker labels
vi: Nhãn đánh dấu

source: Labels for the markers
vi: Nhãn cho các đánh dấu

source: Marker lines
vi: Đường đánh dấu

source: List of values to mark with lines
vi: Danh sách các giá trị để đánh dấu bằng các đường

source: Marker line labels
vi: Nhãn đường đánh dấu

source: Labels for the marker lines
vi: Nhãn cho các đường đánh dấu

source: Showcases the progress of a single metric against a given target. The higher the fill, the closer the metric is to the target.
vi: Hiển thị tiến trình của một chỉ số đơn lẻ so với một mục tiêu cụ thể. Độ lấp đầy càng cao, chỉ số càng gần mục tiêu.

source: Visualizes many different time-series objects in a single chart. This chart is being deprecated and we recommend using the Time-series Chart instead.
vi: Trực quan hóa nhiều đối tượng chuỗi thời gian khác nhau trong một biểu đồ duy nhất. Biểu đồ này đang bị loại bỏ và chúng tôi khuyên bạn nên sử dụng Biểu đồ chuỗi thời gian thay thế.

source: Time-series Percent Change
vi: Thay đổi phần trăm chuỗi thời gian

source: Sort Bars
vi: Sắp xếp Thanh

source: Sort bars by x labels.
vi: Sắp xếp các thanh theo nhãn x.

source: Breakdowns
vi: Phân tích

source: Defines how each series is broken down
vi: Định nghĩa cách mỗi dãy được phân tích

source: Compares metrics from different categories using bars. Bar lengths are used to indicate the magnitude of each value and color is used to differentiate groups.
vi: So sánh các chỉ số từ các danh mục khác nhau bằng cách sử dụng các thanh. Chiều dài thanh được sử dụng để chỉ ra độ lớn của mỗi giá trị và màu sắc được sử dụng để phân biệt các nhóm.

source: Bar Chart (legacy)
vi: Biểu đồ thanh (cũ)

source: Additive
vi: Phép cộng

source: Propagate
vi: Lan truyền

source: Send range filter events to other charts
vi: Gửi các sự kiện lọc phạm vi đến các biểu đồ khác

source: Classic chart that visualizes how metrics change over time.
vi: Biểu đồ cổ điển hiển thị cách các chỉ số thay đổi theo thời gian.

source: Battery level over time
vi: Mức pin theo thời gian

source: Time-series Line Chart (legacy)
vi: Biểu đồ đường chuỗi thời gian (cũ)

source: Label Type
vi: Loại nhãn

source: Category Name
vi: Tên danh mục

source: Value
vi: Giá trị

source: Percentage
vi: Phần trăm

source: Category and Value
vi: Danh mục và Giá trị

source: Category and Percentage
vi: Danh mục và Phần trăm

source: Category, Value and Percentage
vi: Danh mục, Giá trị và Phần trăm

source: What should be shown on the label?
vi: Nên hiển thị gì trên nhãn?

source: Do you want a donut or a pie?
vi: Bạn muốn một donut hay một chiếc bánh?

source: Show Labels
vi: Hiển thị Nhãn

source: Whether to display the labels. Note that the label only displays when the 5% threshold.
vi: Có hiển thị nhãn hay không. Lưu ý rằng nhãn chỉ hiển thị khi ngưỡng 5%.

source: Put labels outside
vi: Đặt nhãn bên ngoài

source: Put the labels outside the pie?
vi: Đặt nhãn bên ngoài bánh?

source: Pie Chart (legacy)
vi: Biểu đồ bánh (cũ)

source: Frequency
vi: Tần suất

source: Year (freq=AS)
vi: Năm (freq=AS)

source: 52 weeks starting Monday (freq=52W-MON)
vi: 52 tuần bắt đầu từ thứ Hai (freq=52W-MON)

source: 1 week starting Sunday (freq=W-SUN)
vi: 1 tuần bắt đầu từ Chủ Nhật (freq=W-SUN)

source: 1 week starting Monday (freq=W-MON)
vi: 1 tuần bắt đầu từ thứ Hai (freq=W-MON)

source: Day (freq=D)
vi: Ngày (freq=D)

source: 4 weeks (freq=4W-MON)
vi: 4 tuần (freq=4W-MON)

source: The periodicity over which to pivot time. Users can provide "Pandas" offset alias. Click on the info bubble for more details on accepted "freq" expressions.
vi: Tính chu kỳ mà thời gian xoay quanh. Người dùng có thể cung cấp biệt danh bù của "Pandas". Nhấp vào bong bóng thông tin để biết thêm chi tiết về các biểu thức "freq" được chấp nhận.

source: Time-series Period Pivot
vi: Xoay chu kỳ chuỗi thời gian

source: Formula
vi: Công thức

source: Event
vi: Sự kiện

source: Interval
vi: Khoảng thời gian

source: Stack
vi: Xếp chồng

source: Stream
vi: Luồng

source: Expand
vi: Mở rộng

source: Show legend
vi: Hiển thị chú giải

source: Whether to display a legend for the chart
vi: Có hiển thị chú giải cho biểu đồ hay không

source: Margin
vi: Lề

source: Additional padding for legend.
vi: Thêm khoảng đệm cho chú giải.

source: Scroll
vi: Cuộn

source: Plain
vi: Đơn giản

source: Legend type
vi: Loại chú giải

source: Orientation
vi: Hướng

source: Bottom
vi: Dưới

source: Right
vi: Phải

source: Legend Orientation
vi: Hướng chú giải

source: Show Value
vi: Hiển thị giá trị

source: Show series values on the chart
vi: Hiển thị giá trị dãy trên biểu đồ

source: Stack series on top of each other
vi: Xếp chồng các dãy lên nhau

source: Only Total
vi: Chỉ tổng cộng

source: Only show the total value on the stacked chart, and not show on the selected category
vi: Chỉ hiển thị giá trị tổng cộng trên biểu đồ xếp chồng và không hiển thị trên danh mục đã chọn

source: Percentage threshold
vi: Ngưỡng phần trăm

source: Minimum threshold in percentage points for showing labels.
vi: Ngưỡng tối thiểu tính bằng phần trăm để hiển thị nhãn.

source: Rich tooltip
vi: Tooltip phong phú

source: Shows a list of all series available at that point in time
vi: Hiển thị danh sách tất cả các dãy có sẵn tại thời điểm đó

source: Tooltip time format
vi: Định dạng thời gian Tooltip

source: Tooltip sort by metric
vi: Sắp xếp Tooltip theo chỉ số
