Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Select the charts to which you want to apply cross-filters when interacting with this chart. You can select "All charts" to apply filters to all charts that use the same dataset or contain the same column name in the dashboard.
vi: Chọn các biểu đồ mà bạn muốn áp dụng bộ lọc chéo khi tương tác với biểu đồ này. Bạn có thể chọn "Tất cả biểu đồ" để áp dụng bộ lọc cho tất cả biểu đồ sử dụng cùng tập dữ liệu hoặc chứa cùng tên cột trong báo cáo.

source: Select the charts to which you want to apply cross-filters in this dashboard. Deselecting a chart will exclude it from being filtered when applying cross-filters from any chart on the dashboard. You can select "All charts" to apply cross-filters to all charts that use the same dataset or contain the same column name in the dashboard.
vi: Chọn các biểu đồ mà bạn muốn áp dụng bộ lọc chéo trong báo cáo này. Bỏ chọn một biểu đồ sẽ loại nó khỏi việc lọc khi áp dụng bộ lọc chéo từ bất kỳ biểu đồ nào trên báo cáo. Bạn có thể chọn "Tất cả biểu đồ" để áp dụng bộ lọc chéo cho tất cả biểu đồ sử dụng cùng tập dữ liệu hoặc chứa cùng tên cột trong báo cáo.

source: All charts
vi: Tất cả biểu đồ

source: Enable cross-filtering
vi: Kích hoạt bộ lọc chéo

source: Orientation of filter bar
vi: Hướng của thanh lọc

source: Vertical (Left)
vi: Dọc (Bên trái)

source: Horizontal (Top)
vi: Ngang (Trên)

source: More filters
vi: Thêm bộ lọc

source: No applied filters
vi: Không có bộ lọc nào được áp dụng

source: Applied filters: %s
vi: Bộ lọc đã áp dụng: %s

source: Cannot load filter
vi: Không thể tải bộ lọc

source: Filters out of scope (%d)
vi: Bộ lọc nằm ngoài phạm vi (%d)

source: Dependent on
vi: Phụ thuộc vào

source: Filter only displays values relevant to selections made in other filters.
vi: Bộ lọc chỉ hiển thị các giá trị liên quan đến các lựa chọn được thực hiện trong các bộ lọc khác.

source: Scope
vi: Phạm vi

source: Filter type
vi: Loại bộ lọc

source: Title is required
vi: Yêu cầu tiêu đề

source: (Removed)
vi: (Đã xóa)

source: Undo?
vi: Hoàn tác?

source: Add filters and dividers
vi: Thêm bộ lọc và phân chia

source: [untitled]
vi: [chưa có tiêu đề]

source: Cyclic dependency detected
vi: Phát hiện phụ thuộc vòng lặp

source: Add and edit filters
vi: Thêm và chỉnh sửa bộ lọc

source: Column select
vi: Chọn cột

source: Select a column
vi: Chọn một cột

source: No compatible columns found
vi: Không tìm thấy cột tương thích

source: No compatible datasets found
vi: Không tìm thấy tập dữ liệu tương thích

source: Value is required
vi: Yêu cầu giá trị

source: (deleted or invalid type)
vi: (đã xóa hoặc loại không hợp lệ)

source: Limit type
vi: Loại giới hạn

source: No available filters.
vi: Không có bộ lọc nào sẵn có.

source: Add filter
vi: Thêm bộ lọc

source: Values are dependent on other filters
vi: Các giá trị phụ thuộc vào các bộ lọc khác

source: Values selected in other filters will affect the filter options to only show relevant values
vi: Các giá trị được chọn trong các bộ lọc khác sẽ ảnh hưởng đến các tùy chọn bộ lọc để chỉ hiển thị các giá trị liên quan

source: Values dependent on
vi: Các giá trị phụ thuộc vào

source: Scoping
vi: Phạm vi

source: Filter Configuration
vi: Cấu hình bộ lọc

source: Filter Settings
vi: Cài đặt bộ lọc

source: Select filter
vi: Chọn bộ lọc

source: Range filter
vi: Bộ lọc phạm vi

source: Numerical range
vi: Phạm vi số

source: Time filter
vi: Bộ lọc thời gian

source: Time range
vi: Phạm vi thời gian

source: Time column
vi: Cột thời gian

source: Time grain
vi: Khoảng thời gian

source: Group By
vi: Nhóm theo

source: Group by
vi: Nhóm theo

source: Pre-filter is required
vi: Yêu cầu bộ lọc trước

source: Time column to apply dependent temporal filter to
vi: Cột thời gian áp dụng bộ lọc thời gian phụ thuộc vào

source: Time column to apply time range to
vi: Cột thời gian để áp dụng phạm vi thời gian vào

source: Filter name
vi: Tên bộ lọc

source: Name is required
vi: Yêu cầu tên

source: Filter Type
vi: Loại bộ lọc

source: Datasets do not contain a temporal column
vi: Tập dữ liệu không chứa một cột thời gian

source: Dashboard time range filters apply to temporal columns defined in the filter section of each chart. Add temporal columns to the chart filters to have this dashboard filter impact those charts.
vi: Các bộ lọc phạm vi thời gian của báo cáo được áp dụng cho các cột thời gian được xác định trong phần bộ lọc của mỗi biểu đồ. Thêm các cột thời gian vào các bộ lọc của biểu đồ để bộ lọc báo cáo này ảnh hưởng đến các biểu đồ đó.

source: Dataset is required
vi: Yêu cầu tập dữ liệu

source: Pre-filter available values
vi: Giá trị sẵn có của bộ lọc trước

source: Add filter clauses to control the filter's source query, though only in the context of the autocomplete i.e., these conditions do not impact how the filter is applied to the dashboard. This is useful when you want to improve the query's performance by only scanning a subset of the underlying data or limit the available values displayed in the filter.
vi: Thêm các điều kiện bộ lọc để kiểm soát truy vấn nguồn của bộ lọc, tuy nhiên chỉ trong ngữ cảnh của tính tự động hoàn thiện tức là, các điều kiện này không ảnh hưởng đến cách mà bộ lọc được áp dụng vào báo cáo. Điều này hữu ích khi bạn muốn cải thiện hiệu suất của truy vấn bằng cách chỉ quét một phần nhỏ của dữ liệu cơ sở hoặc giới hạn các giá trị có sẵn được hiển thị trong bộ lọc.

source: Pre-filter
vi: Bộ lọc trước

source: No filter
vi: Không có bộ lọc

source: Sort filter values
vi: Sắp xếp các giá trị bộ lọc

source: Sort type
vi: Loại sắp xếp

source: Sort ascending
vi: Sắp xếp tăng dần

source: Sort Metric
vi: Sắp xếp theo đại lượng

source: If a metric is specified, sorting will be done based on the metric value
vi: Nếu chỉ định một đại lượng, việc sắp xếp sẽ được thực hiện dựa trên giá trị của đại lượng đó

source: Sort metric
vi: Sắp xếp theo đại lượng

source: Single Value
vi: Giá trị Đơn

source: Single value type
vi: Loại giá trị đơn

source: Exact
vi: Chính xác

source: Filter has default value
vi: Bộ lọc có giá trị mặc định

source: Default Value
vi: Giá trị Mặc định

source: Default value is required
vi: Giá trị mặc định được yêu cầu

source: Refresh the default values
vi: Làm mới các giá trị mặc định

source: Fill all required fields to enable "Default Value"
vi: Điền tất cả các trường bắt buộc để kích hoạt "Giá trị Mặc định"

source: You have removed this filter.
vi: Bạn đã xóa bộ lọc này.

source: Restore Filter
vi: Khôi phục Bộ lọc

source: Column is required
vi: Cột được yêu cầu

source: Populate "Default value" to enable this control
vi: Điền "Giá trị mặc định" để kích hoạt điều khiển này

source: Default value set automatically when "Select first filter value by default" is checked
vi: Giá trị mặc định được đặt tự động khi kiểm tra "Chọn giá trị bộ lọc đầu tiên theo mặc định"

source: Default value must be set when "Filter value is required" is checked
vi: Giá trị mặc định phải được đặt khi kiểm tra "Giá trị bộ lọc được yêu cầu"

source: Default value must be set when "Filter has default value" is checked
vi: Giá trị mặc định phải được đặt khi kiểm tra "Bộ lọc có giá trị mặc định"

source: Apply to all panels
vi: Áp dụng cho tất cả các bảng

source: Apply to specific panels
vi: Áp dụng cho các bảng cụ thể

source: Only selected panels will be affected by this filter
vi: Chỉ các bảng được chọn sẽ bị ảnh hưởng bởi bộ lọc này

source: All panels with this column will be affected by this filter
vi: Tất cả các bảng với cột này sẽ bị ảnh hưởng bởi bộ lọc này

source: All panels
vi: Tất cả các bảng

source: This chart might be incompatible with the filter (datasets don't match)
vi: Biểu đồ này có thể không tương thích với bộ lọc (tập dữ liệu không khớp)

source: Keep editing
vi: Tiếp tục chỉnh sửa

source: Yes, cancel
vi: Xác nhận huỷ

source: There are unsaved changes.
vi: Có những thay đổi chưa được lưu.

source: Are you sure you want to cancel?
vi: Bạn có chắc chắn muốn hủy bỏ không?

source: Error loading chart datasources. Filters may not work correctly.
vi: Lỗi khi tải nguồn dữ liệu biểu đồ. Bộ lọc có thể không hoạt động đúng.

source: Transparent
vi: Trong suốt

source: White
vi: Trắng

source: All filters
vi: Tất cả bộ lọc

source: Click to edit %s.
vi: Nhấp để chỉnh sửa %s.

source: Click to edit chart.
vi: Nhấp để chỉnh sửa biểu đồ.

source: Use %s to open in a new tab.
vi: Sử dụng %s để mở trong tab mới.

source: Medium
vi: Trung bình

source: New header
vi: Tiêu đề mới

source: Tab title
vi: Tiêu đề Tab

source: This session has encountered an interruption, and some controls may not work as intended. If you are the developer of this app, please check that the guest token is being generated correctly.
vi: Phiên này đã gặp sự cố và một số điều khiển có thể không hoạt động như mong đợi. Nếu bạn là nhà phát triển của ứng dụng này, vui lòng kiểm tra xem mã thông báo khách được tạo ra đúng cách hay không.

source: Equal to (=)
vi: Bằng (=)

source: Not equal to (≠)
vi: Không bằng (≠)

source: Less than (<)
vi: Nhỏ hơn (<)

source: Less or equal (<=)
vi: Nhỏ hơn hoặc bằng (<=)

source: Greater than (>)
vi: Lớn hơn (>)

source: Greater or equal (>=)
vi: Lớn hơn hoặc bằng (>=)

source: In
vi: Trong

source: Not in
vi: Không trong

source: Like
vi: Giống

source: Like (case insensitive)
vi: Giống (không phân biệt hoa thường)

source: Is not null
vi: Không rỗng

source: Is null
vi: Rỗng

source: use latest_partition template
vi: sử dụng mẫu latest_partition

source: Is true
vi: Đúng

source: Is false
vi: Sai

source: TEMPORAL_RANGE
vi: Khoảng thời gian

source: Time granularity
vi: Độ tỉ mỉ thời gian

source: Duration in ms (100.40008 => 100ms 400µs 80ns)
vi: Thời gian trong ms (100.40008 => 100ms 400µs 80ns)

source: One or many columns to group by. High cardinality groupings should include a series limit to limit the number of fetched and rendered series.
vi: Một hoặc nhiều cột để nhóm theo. Các nhóm có độ kardinal cao nên bao gồm một giới hạn series để giới hạn số lượng series được truy xuất và hiển thị.

source: One or many metrics to display
vi: Một hoặc nhiều chỉ số để hiển thị

source: Fixed color
vi: Màu cố định

source: Right axis metric
vi: Chỉ số trục phải

source: Choose a metric for right axis
vi: Chọn một chỉ số cho trục phải

source: Linear color scheme
vi: Bảng màu tuyến tính

source: Color metric
vi: Chỉ số màu

source: One or many controls to pivot as columns
vi: Một hoặc nhiều điều khiển để xoay như cột

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`,`1 day` or `56 weeks`
vi: Độ tỉ mỉ thời gian cho việc hiển thị. Lưu ý rằng bạn có thể nhập và sử dụng ngôn ngữ tự nhiên đơn giản như `10 giây`,`1 ngày` hoặc `56 tuần`

source: The time granularity for the visualization. This applies a date transformation to alter your time column and defines a new time granularity. The options here are defined on a per database engine basis in the Superset source code.
vi: Độ tỉ mỉ thời gian cho việc hiển thị. Điều này áp dụng một biến đổi ngày để thay đổi cột thời gian của bạn và xác định một độ tỉ mỉ thời gian mới. Các tùy chọn ở đây được xác định trên cơ sở của mỗi cơ sở dữ liệu trong mã nguồn Superset.

source: The time range for the visualization. All relative times, e.g. "Last month", "Last 7 days", "now", etc. are evaluated on the server using the server's local time (sans timezone). All tooltips and placeholder times are expressed in UTC (sans timezone). The timestamps are then evaluated by the database using the engine's local timezone. Note one can explicitly set the timezone per the ISO 8601 format if specifying either the start and/or end time.
vi: Khoảng thời gian cho việc hiển thị. Tất cả các thời gian tương đối, ví dụ: "Tháng trước", "7 ngày trước", "hiện tại", vv., được đánh giá trên máy chủ sử dụng thời gian địa phương của máy chủ (không kèm múi giờ). Tất cả các gợi ý công cụ và thời gian đặt chỗ đều được biểu diễn theo múi giờ UTC (không kèm múi giờ). Thời điểm được đánh giá bởi cơ sở dữ liệu sau đó sử dụng múi giờ địa phương của máy chủ. Lưu ý rằng bạn có thể thiết lập một cách rõ ràng múi giờ theo định dạng ISO 8601 nếu chỉ định thời gian bắt đầu và/hoặc kết thúc.

source: Limits the number of rows that get displayed.
vi: Giới hạn số hàng được hiển thị.

source: Metric used to define how the top series are sorted if a series or row limit is present. If undefined reverts to the first metric (where appropriate).
vi: Đánh giá số liệu được sử dụng để xác định cách sắp xếp các chuỗi hàng đầu nếu có một giới hạn chuỗi hoặc hàng. Nếu không xác định, sẽ quay lại số liệu đầu tiên (nếu phù hợp).

source: Defines the grouping of entities. Each series is shown as a specific color on the chart and has a legend toggle
vi: Xác định nhóm của các thực thể. Mỗi chuỗi được hiển thị dưới dạng một màu cụ thể trên biểu đồ và có một công tắc chú giải.

source: Metric assigned to the [X] axis
vi: Số liệu được gán cho trục [X]

source: Metric assigned to the [Y] axis
vi: Số liệu được gán cho trục [Y]

source: Bubble size
vi: Kích thước bong bóng

source: When `Calculation type` is set to "Percentage change", the Y Axis Format is forced to `.1%`
vi: Khi `Loại tính toán` được thiết lập thành "Thay đổi phần trăm", định dạng trục Y được bắt buộc là `.1%`

source: Color scheme
vi: Bảng màu

source: An error occurred while starring this chart
vi: Đã xảy ra lỗi khi đánh dấu biểu đồ này

source: Chart [%s] has been saved
vi: Biểu đồ [%s] đã được lưu

source: Chart [%s] has been overwritten
vi: Biểu đồ [%s] đã được ghi đè

source: Dashboard [%s] just got created and chart [%s] was added to it
vi: Báo cáo [%s] vừa được tạo và biểu đồ [%s] đã được thêm vào đó

source: Chart [%s] was added to dashboard [%s]
vi: Biểu đồ [%s] đã được thêm vào báo cáo [%s]

source: GROUP BY
vi: NHÓM BỞI

source: Use this section if you want a query that aggregates
vi: Sử dụng phần này nếu bạn muốn một truy vấn tổng hợp

source: NOT GROUPED BY
vi: KHÔNG NHÓM BỞI

source: Use this section if you want to query atomic rows
vi: Sử dụng phần này nếu bạn muốn truy vấn các hàng nguyên tử

source: The X-axis is not on the filters list
vi: Trục X không có trong danh sách bộ lọc

source: The X-axis is not on the filters list which will prevent it from being used in time range filters in dashboards. Would you like to add it to the filters list?
vi: Trục X không có trong danh sách bộ lọc, điều này sẽ ngăn nó được sử dụng trong các bộ lọc dải thời gian trong báo cáo. Bạn có muốn thêm nó vào danh sách bộ lọc không?

source: You cannot delete the last temporal filter as it's used for time range filters in dashboards.
vi: Bạn không thể xóa bộ lọc thời gian cuối cùng vì nó được sử dụng cho bộ lọc dải thời gian trong báo cáo.

source: This section contains validation errors
vi: Phần này chứa các lỗi xác thực

source: Keep control settings?
vi: Giữ các thiết lập điều khiển?

source: You've changed datasets. Any controls with data (columns, metrics) that match this new dataset have been retained.
vi: Bạn đã thay đổi các bộ dữ liệu. Bất kỳ điều khiển nào với dữ liệu (cột, số liệu) phù hợp với bộ dữ liệu mới này đã được giữ lại.

source: Continue
vi: Tiếp tục

source: Clear form
vi: Xóa biểu mẫu

source: No form settings were maintained
vi: Không có cài đặt biểu mẫu nào được duy trì

source: We were unable to carry over any controls when switching to this new dataset.
vi: Chúng tôi không thể chuyển các điều khiển nào khi chuyển sang bộ dữ liệu mới này.

source: Customize
vi: Tùy chỉnh

source: Generating link, please wait..
vi: Đang tạo liên kết, vui lòng đợi...

source: Chart height
vi: Chiều cao biểu đồ

source: Chart width
vi: Chiều rộng biểu đồ

source: An error occurred while loading dashboard information.
vi: Đã xảy ra lỗi khi tải thông tin báo cáo.

source: Save (Overwrite)
vi: Lưu (Ghi đè)

source: Save as...
vi: Lưu dưới dạng...

source: Chart name
vi: Tên biểu đồ

source: Dataset Name
vi: Tên bộ dữ liệu

source: A reusable dataset will be saved with your chart.
vi: Một bộ dữ liệu có thể tái sử dụng sẽ được lưu với biểu đồ của bạn.

source: Add to dashboard
vi: Thêm vào báo cáo

source: Select
vi: Chọn

source: a dashboard OR
vi: một báo cáo HOẶC

source: create
vi: tạo

source: a new one
vi: một cái mới

source: A new chart and dashboard will be created.
vi: Một biểu đồ và báo cáo mới sẽ được tạo.

source: A new chart will be created.
vi: Một biểu đồ mới sẽ được tạo.

source: A new dashboard will be created.
vi: Một báo cáo mới sẽ được tạo.

source: Save & go to dashboard
vi: Lưu & đi đến báo cáo

source: Save chart
vi: Lưu biểu đồ

source: Formatted date
vi: Ngày được định dạng

source: Column Formatting
vi: Định dạng cột

source: Collapse data panel
vi: Thu gọn bảng dữ liệu

source: Expand data panel
vi: Mở rộng bảng dữ liệu

source: Samples
vi: Mẫu

source: No samples were returned for this dataset
vi: Không có mẫu nào được trả về cho bộ dữ liệu này

source: No results
vi: Không có kết quả

source: Showing %s of %s
vi: Đang hiển thị %s của %s

source: %s ineligible item(s) are hidden
vi: %s mục không đủ điều kiện đã được ẩn

source: Show less...
vi: Hiển thị ít hơn...

source: Show all...
vi: Hiển thị tất cả...

source: Search Metrics & Columns
vi: Tìm kiếm số liệu và cột

source: to edit or add columns and metrics.
vi: để chỉnh sửa hoặc thêm cột và số liệu.

source: Unable to retrieve dashboard colors
vi: Không thể lấy màu của báo cáo

source: Not added to any dashboard
vi: Không được thêm vào bất kỳ báo cáo nào

source: You can preview the list of dashboards in the chart settings dropdown.
vi: Bạn có thể xem trước danh sách các báo cáo trong danh sách thả xuống cài đặt biểu đồ.

source: Not available
vi: Không có sẵn

source: Add the name of the chart
vi: Thêm tên của biểu đồ

source: Chart title
vi: Tiêu đề biểu đồ

source: Add required control values to save chart
vi: Thêm các giá trị điều khiển cần thiết để lưu biểu đồ

source: Chart type requires a dataset
vi: Loại biểu đồ yêu cầu một bộ dữ liệu

source: This chart type is not supported when using an unsaved query as a chart source.
vi: Loại biểu đồ này không được hỗ trợ khi sử dụng một truy vấn chưa được lưu làm nguồn của biểu đồ.

source: to visualize your data.
vi: để hiển thị dữ liệu của bạn.

source: Required control values have been removed
vi: Các giá trị điều khiển cần thiết đã được loại bỏ

source: Your chart is not up to date
vi: Biểu đồ của bạn không cập nhật

source: You updated the values in the control panel, but the chart was not updated automatically. Run the query by clicking on the "Update chart" button or
vi: Bạn đã cập nhật các giá trị trong báo cáo, nhưng biểu đồ không được cập nhật tự động. Chạy truy vấn bằng cách nhấp vào nút "Cập nhật biểu đồ" hoặc

source: Controls labeled
vi: Điều khiển được gắn nhãn

source: Control labeled
vi: Điều khiển được gắn nhãn

source: Chart Source
vi: Nguồn của biểu đồ

source: Open Datasource tab
vi: Mở tab Nguồn dữ liệu

source: Original
vi: Ban đầu

source: Pivoted
vi: Pivot

source: You do not have permission to edit this chart
vi: Bạn không có quyền chỉnh sửa biểu đồ này

source: Chart properties updated
vi: Thuộc tính biểu đồ đã được cập nhật

source: Edit Chart Properties
vi: Chỉnh sửa Thuộc tính biểu đồ

source: This chart is managed externally, and can't be edited in Superset
vi: Biểu đồ này được quản lý bên ngoài và không thể chỉnh sửa trong Superset

source: The description can be displayed as widget headers in the dashboard view. Supports markdown.
vi: Mô tả có thể hiển thị dưới dạng tiêu đề widget trong chế độ xem báo cáo. Hỗ trợ markdown.

source: Person or group that has certified this chart.
vi: Người hoặc nhóm đã chứng nhận biểu đồ này.

source: Configuration
vi: Cấu hình

source: Duration (in seconds) of the caching timeout for this chart. Set to -1 to bypass the cache. Note this defaults to the dataset's timeout if undefined.
vi: Thời gian (tính bằng giây) của thời gian chờ đợi bộ nhớ cache cho biểu đồ này. Đặt thành -1 để bỏ qua bộ nhớ cache. Lưu ý rằng mặc định này là thời gian chờ đợi của bộ dữ liệu nếu không xác định.

source: A list of users who can alter the chart. Searchable by name or username.
vi: Danh sách người dùng có thể thay đổi biểu đồ. Có thể tìm kiếm theo tên hoặc tên người dùng.

source: The row limit set for the chart was reached. The chart may show partial data.
vi: Giới hạn hàng được đặt cho biểu đồ đã được đạt. Biểu đồ có thể hiển thị dữ liệu một phần.

source: Create chart
vi: Tạo biểu đồ

source: Update chart
vi: Cập nhật biểu đồ

source: Invalid lat/long configuration.
vi: Cấu hình lat/long không hợp lệ.

source: Reverse lat/long
vi: Đảo ngược lat/long

source: Longitude & Latitude columns
vi: Cột Kinh độ & Vĩ độ

source: Delimited long & lat single column
vi: Cột duy nhất chứa lat & long phân cách

source: Multiple formats accepted, look the geopy.points Python library for more details
vi: Nhiều định dạng được chấp nhận, tìm hiểu thêm về thư viện Python geopy.points để biết thêm chi tiết

source: textarea
vi: vùng văn bản

source: in modal
vi: trong cửa sổ

source: Sorry, An error occurred
vi: Xin lỗi, đã xảy ra lỗi

source: Save as Dataset
vi: Lưu dưới dạng Bộ dữ liệu

source: Open in SQL Lab
vi: Mở trong SQL Lab

source: Failed to verify select options: %s
vi: Không thể xác minh các tùy chọn lựa chọn: %s

source: Annotation layer
vi: Lớp chú thích

source: Select the Annotation Layer you would like to use.
vi: Chọn Lớp chú thích mà bạn muốn sử dụng.

source: Use another existing chart as a source for annotations and overlays. Your chart must be one of these visualization types: [%s]
vi: Sử dụng một biểu đồ hiện có khác làm nguồn dữ liệu cho các chú thích và các lớp chồng lên. Biểu đồ của bạn phải thuộc một trong các loại hiển thị này: [%s]

source: Expects a formula with depending time parameter 'x' in milliseconds since epoch. mathjs is used to evaluate the formulas. Example: '2x+5'
vi: Chờ đợi một công thức với tham số thời gian phụ thuộc 'x' tính bằng mili giây kể từ epoch. mathjs được sử dụng để đánh giá các công thức. Ví dụ: '2x+5'

source: Annotation layer value
vi: Giá trị lớp chú thích

source: Bad formula.
vi: Công thức không hợp lệ.

source: Annotation Slice Configuration
vi: Cấu hình lát cắt chú thích

source: This section allows you to configure how to use the slice to generate annotations.
vi: Phần này cho phép bạn cấu hình cách sử dụng lát cắt để tạo ra các chú thích.

source: Annotation layer time column
vi: Cột thời gian lớp chú thích

source: Interval start column
vi: Cột bắt đầu khoảng thời gian

source: Event time column
vi: Cột thời gian sự kiện

source: This column must contain date/time information.
vi: Cột này phải chứa thông tin về ngày/giờ.

source: Annotation layer interval end
vi: Kết thúc khoảng thời gian của lớp chú thích

source: Interval End column
vi: Cột Kết thúc khoảng thời gian

source: Annotation layer title column
vi: Cột tiêu đề của lớp chú thích

source: Title Column
vi: Cột tiêu đề

source: Pick a title for you annotation.
vi: Chọn một tiêu đề cho chú thích của bạn.

source: Annotation layer description columns
vi: Các cột mô tả của lớp chú thích

source: Description Columns
vi: Các cột mô tả

source: Pick one or more columns that should be shown in the annotation. If you don't select a column all of them will be shown.
vi: Chọn một hoặc nhiều cột mà bạn muốn hiển thị trong chú thích. Nếu bạn không chọn cột nào, tất cả sẽ được hiển thị.

source: Override time range
vi: Ghi đè phạm vi thời gian

source: This controls whether the "time_range" field from the current view should be passed down to the chart containing the annotation data.
vi: Điều này điều khiển liệu trường "thời_gian" từ chế độ xem hiện tại có nên được chuyển xuống biểu đồ chứa dữ liệu chú thích hay không.

source: Override time grain
vi: Ghi đè loại thời gian
