Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Delete Report?
vi: Xóa Báo cáo?

source: rowlevelsecurity
vi: Bảo mật cấp dòng

source: Rule added
vi: Đã thêm quy tắc

source: Edit Rule
vi: Chỉnh sửa Quy tắc

source: Add Rule
vi: Thêm Quy tắc

source: Rule Name
vi: Tên Quy tắc

source: The name of the rule must be unique
vi: Tên của quy tắc phải là duy nhất

source: Regular filters add where clauses to queries if a user belongs to a role referenced in the filter, base filters apply filters to all queries except the roles defined in the filter, and can be used to define what users can see if no RLS filters within a filter group apply to them.
vi: Bộ lọc thông thường thêm điều kiện vào các truy vấn nếu người dùng thuộc một vai trò được tham chiếu trong bộ lọc, bộ lọc cơ sở áp dụng bộ lọc cho tất cả các truy vấn ngoại trừ các vai trò được xác định trong bộ lọc, và có thể được sử dụng để xác định những gì người dùng có thể nhìn thấy nếu không có bộ lọc RLS trong một nhóm bộ lọc nào áp dụng cho họ.

source: These are the datasets this filter will be applied to.
vi: Đây là các bộ dữ liệu mà bộ lọc này sẽ được áp dụng.

source: Excluded roles
vi: Các vai trò bị loại trừ

source: For regular filters, these are the roles this filter will be applied to. For base filters, these are the roles that the filter DOES NOT apply to, e.g. Admin if admin should see all data.
vi: Đối với các bộ lọc thông thường, đây là các vai trò mà bộ lọc này sẽ được áp dụng cho. Đối với các bộ lọc cơ bản, đây là các vai trò mà bộ lọc KHÔNG ÁP DỤNG, ví dụ: Quản trị viên nếu quản trị viên nên xem tất cả dữ liệu.

source: Group Key
vi: Khóa nhóm

source: Filters with the same group key will be ORed together within the group, while different filter groups will be ANDed together. Undefined group keys are treated as unique groups, i.e. are not grouped together. For example, if a table has three filters, of which two are for departments Finance and Marketing (group key = 'department'), and one refers to the region Europe (group key = 'region'), the filter clause would apply the filter (department = 'Finance' OR department = 'Marketing') AND (region = 'Europe').
vi: Các bộ lọc có cùng khóa nhóm sẽ được OR lại với nhau trong nhóm, trong khi các nhóm bộ lọc khác nhau sẽ được AND lại với nhau. Khóa nhóm không xác định được xem như là các nhóm duy nhất, tức là không được nhóm lại cùng nhau. Ví dụ, nếu một bảng có ba bộ lọc, trong đó hai bộ lọc là cho các phòng ban Tài chính và Tiếp thị (khóa nhóm = 'phòng ban'), và một bộ lọc áp dụng cho vùng châu Âu (khóa nhóm = 'khu vực'), mệnh đề bộ lọc sẽ áp dụng bộ lọc (phòng ban = 'Tài chính' HOẶC phòng ban = 'Tiếp thị') VÀ (khu vực = 'Châu Âu').

source: Clause
vi: Mệnh đề

source: This is the condition that will be added to the WHERE clause. For example, to only return rows for a particular client, you might define a regular filter with the clause `client_id = 9`. To display no rows unless a user belongs to a RLS filter role, a base filter can be created with the clause `1 = 0` (always false).
vi: Đây là điều kiện sẽ được thêm vào mệnh đề WHERE. Ví dụ, để chỉ trả về các hàng cho một khách hàng cụ thể, bạn có thể xác định một bộ lọc thông thường với mệnh đề `client_id = 9`. Để không hiển thị bất kỳ hàng nào trừ khi người dùng thuộc một vai trò bộ lọc RLS, một bộ lọc cơ bản có thể được tạo với mệnh đề `1 = 0` (luôn luôn sai).

source: Regular
vi: Thông thường

source: Base
vi: Cơ bản

source: %s items could not be tagged because you don’t have edit permissions to all selected objects.
vi: Không thể gắn thẻ %s mục vì bạn không có quyền chỉnh sửa cho tất cả các đối tượng được chọn.

source: Tagged %s %ss
vi: %s %ss đã được gắn thẻ

source: Failed to tag items
vi: Không thể gắn thẻ các mục

source: Bulk tag
vi: Gắn thẻ hàng loạt

source: You are adding tags to %s %ss
vi: Bạn đang thêm các thẻ vào %s %ss

source: tags
vi: thẻ

source: Select Tags
vi: Chọn Thẻ

source: Tag updated
vi: Thẻ được cập nhật

source: Tag created
vi: Thẻ đã được tạo

source: Tag name
vi: Tên thẻ

source: Name of your tag
vi: Tên của thẻ của bạn

source: Add description of your tag
vi: Thêm mô tả của thẻ của bạn

source: Chosen non-numeric column
vi: Cột không số được chọn

source: UI Configuration
vi: Cấu hình giao diện người dùng

source: Filter value is required
vi: Giá trị bộ lọc là bắt buộc

source: User must select a value before applying the filter
vi: Người dùng phải chọn một giá trị trước khi áp dụng bộ lọc

source: Single value
vi: Một giá trị

source: Use only a single value.
vi: Chỉ sử dụng một giá trị.

source: Range filter plugin using AntD
vi: Bộ lọc phạm vi sử dụng AntD

source: Experimental
vi: Thử nghiệm

source: (excluded)
vi: (được loại trừ)

source: Check for sorting ascending
vi: Kiểm tra sắp xếp tăng dần

source: Can select multiple values
vi: Có thể chọn nhiều giá trị

source: Select first filter value by default
vi: Chọn giá trị bộ lọc đầu tiên theo mặc định

source: When using this option, default value can’t be set
vi: Khi sử dụng tùy chọn này, giá trị mặc định không thể được thiết lập

source: Inverse selection
vi: Chọn ngược

source: Exclude selected values
vi: Loại bỏ các giá trị đã chọn

source: Dynamically search all filter values
vi: Tìm kiếm động tất cả các giá trị bộ lọc

source: By default, each filter loads at most 1000 choices at the initial page load. Check this box if you have more than 1000 filter values and want to enable dynamically searching that loads filter values as users type (may add stress to your database).
vi: Mặc định, mỗi bộ lọc tải tối đa 1000 lựa chọn trong lần tải trang ban đầu. Đánh dấu vào ô này nếu bạn có hơn 1000 giá trị bộ lọc và muốn kích hoạt việc tìm kiếm động để tải các giá trị bộ lọc khi người dùng nhập (có thể làm tăng tải cho cơ sở dữ liệu của bạn).

source: Select filter plugin using AntD
vi: Chọn plugin bộ lọc sử dụng AntD

source: Custom time filter plugin
vi: Plugin bộ lọc thời gian tùy chỉnh

source: No time columns
vi: Không có cột thời gian

source: Time column filter plugin
vi: Plugin bộ lọc cột thời gian

source: Time grain filter plugin
vi: Plugin bộ lọc thời gian cụ thể

source: Working
vi: Đang hoạt động

source: Not triggered
vi: Không kích hoạt

source: On Grace
vi: Trong thời gian Grace

source: reports
vi: báo cáo

source: alerts
vi: cảnh báo

source: There was an issue deleting the selected %s: %s
vi: Đã xảy ra sự cố khi xóa %s đã chọn: %s

source: Last run
vi: Chạy lần cuối

source: Active
vi: Hoạt động

source: Execution log
vi: Nhật ký thực thi

source: Bulk select
vi: Lựa chọn hàng loạt

source: No %s yet
vi: Chưa có %s

source: Owner
vi: Chủ sở hữu

source: All
vi: Tất cả

source: An error occurred while fetching owners values: %s
vi: Đã xảy ra lỗi khi truy xuất giá trị của chủ sở hữu: %s

source: Status
vi: Trạng thái

source: An error occurred while fetching dataset datasource values: %s
vi: Đã xảy ra lỗi khi truy xuất giá trị nguồn dữ liệu tập dữ liệu: %s

source: Alerts & reports
vi: Cảnh báo và báo cáo

source: Alerts
vi: Cảnh báo

source: Reports
vi: Báo cáo

source: Delete %s?
vi: Xóa %s?

source: Are you sure you want to delete the selected %s?
vi: Bạn có chắc chắn muốn xóa %s đã chọn không?

source: Error Fetching Tagged Objects
vi: Lỗi Truy xuất Các Đối tượng Đã Gắn Thẻ

source: Edit Tag
vi: Chỉnh sửa Thẻ

source: There was an issue deleting the selected layers: %s
vi: Đã xảy ra sự cố khi xóa các lớp đã chọn: %s

source: Edit template
vi: Chỉnh sửa mẫu

source: Delete template
vi: Xóa mẫu

source: Changed by
vi: Được thay đổi bởi

source: No annotation layers yet
vi: Chưa có lớp chú thích nào

source: This action will permanently delete the layer.
vi: Hành động này sẽ xóa lớp một cách vĩnh viễn.

source: Delete Layer?
vi: Xóa Lớp?

source: Are you sure you want to delete the selected layers?
vi: Bạn có chắc chắn muốn xóa các lớp đã chọn không?

source: There was an issue deleting the selected annotations: %s
vi: Đã xảy ra sự cố khi xóa các chú thích đã chọn: %s

source: Delete annotation
vi: Xóa chú thích

source: Annotation
vi: Chú thích

source: No annotation yet
vi: Chưa có chú thích nào

source: Back to all
vi: Quay lại tất cả

source: Are you sure you want to delete %s?
vi: Bạn có chắc chắn muốn xóa %s không?

source: Delete Annotation?
vi: Xóa Chú thích?

source: Are you sure you want to delete the selected annotations?
vi: Bạn có chắc chắn muốn xóa các chú thích đã chọn không?

source: Failed to load chart data
vi: Không thể tải dữ liệu biểu đồ

source: view instructions
vi: xem hướng dẫn

source: Add a dataset
vi: Thêm một tập dữ liệu

source: Choose a dataset
vi: Chọn một tập dữ liệu

source: Choose chart type
vi: Chọn loại biểu đồ

source: Please select both a Dataset and a Chart type to proceed
vi: Vui lòng chọn cả Tập dữ liệu và Loại biểu đồ để tiếp tục

source: The passwords for the databases below are needed in order to import them together with the charts. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
vi: Cần có mật khẩu cho các cơ sở dữ liệu dưới đây để nhập chúng cùng với các biểu đồ. Vui lòng lưu ý rằng các phần "Secure Extra" và "Certificate" của cấu hình cơ sở dữ liệu không có trong các tệp xuất, và nên được thêm vào sau khi nhập nếu chúng cần thiết.

source: You are importing one or more charts that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
vi: Bạn đang nhập một hoặc nhiều biểu đồ đã tồn tại. Ghi đè có thể làm bạn mất một số công việc của mình. Bạn có chắc chắn muốn ghi đè không?

source: Chart imported
vi: Biểu đồ đã được nhập

source: There was an issue deleting the selected charts: %s
vi: Đã xảy ra sự cố khi xóa các biểu đồ đã chọn: %s

source: An error occurred while fetching dashboards
vi: Đã xảy ra lỗi khi truy xuất báo cáo

source: Any
vi: Bất kỳ

source: Tag
vi: Thẻ

source: An error occurred while fetching chart owners values: %s
vi: Đã xảy ra lỗi khi truy xuất giá trị chủ sở hữu biểu đồ: %s

source: Certified
vi: Đã được chứng nhận

source: Alphabetical
vi: Theo thứ tự chữ cái

source: Recently modified
vi: Được sửa đổi gần đây

source: Least recently modified
vi: Ít được sửa đổi nhất gần đây

source: Import charts
vi: Nhập biểu đồ

source: Are you sure you want to delete the selected charts?
vi: Bạn có chắc chắn muốn xóa các biểu đồ đã chọn không?

source: CSS templates
vi: Mẫu CSS

source: There was an issue deleting the selected templates: %s
vi: Đã xảy ra sự cố khi xóa các mẫu đã chọn: %s

source: CSS template
vi: Mẫu CSS

source: This action will permanently delete the template.
vi: Hành động này sẽ xóa mẫu một cách vĩnh viễn.

source: Delete Template?
vi: Xóa Mẫu?

source: Are you sure you want to delete the selected templates?
vi: Bạn có chắc chắn muốn xóa các mẫu đã chọn không?

source: The passwords for the databases below are needed in order to import them together with the dashboards. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
vi: Cần có mật khẩu cho các cơ sở dữ liệu dưới đây để nhập chúng cùng với các báo cáo. Vui lòng lưu ý rằng các phần "Secure Extra" và "Certificate" của cấu hình cơ sở dữ liệu không có trong các tệp xuất, và nên được thêm vào sau khi nhập nếu chúng cần thiết.

source: You are importing one or more dashboards that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
vi: Bạn đang nhập một hoặc nhiều báo cáo đã tồn tại. Ghi đè có thể làm bạn mất một số công việc của mình. Bạn có chắc chắn muốn ghi đè không?

source: Dashboard imported
vi: Báo cáo đã được nhập

source: There was an issue deleting the selected dashboards:
vi: Đã xảy ra sự cố khi xóa các báo cáo đã chọn:

source: An error occurred while fetching dashboard owner values: %s
vi: Đã xảy ra lỗi khi truy xuất giá trị chủ sở hữu báo cáo: %s

source: Are you sure you want to delete the selected dashboards?
vi: Bạn có chắc chắn muốn xóa các báo cáo đã chọn không?

source: An error occurred while fetching database related data: %s
vi: Đã xảy ra lỗi khi truy xuất dữ liệu liên quan đến cơ sở dữ liệu: %s

source: Upload file to database
vi: Tải tệp lên cơ sở dữ liệu

source: Upload CSV
vi: Tải lên CSV

source: Upload columnar file
vi: Tải lên tệp cột

source: Upload Excel file
vi: Tải lên tệp Excel

source: Allow data manipulation language
vi: Cho phép ngôn ngữ thao tác dữ liệu

source: CSV upload
vi: Tải lên CSV

source: Delete database
vi: Xóa cơ sở dữ liệu

source: The database %s is linked to %s charts that appear on %s dashboards and users have %s SQL Lab tabs using this database open. Are you sure you want to continue? Deleting the database will break those objects.
vi: Cơ sở dữ liệu %s được liên kết với %s biểu đồ xuất hiện trên %s báo cáo và người dùng có %s tab SQL Lab sử dụng cơ sở dữ liệu này đang mở. Bạn có chắc chắn muốn tiếp tục không? Xóa cơ sở dữ liệu sẽ làm hỏng các đối tượng đó.

source: Delete Database?
vi: Xóa Cơ sở dữ liệu?

source: Dataset imported
vi: Tập dữ liệu đã được nhập

source: An error occurred while fetching dataset related data
vi: Đã xảy ra lỗi khi truy xuất dữ liệu liên quan đến tập dữ liệu

source: An error occurred while fetching dataset related data: %s
vi: Đã xảy ra lỗi khi truy xuất dữ liệu liên quan đến tập dữ liệu: %s

source: Physical dataset
vi: Tập dữ liệu vật lý

source: Virtual dataset
vi: Tập dữ liệu ảo

source: Virtual
vi: Ảo

source: An error occurred while fetching datasets: %s
vi: Đã xảy ra lỗi khi truy xuất các tập dữ liệu: %s

source: An error occurred while fetching schema values: %s
vi: Đã xảy ra lỗi khi truy xuất giá trị schema: %s

source: An error occurred while fetching dataset owner values: %s
vi: Đã xảy ra lỗi khi truy xuất các giá trị chủ sở hữu tập dữ liệu: %s

source: Import datasets
vi: Nhập các bộ dữ liệu

source: There was an issue deleting the selected datasets: %s
vi: Đã xảy ra sự cố khi xóa các bộ dữ liệu đã chọn: %s

source: There was an issue duplicating the dataset.
vi: Đã xảy ra sự cố khi sao chép bộ dữ liệu.

source: There was an issue duplicating the selected datasets: %s
vi: Đã xảy ra sự cố khi sao chép các bộ dữ liệu đã chọn: %s

source: The dataset %s is linked to %s charts that appear on %s dashboards. Are you sure you want to continue? Deleting the dataset will break those objects.
vi: Bộ dữ liệu %s được liên kết với %s biểu đồ xuất hiện trên %s báo cáo. Bạn có chắc chắn muốn tiếp tục không? Xóa bộ dữ liệu sẽ làm hỏng những đối tượng đó.

source: Delete Dataset?
vi: Xóa bộ dữ liệu?

source: Are you sure you want to delete the selected datasets?
vi: Bạn có chắc chắn muốn xóa các bộ dữ liệu đã chọn không?

source: 0 Selected
vi: 0 Đã chọn

source: %s Selected (Virtual)
vi: %s Đã chọn (Ảo)

source: %s Selected (Physical)
vi: %s Đã chọn (Vật lý)

source: %s Selected (%s Physical, %s Virtual)
vi: %s Đã chọn (%s Vật lý, %s Ảo)

source: log
vi: nhật ký

source: Execution ID
vi: ID Thực thi

source: Scheduled at (UTC)
vi: Được lên lịch tại (UTC)

source: Start at (UTC)
vi: Bắt đầu tại (UTC)

source: Error message
vi: Thông báo lỗi

source: Alert
vi: Cảnh báo

source: There was an issue fetching your recent activity: %s
vi: Đã xảy ra sự cố khi truy xuất hoạt động gần đây của bạn: %s

source: There was an issue fetching your dashboards: %s
vi: Đã xảy ra sự cố khi truy xuất báo cáo của bạn: %s

source: There was an issue fetching your chart: %s
vi: Đã xảy ra sự cố khi truy xuất biểu đồ của bạn: %s

source: There was an issue fetching your saved queries: %s
vi: Đã xảy ra sự cố khi truy xuất các truy vấn đã lưu của bạn: %s

source: Thumbnails
vi: Hình thu nhỏ

source: Recents
vi: Gần đây

source: There was an issue previewing the selected query. %s
vi: Đã xảy ra sự cố khi xem trước truy vấn đã chọn. %s

source: TABLES
vi: BẢNG

source: Open query in SQL Lab
vi: Mở truy vấn trong SQL Lab

source: An error occurred while fetching database values: %s
vi: Đã xảy ra lỗi khi truy xuất các giá trị cơ sở dữ liệu: %s

source: An error occurred while fetching user values: %s
vi: Đã xảy ra lỗi khi truy xuất các giá trị người dùng: %s

source: Search by query text
vi: Tìm kiếm theo văn bản truy vấn

source: Deleted %s
vi: Đã xóa %s

source: Deleted
vi: Đã xóa

source: There was an issue deleting rules: %s
vi: Đã xảy ra sự cố khi xóa các quy tắc: %s

source: No Rules yet
vi: Chưa có Quy tắc nào

source: Are you sure you want to delete the selected rules?
vi: Bạn có chắc chắn muốn xóa các quy tắc đã chọn không?

source: The passwords for the databases below are needed in order to import them together with the saved queries. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
vi: Cần mật khẩu cho các cơ sở dữ liệu dưới đây để nhập chúng cùng với các truy vấn đã lưu. Lưu ý rằng các phần "Bổ sung Bảo mật" và "Chứng chỉ" của cấu hình cơ sở dữ liệu không có trong các tệp xuất và cần được thêm vào bằng cách thủ công sau khi nhập nếu cần.

source: You are importing one or more saved queries that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
vi: Bạn đang nhập một hoặc nhiều truy vấn đã lưu đã tồn tại. Ghi đè có thể khiến bạn mất một phần của công việc của mình. Bạn có chắc chắn muốn ghi đè không?

source: Query imported
vi: Truy vấn đã được nhập

source: There was an issue previewing the selected query %s
vi: Đã xảy ra sự cố khi xem trước truy vấn đã chọn %s

source: Import queries
vi: Nhập các truy vấn

source: Link Copied!
vi: Liên kết đã được sao chép!

source: There was an issue deleting the selected queries: %s
vi: Đã xảy ra sự cố khi xóa các truy vấn đã chọn: %s

source: Edit query
vi: Chỉnh sửa truy vấn

source: Copy query URL
vi: Sao chép URL truy vấn

source: Export query
vi: Xuất truy vấn

source: Delete query
vi: Xóa truy vấn

source: Are you sure you want to delete the selected queries?
vi: Bạn có chắc chắn muốn xóa các truy vấn đã chọn không?

source: queries
vi: truy vấn

source: tag
vi: thẻ

source: No Tags created
vi: Chưa tạo Thẻ nào

source: Are you sure you want to delete the selected tags?
vi: Bạn có chắc chắn muốn xóa các Thẻ đã chọn không?

source: Image download failed, please refresh and try again.
vi: Tải xuống hình ảnh thất bại, vui lòng làm mới và thử lại.

source: PDF download failed, please refresh and try again.
vi: Tải xuống PDF thất bại, vui lòng làm mới và thử lại.

source: Select values in highlighted field(s) in the control panel. Then run the query by clicking on the %s button.
vi: Chọn các giá trị trong các trường được tô sáng trong báo cáo. Sau đó, chạy truy vấn bằng cách nhấp vào nút %s.

source: An error occurred while fetching %s info: %s
vi: Đã xảy ra lỗi khi truy xuất thông tin %s: %s

source: An error occurred while fetching %ss: %s
vi: Đã xảy ra lỗi khi truy xuất %ss: %s

source: An error occurred while creating %ss: %s
vi: Đã xảy ra lỗi khi tạo %ss: %s

source: Please re-export your file and try importing again
vi: Vui lòng xuất lại tệp của bạn và thử nhập lại

source: An error occurred while importing %s: %s
vi: Đã xảy ra lỗi khi nhập %s: %s

source: There was an error fetching the favorite status: %s
vi: Đã xảy ra lỗi khi truy xuất trạng thái ưa thích: %s

source: There was an error saving the favorite status: %s
vi: Đã xảy ra lỗi khi lưu trạng thái ưa thích: %s

source: Connection looks good!
vi: Kết nối trông tốt!

source: ERROR: %s
vi: LỖI: %s

source: There was an error fetching your recent activity:
vi: Đã xảy ra lỗi khi truy xuất hoạt động gần đây của bạn:

source: There was an issue deleting: %s
vi: Đã xảy ra sự cố khi xóa: %s

source: Templated link, it's possible to include {{ metric }} or other values coming from the controls.
vi: Liên kết mẫu, có thể bao gồm {{ metric }} hoặc các giá trị khác đến từ các điều khiển.

source: Time-series Table
vi: Bảng chuỗi thời gian

source: Compare multiple time series charts (as sparklines) and related metrics quickly.
vi: So sánh nhanh chóng nhiều biểu đồ chuỗi thời gian (dưới dạng sparklines) và các chỉ số liên quan.

source: We have the following keys: %s
vi: Chúng tôi có các khóa sau: %s
