Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: The datasource is too large to query.
vi: Datasource quá lớn để truy vấn.

source: The database is under an unusual load.
vi: Cơ sở dữ liệu đang chịu tải bất thường.

source: The database returned an unexpected error.
vi: Cơ sở dữ liệu trả về lỗi không mong muốn.

source: There is a syntax error in the SQL query. Perhaps there was a misspelling or a typo.
vi: Có lỗi cú pháp trong truy vấn SQL. Có lẽ có một lỗi chính tả hoặc lỗi đánh máy.

source: The column was deleted or renamed in the database.
vi: Cột đã bị xóa hoặc đổi tên trong cơ sở dữ liệu.

source: The table was deleted or renamed in the database.
vi: Bảng đã bị xóa hoặc đổi tên trong cơ sở dữ liệu.

source: One or more parameters specified in the query are missing.
vi: Thiếu một hoặc nhiều tham số được chỉ định trong truy vấn.

source: The hostname provided can't be resolved.
vi: Tên máy chủ được cung cấp không thể được giải quyết.

source: The port is closed.
vi: Cổng đã bị đóng.

source: The host might be down, and can't be reached on the provided port.
vi: Máy chủ có thể đang ngừng hoạt động và không thể truy cập trên cổng được cung cấp.

source: Superset encountered an error while running a command.
vi: Superset gặp lỗi khi chạy lệnh.

source: Superset encountered an unexpected error.
vi: Superset gặp lỗi không mong muốn.

source: The username provided when connecting to a database is not valid.
vi: Tên người dùng được cung cấp khi kết nối đến cơ sở dữ liệu không hợp lệ.

source: The password provided when connecting to a database is not valid.
vi: Mật khẩu được cung cấp khi kết nối đến cơ sở dữ liệu không hợp lệ.

source: Either the username or the password is wrong.
vi: Tên người dùng hoặc mật khẩu sai.

source: Either the database is spelled incorrectly or does not exist.
vi: Cơ sở dữ liệu bị đánh vần sai hoặc không tồn tại.

source: The schema was deleted or renamed in the database.
vi: Schema đã bị xóa hoặc đổi tên trong cơ sở dữ liệu.

source: User doesn't have the proper permissions.
vi: Người dùng không có quyền thích hợp.

source: One or more parameters needed to configure a database are missing.
vi: Thiếu một hoặc nhiều tham số cần thiết để cấu hình cơ sở dữ liệu.

source: The submitted payload has the incorrect format.
vi: Payload đã gửi có định dạng không đúng.

source: The submitted payload has the incorrect schema.
vi: Payload đã gửi có schema không đúng.

source: Results backend needed for asynchronous queries is not configured.
vi: Kết quả backend cần thiết cho các truy vấn không đồng bộ chưa được cấu hình.

source: Database does not allow data manipulation.
vi: Cơ sở dữ liệu không cho phép thao tác dữ liệu.

source: The CTAS (create table as select) doesn't have a SELECT statement at the end. Please make sure your query has a SELECT as its last statement. Then, try running your query again.
vi: CTAS (tạo bảng như chọn) không có câu lệnh SELECT ở cuối. Vui lòng đảm bảo rằng truy vấn của bạn có SELECT là câu lệnh cuối cùng. Sau đó, hãy thử chạy lại truy vấn của bạn.

source: CVAS (create view as select) query has more than one statement.
vi: Truy vấn CVAS (tạo view như chọn) có nhiều hơn một câu lệnh.

source: CVAS (create view as select) query is not a SELECT statement.
vi: Truy vấn CVAS (tạo view như chọn) không phải là câu lệnh SELECT.

source: Query is too complex and takes too long to run.
vi: Truy vấn quá phức tạp và mất quá nhiều thời gian để chạy.

source: The database is currently running too many queries.
vi: Cơ sở dữ liệu hiện đang chạy quá nhiều truy vấn.

source: One or more parameters specified in the query are malformed.
vi: Một hoặc nhiều tham số được chỉ định trong truy vấn không đúng định dạng.

source: The object does not exist in the given database.
vi: Đối tượng không tồn tại trong cơ sở dữ liệu đã cho.

source: The query has a syntax error.
vi: Truy vấn có lỗi cú pháp.

source: The results backend no longer has the data from the query.
vi: Kết quả backend không còn dữ liệu từ truy vấn.

source: The query associated with the results was deleted.
vi: Truy vấn liên kết với kết quả đã bị xóa.

source: The results stored in the backend were stored in a different format, and no longer can be deserialized.
vi: Kết quả được lưu trữ trong backend được lưu trữ ở định dạng khác và không thể giải mã được nữa.

source: The port number is invalid.
vi: Số cổng không hợp lệ.

source: Failed to start remote query on a worker.
vi: Không thể khởi động truy vấn từ xa trên một worker.

source: The database was deleted.
vi: Cơ sở dữ liệu đã bị xóa.

source: Custom SQL fields cannot contain sub-queries.
vi: Trường SQL tùy chỉnh không thể chứa các truy vấn phụ.

source: The submitted payload failed validation.
vi: Payload đã gửi không đạt xác thực.

source: Invalid certificate
vi: Chứng chỉ không hợp lệ

source: The schema of the submitted payload is invalid.
vi: Schema của payload đã gửi không hợp lệ.

source: The SQL is invalid and cannot be parsed.
vi: SQL không hợp lệ và không thể được phân tích.

source: File size must be less than or equal to %(max_size)s bytes
vi: Kích thước tệp phải nhỏ hơn hoặc bằng %(max_size)s byte

source: Unsafe return type for function %(func)s: %(value_type)s
vi: Loại trả về không an toàn cho hàm %(func)s: %(value_type)s

source: Unsupported return value for method %(name)s
vi: Giá trị trả về không được hỗ trợ cho phương thức %(name)s

source: Unsafe template value for key %(key)s: %(value_type)s
vi: Giá trị mẫu không an toàn cho khóa %(key)s: %(value_type)s

source: Unsupported template value for key %(key)s
vi: Giá trị mẫu không được hỗ trợ cho khóa %(key)s

source: Please specify the Dataset ID for the ``%(name)s`` metric in the Jinja macro.
vi: Vui lòng chỉ định ID tập dữ liệu cho chỉ số ``%(name)s`` trong macro Jinja.

source: Metric ``%(metric_name)s`` not found in %(dataset_name)s.
vi: Không tìm thấy chỉ số ``%(metric_name)s`` trong %(dataset_name)s.

source: Only SELECT statements are allowed against this database.
vi: Chỉ các câu lệnh SELECT được phép đối với cơ sở dữ liệu này.

source: The query was killed after %(sqllab_timeout)s seconds. It might be too complex, or the database might be under heavy load.
vi: Truy vấn đã bị giết sau %(sqllab_timeout)s giây. Nó có thể quá phức tạp hoặc cơ sở dữ liệu có thể đang chịu tải nặng.

source: Results backend is not configured.
vi: Hậu trường kết quả chưa được cấu hình.

source: CTAS (create table as select) can only be run with a query where the last statement is a SELECT. Please make sure your query has a SELECT as its last statement. Then, try running your query again.
vi: CTAS (create table as select) chỉ có thể chạy với một truy vấn mà câu lệnh cuối cùng là SELECT. Vui lòng đảm bảo truy vấn của bạn có SELECT làm câu lệnh cuối cùng. Sau đó, thử chạy lại truy vấn của bạn.

source: CVAS (create view as select) can only be run with a query with a single SELECT statement. Please make sure your query has only a SELECT statement. Then, try running your query again.
vi: CVAS (create view as select) chỉ có thể chạy với một truy vấn với một câu lệnh SELECT duy nhất. Vui lòng đảm bảo truy vấn của bạn chỉ có một câu lệnh SELECT. Sau đó, thử chạy lại truy vấn của bạn.

source: Running statement %(statement_num)s out of %(statement_count)s
vi: Đang chạy câu lệnh %(statement_num)s trong số %(statement_count)s

source: Statement %(statement_num)s out of %(statement_count)s
vi: Câu lệnh %(statement_num)s trong số %(statement_count)s

source: You may have an error in your SQL statement. {message}
vi: Bạn có thể gặp lỗi trong câu lệnh SQL của mình. {message}

source: Viz is missing a datasource
vi: Viz thiếu datasource

source: Applied rolling window did not return any data. Please make sure the source query satisfies the minimum periods defined in the rolling window.
vi: Cửa sổ cuộn áp dụng không trả về dữ liệu nào. Vui lòng đảm bảo truy vấn nguồn thỏa mãn các giai đoạn tối thiểu được xác định trong cửa sổ cuộn.

source: From date cannot be larger than to date
vi: Ngày bắt đầu không thể lớn hơn ngày kết thúc

source: Cached value not found
vi: Giá trị đã lưu trong bộ nhớ cache không tìm thấy

source: Columns missing in datasource: %(invalid_columns)s
vi: Các cột thiếu trong datasource: %(invalid_columns)s

source: Time Table View
vi: Chế độ xem Bảng thời gian

source: Pick at least one metric
vi: Chọn ít nhất một chỉ số

source: When using 'Group By' you are limited to use a single metric
vi: Khi sử dụng 'Group By' bạn bị giới hạn chỉ sử dụng một chỉ số

source: Calendar Heatmap
vi: Bản đồ nhiệt lịch

source: Bubble Chart
vi: Biểu đồ bong bóng

source: Please use 3 different metric labels
vi: Vui lòng sử dụng 3 nhãn chỉ số khác nhau

source: Pick a metric for x, y and size
vi: Chọn một chỉ số cho x, y và kích thước

source: Bullet Chart
vi: Biểu đồ đạn

source: Pick a metric to display
vi: Chọn một chỉ số để hiển thị

source: Time Series - Line Chart
vi: Chuỗi thời gian - Biểu đồ đường

source: An enclosed time range (both start and end) must be specified when using a Time Comparison.
vi: Phải chỉ định khoảng thời gian bao gồm (cả bắt đầu và kết thúc) khi sử dụng So sánh thời gian.

source: Time Series - Bar Chart
vi: Chuỗi thời gian - Biểu đồ cột

source: Time Series - Period Pivot
vi: Chuỗi thời gian - Pivot kỳ hạn

source: Time Series - Percent Change
vi: Chuỗi thời gian - Thay đổi phần trăm

source: Time Series - Stacked
vi: Chuỗi thời gian - Xếp chồng

source: Histogram
vi: Biểu đồ tần suất

source: Must have at least one numeric column specified
vi: Phải có ít nhất một cột số được chỉ định

source: Distribution - Bar Chart
vi: Phân phối - Biểu đồ cột

source: Can't have overlap between Series and Breakdowns
vi: Không thể có sự trùng lặp giữa Series và Breakdowns

source: Pick at least one field for [Series]
vi: Chọn ít nhất một trường cho [Series]

source: Pick exactly 2 columns as [Source / Target]
vi: Chọn chính xác 2 cột là [Nguồn / Đích]

source: There's a loop in your Sankey, please provide a tree. Here's a faulty link: {}
vi: Có một vòng lặp trong Sankey của bạn, vui lòng cung cấp một cây. Đây là một liên kết bị lỗi: {}

source: Directed Force Layout
vi: Bố cục Lực Định hướng

source: Country Map
vi: Bản đồ Quốc gia

source: World Map
vi: Bản đồ Thế giới

source: Parallel Coordinates
vi: Tọa độ Song song

source: Heatmap
vi: Bản đồ nhiệt

source: Horizon Charts
vi: Biểu đồ Chân trời

source: [Longitude] and [Latitude] must be set
vi: [Kinh độ] và [Vĩ độ] phải được thiết lập

source: Must have a [Group By] column to have 'count' as the [Label]
vi: Phải có một cột [Group By] để có 'đếm' là [Nhãn]

source: Choice of [Label] must be present in [Group By]
vi: Lựa chọn [Nhãn] phải có trong [Group By]

source: Choice of [Point Radius] must be present in [Group By]
vi: Lựa chọn [Bán kính điểm] phải có trong [Group By]

source: [Longitude] and [Latitude] columns must be present in [Group By]
vi: Các cột [Kinh độ] và [Vĩ độ] phải có trong [Group By]

source: Deck.gl - Multiple Layers
vi: Deck.gl - Nhiều lớp

source: Bad spatial key
vi: Khóa không gian không hợp lệ

source: Invalid spatial point encountered: %(latlong)s
vi: Gặp điểm không gian không hợp lệ: %(latlong)s

source: Encountered invalid NULL spatial entry, please consider filtering those out
vi: Gặp mục không gian NULL không hợp lệ, vui lòng xem xét lọc chúng ra

source: Deck.gl - Scatter plot
vi: Deck.gl - Biểu đồ phân tán

source: Deck.gl - Screen Grid
vi: Deck.gl - Lưới màn hình

source: Deck.gl - 3D Grid
vi: Deck.gl - Lưới 3D

source: Deck.gl - Paths
vi: Deck.gl - Đường dẫn

source: Deck.gl - Polygon
vi: Deck.gl - Đa giác

source: Deck.gl - Heatmap
vi: Deck.gl - Bản đồ nhiệt

source: Deck.gl - Contour
vi: Deck.gl - Đường viền

source: Deck.gl - Arc
vi: Deck.gl - Cung

source: Event flow
vi: Luồng sự kiện

source: Time Series - Paired t-test
vi: Chuỗi thời gian - Kiểm tra t ghép đôi

source: Time Series - Nightingale Rose Chart
vi: Chuỗi thời gian - Biểu đồ hoa hồng Nightingale

source: Partition Diagram
vi: Sơ đồ phân vùng

source: Please choose at least one groupby
vi: Vui lòng chọn ít nhất một nhóm

source: Invalid advanced data type: %(advanced_data_type)s
vi: Loại dữ liệu nâng cao không hợp lệ: %(advanced_data_type)s

source: All Text
vi: Tất cả Văn bản

source: Is certified
vi: Được chứng nhận

source: Has created by
vi: Được tạo bởi

source: Created by me
vi: Được tạo bởi tôi

source: Owned Created or Favored
vi: Sở hữu, Tạo hoặc Ưu tiên

source: Total (%(aggfunc)s)
vi: Tổng (%(aggfunc)s)

source: Subtotal
vi: Tổng phụ

source: `confidence_interval` must be between 0 and 1 (exclusive)
vi: `khoảng tin cậy` phải nằm giữa 0 và 1 (không bao gồm)

source: lower percentile must be greater than 0 and less than 100. Must be lower than upper percentile.
vi: phần trăm thấp hơn phải lớn hơn 0 và nhỏ hơn 100. Phải thấp hơn phần trăm cao hơn.

source: upper percentile must be greater than 0 and less than 100. Must be higher than lower percentile.
vi: phần trăm cao hơn phải lớn hơn 0 và nhỏ hơn 100. Phải cao hơn phần trăm thấp hơn.

source: `width` must be greater or equal to 0
vi: `chiều rộng` phải lớn hơn hoặc bằng 0

source: `row_limit` must be greater than or equal to 0
vi: `giới hạn hàng` phải lớn hơn hoặc bằng 0

source: `row_offset` must be greater than or equal to 0
vi: `độ lệch hàng` phải lớn hơn hoặc bằng 0

source: orderby column must be populated
vi: cột orderby phải được điền

source: Chart has no query context saved. Please save the chart again.
vi: Biểu đồ không có ngữ cảnh truy vấn đã lưu. Vui lòng lưu lại biểu đồ.

source: Request is incorrect: %(error)s
vi: Yêu cầu không chính xác: %(error)s

source: Request is not JSON
vi: Yêu cầu không phải là JSON

source: Empty query result
vi: Kết quả truy vấn trống

source: Owners are invalid
vi: Chủ sở hữu không hợp lệ

source: Some roles do not exist
vi: Một số vai trò không tồn tại

source: Datasource type is invalid
vi: Loại datasource không hợp lệ

source: Datasource does not exist
vi: Datasource không tồn tại

source: Query does not exist
vi: Truy vấn không tồn tại

source: Annotation layer parameters are invalid.
vi: Tham số lớp chú thích không hợp lệ.

source: Annotation layer could not be created.
vi: Không thể tạo lớp chú thích.

source: Annotation layer could not be updated.
vi: Không thể cập nhật lớp chú thích.

source: Annotation layer not found.
vi: Không tìm thấy lớp chú thích.

source: Annotation layers could not be deleted.
vi: Không thể xóa các lớp chú thích.

source: Annotation layer has associated annotations.
vi: Lớp chú thích có các chú thích liên quan.

source: Name must be unique
vi: Tên phải là duy nhất

source: End date must be after start date
vi: Ngày kết thúc phải sau ngày bắt đầu

source: Short description must be unique for this layer
vi: Mô tả ngắn phải là duy nhất cho lớp này

source: Annotation not found.
vi: Không tìm thấy chú thích.

source: Annotation parameters are invalid.
vi: Tham số chú thích không hợp lệ.

source: Annotation could not be created.
vi: Không thể tạo chú thích.

source: Annotation could not be updated.
vi: Không thể cập nhật chú thích.

source: Annotations could not be deleted.
vi: Không thể xóa các chú thích.

source: There are associated alerts or reports: %(report_names)s
vi: Có các cảnh báo hoặc báo cáo liên quan: %(report_names)s

source: Time string is ambiguous. Please specify [%(human_readable)s ago] or [%(human_readable)s later].
vi: Chuỗi thời gian không rõ ràng. Vui lòng chỉ định [%(human_readable)s trước] hoặc [%(human_readable)s sau].

source: Cannot parse time string [%(human_readable)s]
vi: Không thể phân tích chuỗi thời gian [%(human_readable)s]

source: Time delta is ambiguous. Please specify [%(human_readable)s ago] or [%(human_readable)s later].
vi: Khoảng thời gian không rõ ràng. Vui lòng chỉ định [%(human_readable)s trước] hoặc [%(human_readable)s sau].

source: Database does not exist
vi: Cơ sở dữ liệu không tồn tại

source: Dashboards do not exist
vi: Báo cáo không tồn tại

source: Datasource type is required when datasource_id is given
vi: Loại datasource là bắt buộc khi datasource_id được cung cấp

source: Chart parameters are invalid.
vi: Tham số biểu đồ không hợp lệ.

source: Chart could not be created.
vi: Không thể tạo biểu đồ.

source: Chart could not be updated.
vi: Không thể cập nhật biểu đồ.

source: Charts could not be deleted.
vi: Không thể xóa các biểu đồ.

source: There are associated alerts or reports
vi: Có các cảnh báo hoặc báo cáo liên quan

source: You don't have access to this chart.
vi: Bạn không có quyền truy cập vào biểu đồ này.

source: Changing this chart is forbidden
vi: Thay đổi biểu đồ này bị cấm

source: Import chart failed for an unknown reason
vi: Nhập biểu đồ thất bại vì lý do không xác định

source: Changing one or more of these dashboards is forbidden
vi: Thay đổi một hoặc nhiều báo cáo này bị cấm

source: Chart not found
vi: Không tìm thấy biểu đồ

source: Error: %(error)s
vi: Lỗi: %(error)s

source: CSS templates could not be deleted.
vi: Không thể xóa các mẫu CSS.

source: CSS template not found.
vi: Không tìm thấy mẫu CSS.

source: Must be unique
vi: Phải là duy nhất

source: Dashboard parameters are invalid.
vi: Tham số báo cáo không hợp lệ.

source: Dashboards could not be created.
vi: Không thể tạo các báo cáo.

source: Dashboard could not be updated.
vi: Không thể cập nhật báo cáo.

source: Dashboard could not be deleted.
vi: Không thể xóa báo cáo.

source: Changing this Dashboard is forbidden
vi: Thay đổi Báo cáo này bị cấm

source: Import dashboard failed for an unknown reason
vi: Nhập báo cáo thất bại vì lý do không xác định

source: You don't have access to this dashboard.
vi: Bạn không có quyền truy cập vào báo cáo này.

source: You don't have access to this embedded dashboard config.
vi: Bạn không có quyền truy cập vào cấu hình báo cáo nhúng này.

source: No data in file
vi: Không có dữ liệu trong tệp

source: Database parameters are invalid.
vi: Tham số cơ sở dữ liệu không hợp lệ.

source: A database with the same name already exists.
vi: Đã tồn tại một cơ sở dữ liệu với cùng tên.

source: Field is required
vi: Trường là bắt buộc

source: Field cannot be decoded by JSON. %(json_error)s
vi: Trường không thể được giải mã bởi JSON. %(json_error)s

source: The metadata_params in Extra field is not configured correctly. The key %{key}s is invalid.
vi: Tham số metadata_params trong trường Extra không được cấu hình chính xác. Khóa %{key}s không hợp lệ.

source: Database not found.
vi: Không tìm thấy cơ sở dữ liệu.

source: Database could not be created.
vi: Không thể tạo cơ sở dữ liệu.

source: Database could not be updated.
vi: Không thể cập nhật cơ sở dữ liệu.

source: Connection failed, please check your connection settings
vi: Kết nối thất bại, vui lòng kiểm tra cài đặt kết nối của bạn

source: Cannot delete a database that has datasets attached
vi: Không thể xóa một cơ sở dữ liệu có các tập dữ liệu đính kèm

source: Database could not be deleted.
vi: Không thể xóa cơ sở dữ liệu.

source: Stopped an unsafe database connection
vi: Đã dừng một kết nối cơ sở dữ liệu không an toàn

source: Could not load database driver
vi: Không thể tải trình điều khiển cơ sở dữ liệu

source: Unexpected error occurred, please check your logs for details
vi: Đã xảy ra lỗi không mong muốn, vui lòng kiểm tra nhật ký của bạn để biết chi tiết

source: no SQL validator is configured
vi: không có bộ kiểm tra SQL nào được cấu hình

source: No validator found (configured for the engine)
vi: Không tìm thấy bộ kiểm tra (được cấu hình cho engine)

source: Was unable to check your query
vi: Không thể kiểm tra truy vấn của bạn

source: An unexpected error occurred
vi: Đã xảy ra lỗi không mong muốn

source: Import database failed for an unknown reason
vi: Nhập cơ sở dữ liệu thất bại vì lý do không xác định

source: Could not load database driver: {}
vi: Không thể tải trình điều khiển cơ sở dữ liệu: {}

source: Engine "%(engine)s" cannot be configured through parameters.
vi: Engine "%(engine)s"] không thể cấu hình thông qua các tham số.

source: Database is offline.
vi: Cơ sở dữ liệu đang ngoại tuyến.

source: %(validator)s was unable to check your query. Please recheck your query. Exception: %(ex)s
vi: %(validator)s không thể kiểm tra truy vấn của bạn. Vui lòng kiểm tra lại truy vấn của bạn. Ngoại lệ: %(ex)s

source: no SQL validator is configured for %(engine_spec)s
vi: không có bộ kiểm tra SQL nào được cấu hình cho %(engine_spec)s

source: No validator named %(validator_name)s found (configured for the %(engine_spec)s engine)
vi: Không tìm thấy bộ kiểm tra có tên %(validator_name)s (được cấu hình cho engine %(engine_spec)s)

source: SSH Tunnel could not be deleted.
vi: Không thể xóa Đường hầm SSH.

source: SSH Tunnel not found.
vi: Không tìm thấy Đường hầm SSH.

source: SSH Tunnel parameters are invalid.
vi: Tham số Đường hầm SSH không hợp lệ.

source: A database port is required when connecting via SSH Tunnel.
vi: Cần có cổng cơ sở dữ liệu khi kết nối qua Đường hầm SSH.

source: SSH Tunnel could not be updated.
vi: Không thể cập nhật Đường hầm SSH.

source: Creating SSH Tunnel failed for an unknown reason
vi: Tạo Đường hầm SSH thất bại vì lý do không xác định

source: SSH Tunneling is not enabled
vi: Đường hầm SSH không được kích hoạt

source: Must provide credentials for the SSH Tunnel
vi: Phải cung cấp thông tin đăng nhập cho Đường hầm SSH

source: Cannot have multiple credentials for the SSH Tunnel
vi: Không thể có nhiều thông tin đăng nhập cho Đường hầm SSH

source: The database was not found.
vi: Không tìm thấy cơ sở dữ liệu.

source: Dataset %(name)s already exists
vi: Tập dữ liệu %(name)s đã tồn tại

source: Database not allowed to change
vi: Không được phép thay đổi cơ sở dữ liệu

source: One or more columns do not exist
vi: Một hoặc nhiều cột không tồn tại

source: One or more columns are duplicated
vi: Một hoặc nhiều cột bị trùng lặp

source: One or more columns already exist
vi: Một hoặc nhiều cột đã tồn tại

source: One or more metrics do not exist
vi: Một hoặc nhiều chỉ số không tồn tại

source: One or more metrics are duplicated
vi: Một hoặc nhiều chỉ số bị trùng lặp

source: One or more metrics already exist
vi: Một hoặc nhiều chỉ số đã tồn tại

source: Table [%(table_name)s] could not be found, please double check your database connection, schema, and table name
vi: Không thể tìm thấy bảng [%(table_name)s], vui lòng kiểm tra lại kết nối cơ sở dữ liệu, lược đồ và tên bảng của bạn

source: Dataset does not exist
vi: Tập dữ liệu không tồn tại

source: Dataset parameters are invalid.
vi: Tham số tập dữ liệu không hợp lệ.

source: Dataset could not be created.
vi: Không thể tạo tập dữ liệu.

source: Dataset could not be updated.
vi: Không thể cập nhật tập dữ liệu.

source: Datasets could not be deleted.
vi: Không thể xóa các tập dữ liệu.

source: Samples for dataset could not be retrieved.
vi: Không thể truy xuất các mẫu cho tập dữ liệu.

source: Changing this dataset is forbidden
vi: Thay đổi tập dữ liệu này bị cấm

source: Import dataset failed for an unknown reason
vi: Nhập tập dữ liệu thất bại vì lý do không xác định

source: You don't have access to this dataset.
vi: Bạn không có quyền truy cập vào tập dữ liệu này.

source: Dataset could not be duplicated.
vi: Không thể sao chép tập dữ liệu.

source: Data URI is not allowed.
vi: Không được phép sử dụng URI dữ liệu.

source: The provided table was not found in the provided database
vi: Không tìm thấy bảng được cung cấp trong cơ sở dữ liệu đã cung cấp

source: Dataset column not found.
vi: Không tìm thấy cột tập dữ liệu.

source: Dataset column delete failed.
vi: Xóa cột tập dữ liệu thất bại.

source: Changing this dataset is forbidden.
vi: Thay đổi tập dữ liệu này bị cấm.

source: Dataset metric not found.
vi: Không tìm thấy chỉ số tập dữ liệu.

source: Dataset metric delete failed.
vi: Xóa chỉ số tập dữ liệu thất bại.
