Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Unknown Presto Error
vi: Lỗi Presto không xác định

source: We were unable to connect to your database named "%(database)s". Please verify your database name and try again.
vi: Chúng tôi không thể kết nối với cơ sở dữ liệu của bạn có tên "%(database)s". Vui lòng xác minh tên cơ sở dữ liệu của bạn và thử lại.

source: %(object)s does not exist in this database.
vi: %(object)s không tồn tại trong cơ sở dữ liệu này.

source: Samples for datasource could not be retrieved.
vi: Không thể lấy mẫu cho nguồn dữ liệu.

source: Changing this datasource is forbidden
vi: Cấm thay đổi nguồn dữ liệu này

source: Home
vi: Trang chủ

source: Database Connections
vi: Kết nối cơ sở dữ liệu

source: Data
vi: Dữ liệu

source: Dashboards
vi: Báo cáo

source: Charts
vi: Biểu đồ

source: Datasets
vi: Bộ dữ liệu

source: Manage
vi: Quản lý

source: CSS Templates
vi: Mẫu CSS

source: Saved Queries
vi: Truy vấn đã lưu

source: Query History
vi: Lịch sử truy vấn

source: Tags
vi: Thẻ

source: Action Log
vi: Nhật ký hành động

source: Security
vi: Bảo mật

source: Alerts & Reports
vi: Cảnh báo & Báo cáo

source: Annotation Layers
vi: Lớp chú thích

source: Row Level Security
vi: Bảo mật cấp hàng

source: An error occurred while parsing the key.
vi: Đã xảy ra lỗi khi phân tích cú pháp cho khóa.

source: An error occurred while upserting the value.
vi: Đã xảy ra lỗi khi upsert giá trị.

source: Unable to encode value
vi: Không thể mã hóa giá trị

source: Unable to decode value
vi: Không thể giải mã giá trị

source: Invalid permalink key
vi: Khóa liên kết cố định không hợp lệ

source: Error while rendering virtual dataset query: %(msg)s
vi: Lỗi khi hiển thị truy vấn tập dữ liệu ảo: %(msg)s

source: Virtual dataset query cannot consist of multiple statements
vi: Truy vấn tập dữ liệu ảo không thể bao gồm nhiều câu lệnh

source: Datetime column not provided as part table configuration and is required by this type of chart
vi: Cột ngày giờ không được cung cấp trong cấu hình bảng và được yêu cầu bởi loại biểu đồ này

source: Empty query?
vi: Truy vấn trống?

source: Unknown column used in orderby: %(col)s
vi: Cột không xác định được sử dụng trong orderby: %(col)s

source: Time column "%(col)s" does not exist in dataset
vi: Cột thời gian "%(col)s" không tồn tại trong tập dữ liệu

source: error_message
vi: Thông báo lỗi

source: Filter value list cannot be empty
vi: Danh sách giá trị bộ lọc không thể trống

source: Must specify a value for filters with comparison operators
vi: Phải chỉ định một giá trị cho các bộ lọc với toán tử so sánh

source: Invalid filter operation type: %(op)s
vi: Loại phép toán bộ lọc không hợp lệ: %(op)s

source: Error in jinja expression in WHERE clause: %(msg)s
vi: Lỗi trong biểu thức jinja trong mệnh đề WHERE: %(msg)s

source: Error in jinja expression in HAVING clause: %(msg)s
vi: Lỗi trong biểu thức jinja trong mệnh đề HAVING: %(msg)s

source: Database does not support subqueries
vi: Cơ sở dữ liệu không hỗ trợ các truy vấn con

source: Value must be greater than 0
vi: Giá trị phải lớn hơn 0

source: Custom width of the screenshot in pixels
vi: Chiều rộng tùy chỉnh của ảnh chụp màn hình theo pixel

source: Screenshot width must be between %(min)spx and %(max)spx
vi: Chiều rộng của ảnh chụp màn hình phải nằm trong khoảng từ %(min)spx đến %(max)spx

source: Error: %(text)s
vi: Lỗi: %(text)s

source: *%(name)s* %(description)s <%(url)s|Explore in Superset> %(table)s
vi: *%(name)s* %(description)s <%(url)s|Khám phá trong Superset> %(table)s

source: *%(name)s* %(description)s Error: %(text)s
vi: *%(name)s* %(description)s Lỗi: %(text)s

source: %(dialect)s cannot be used as a data source for security reasons.
vi: %(dialect)s không thể được sử dụng như một nguồn dữ liệu vì lý do bảo mật.

source: Guest user cannot modify chart payload
vi: Người dùng khách không thể sửa đổi dữ liệu đầu ra biểu đồ

source: You don't have the rights to alter %(resource)s
vi: Bạn không có quyền thay đổi %(resource)s

source: Failed to execute %(query)s
vi: Không thể thực hiện %(query)s

source: Please check your template parameters for syntax errors and make sure they match across your SQL query and Set Parameters. Then, try running your query again.
vi: Vui lòng kiểm tra các tham số mẫu của bạn để tìm lỗi cú pháp và đảm bảo chúng khớp với truy vấn SQL và Thiết lập Tham số của bạn. Sau đó, hãy thử chạy truy vấn của bạn lại.

source: The query contains one or more malformed template parameters.
vi: Truy vấn chứa một hoặc nhiều tham số mẫu không hợp lệ.

source: Please check your query and confirm that all template parameters are surround by double braces, for example, "{{ ds }}". Then, try running your query again.
vi: Vui lòng kiểm tra truy vấn của bạn và xác nhận rằng tất cả các tham số mẫu được bao quanh bởi dấu ngoặc nhọn kép, ví dụ, "{{ ds }}". Sau đó, hãy thử chạy truy vấn của bạn lại.

source: Tag name is invalid (cannot contain ':')
vi: Tên thẻ không hợp lệ (không thể chứa ':')

source: Tag could not be found.
vi: Không thể tìm thấy thẻ.

source: Is custom tag
vi: Là thẻ tùy chỉnh

source: Scheduled task executor not found
vi: Không tìm thấy bộ thực hiện nhiệm vụ định kỳ

source: Record Count
vi: Số lượng bản ghi

source: No records found
vi: Không tìm thấy bản ghi nào

source: Filter List
vi: Danh sách bộ lọc

source: Search
vi: Tìm kiếm

source: Refresh
vi: Làm mới

source: Import dashboards
vi: Nhập báo cáo

source: Import Dashboard(s)
vi: Nhập Báo cáo(s)

source: File
vi: Tệp

source: Choose File
vi: Chọn Tệp

source: Upload
vi: Tải lên

source: Use the edit button to change this field
vi: Sử dụng nút chỉnh sửa để thay đổi trường này

source: Test Connection
vi: Kiểm tra kết nối

source: Unsupported clause type: %(clause)s
vi: Loại mệnh đề không được hỗ trợ: %(clause)s

source: Invalid metric object: %(metric)s
vi: Đối tượng số liệu không hợp lệ: %(metric)s

source: Unable to calculate such a date delta
vi: Không thể tính toán một biên độ thời gian như vậy

source: Unable to find such a holiday: [%(holiday)s]
vi: Không thể tìm thấy ngày lễ như vậy: [%(holiday)s]

source: DB column %(col_name)s has unknown type: %(value_type)s
vi: Cột DB %(col_name)s có loại không xác định: %(value_type)s

source: percentiles must be a list or tuple with two numeric values, of which the first is lower than the second value
vi: percentiles phải là một danh sách hoặc bộ có hai giá trị số, trong đó giá trị đầu tiên thấp hơn giá trị thứ hai

source: `compare_columns` must have the same length as `source_columns`.
vi: `compare_columns` phải có cùng độ dài với `source_columns`.

source: `compare_type` must be `difference`, `percentage` or `ratio`
vi: `compare_type` phải là `difference`, `percentage` hoặc `ratio`

source: Column "%(column)s" is not numeric or does not exists in the query results.
vi: Cột "%(column)s" không phải là số hoặc không tồn tại trong kết quả truy vấn.

source: `rename_columns` must have the same length as `columns`.
vi: `rename_columns` phải có cùng độ dài với `columns`.

source: Invalid cumulative operator: %(operator)s
vi: Toán tử tích lũy không hợp lệ: %(operator)s

source: Invalid geohash string
vi: Chuỗi geohash không hợp lệ

source: Invalid longitude/latitude
vi: Kinh độ/vĩ độ không hợp lệ

source: Invalid geodetic string
vi: Chuỗi địa lý không hợp lệ

source: Pivot operation requires at least one index
vi: Phép xoay cần ít nhất một chỉ mục

source: Pivot operation must include at least one aggregate
vi: Phép xoay phải bao gồm ít nhất một tổng hợp

source: `prophet` package not installed
vi: Gói `prophet` chưa được cài đặt

source: Time grain missing
vi: Đơn vị thời gian bị thiếu

source: Unsupported time grain: %(time_grain)s
vi: Đơn vị thời gian không được hỗ trợ: %(time_grain)s

source: Periods must be a whole number
vi: Kỳ phải là một số nguyên

source: Confidence interval must be between 0 and 1 (exclusive)
vi: Khoảng tin cậy phải nằm giữa 0 và 1 (không bao gồm)

source: DataFrame must include temporal column
vi: DataFrame phải bao gồm cột thời gian

source: DataFrame include at least one series
vi: DataFrame phải bao gồm ít nhất một dãy số

source: Label already exists
vi: Nhãn đã tồn tại

source: Resample operation requires DatetimeIndex
vi: Phép tái mẫu yêu cầu chỉ mục Datetime

source: Resample method should be in
vi: Phương pháp tái mẫu phải nằm trong

source: Undefined window for rolling operation
vi: Cửa sổ không xác định cho phép lăn

source: Window must be > 0
vi: Cửa sổ phải > 0

source: Invalid rolling_type: %(type)s
vi: Loại phép lăn không hợp lệ: %(type)s

source: Invalid options for %(rolling_type)s: %(options)s
vi: Tùy chọn không hợp lệ cho %(rolling_type)s: %(options)s

source: Referenced columns not available in DataFrame.
vi: Các cột được tham chiếu không có sẵn trong DataFrame.

source: Column referenced by aggregate is undefined: %(column)s
vi: Cột được tham chiếu bởi tổng hợp không được xác định: %(column)s

source: Operator undefined for aggregator: %(name)s
vi: Toán tử không xác định cho bộ tổng hợp: %(name)s

source: Invalid numpy function: %(operator)s
vi: Hàm numpy không hợp lệ: %(operator)s

source: Unexpected time range: %(error)s
vi: Phạm vi thời gian không mong muốn: %(error)s

source: json isn't valid
vi: json không hợp lệ

source: Export to YAML
vi: Xuất ra YAML

source: Export to YAML?
vi: Xuất ra YAML?

source: Delete
vi: Xóa

source: Delete all Really?
vi: Thực sự xóa tất cả?

source: Is favorite
vi: Là yêu thích

source: Is tagged
vi: Được gắn thẻ

source: The data source seems to have been deleted
vi: Cơ sở dữ liệu có vẻ đã bị xóa

source: The user seems to have been deleted
vi: Người dùng có vẻ đã bị xóa

source: You don't have the rights to download as csv
vi: Bạn không có quyền tải xuống dưới dạng csv

source: Error: permalink state not found
vi: Lỗi: trạng thái liên kết cố định không tìm thấy

source: Error: %(msg)s
vi: Lỗi: %(msg)s

source: You don't have the rights to alter this chart
vi: Bạn không có quyền sửa đổi biểu đồ này

source: You don't have the rights to create a chart
vi: Bạn không có quyền tạo biểu đồ

source: Explore - %(table)s
vi: Khám phá - %(table)s

source: Explore
vi: Khám phá

source: Chart [{}] has been saved
vi: Biểu đồ [{}] đã được lưu

source: Chart [{}] has been overwritten
vi: Biểu đồ [{}] đã bị ghi đè

source: You don't have the rights to alter this dashboard
vi: Bạn không có quyền sửa đổi báo cáo này

source: Chart [{}] was added to dashboard [{}]
vi: Biểu đồ [{}] đã được thêm vào báo cáo [{}]

source: You don't have the rights to create a dashboard
vi: Bạn không có quyền tạo báo cáo

source: Dashboard [{}] just got created and chart [{}] was added to it
vi: Báo cáo [{}] vừa được tạo và biểu đồ [{}] đã được thêm vào nó

source: Malformed request. slice_id or table_name and db_name arguments are expected
vi: Yêu cầu không hợp lệ. Đang mong đợi các đối số slice_id hoặc table_name và db_name

source: Chart %(id)s not found
vi: Không tìm thấy biểu đồ %(id)s

source: Table %(table)s wasn't found in the database %(db)s
vi: Không tìm thấy bảng %(table)s trong cơ sở dữ liệu %(db)s

source: permalink state not found
vi: Không tìm thấy trạng thái liên kết cố định

source: Show CSS Template
vi: Hiển thị mẫu CSS

source: Add CSS Template
vi: Thêm mẫu CSS

source: Edit CSS Template
vi: Chỉnh sửa mẫu CSS

source: Template Name
vi: Tên mẫu

source: A human-friendly name
vi: Một tên thân thiện với con người

source: Used internally to identify the plugin. Should be set to the package name from the pluginʼs package.json
vi: Được sử dụng bên trong để xác định plugin. Nên được đặt thành tên gói từ package.json của plugin.

source: A full URL pointing to the location of the built plugin (could be hosted on a CDN for example)
vi: Một URL đầy đủ chỉ đến vị trí của plugin đã được xây dựng (có thể được lưu trữ trên một CDN ví dụ)

source: Custom Plugins
vi: Các Plugin Tùy chỉnh

source: Custom Plugin
vi: Plugin Tùy chỉnh

source: Add a Plugin
vi: Thêm một Plugin

source: Edit Plugin
vi: Chỉnh sửa Plugin

source: The dataset associated with this chart no longer exists
vi: Tập dữ liệu liên quan đến biểu đồ này không còn tồn tại nữa

source: Could not determine datasource type
vi: Không thể xác định loại nguồn dữ liệu

source: Could not find viz object
vi: Không thể tìm thấy đối tượng viz

source: Show Chart
vi: Hiển thị Biểu đồ

source: Add Chart
vi: Thêm Biểu đồ

source: Edit Chart
vi: Chỉnh sửa Biểu đồ

source: These parameters are generated dynamically when clicking the save or overwrite button in the explore view. This JSON object is exposed here for reference and for power users who may want to alter specific parameters.
vi: Các tham số này được tạo động khi nhấp vào nút lưu hoặc ghi đè trong chế độ xem khám phá. Đối tượng JSON này được hiển thị ở đây để tham khảo và cho người dùng mạnh mẽ có thể muốn thay đổi các tham số cụ thể.

source: Duration (in seconds) of the caching timeout for this chart. Note this defaults to the datasource/table timeout if undefined.
vi: Thời gian chờ lưu trữ (theo giây) cho biểu đồ này. Lưu ý rằng mặc định này sẽ được sử dụng nếu không xác định cho thời gian chờ lưu trữ của nguồn dữ liệu/bảng.

source: Creator
vi: Người tạo

source: Datasource
vi: Nguồn dữ liệu

source: Last Modified
vi: Sửa đổi Lần cuối

source: Parameters
vi: Tham số

source: Chart
vi: Biểu đồ

source: Name
vi: Tên

source: Visualization Type
vi: Loại Trực quan hóa

source: Show Dashboard
vi: Hiển thị Báo cáo

source: Add Dashboard
vi: Thêm Báo cáo

source: Edit Dashboard
vi: Chỉnh sửa Báo cáo

source: This json object describes the positioning of the widgets in the dashboard. It is dynamically generated when adjusting the widgets size and positions by using drag & drop in the dashboard view
vi: Đối tượng JSON này mô tả vị trí của các tiện ích trên báo cáo. Nó được tạo động khi điều chỉnh kích thước và vị trí của các tiện ích bằng cách kéo và thả trong chế độ xem báo cáo.

source: The CSS for individual dashboards can be altered here, or in the dashboard view where changes are immediately visible
vi: CSS cho các báo cáo cá nhân có thể được điều chỉnh ở đây, hoặc trong chế độ xem báo cáo nơi các thay đổi được hiển thị ngay lập tức

source: To get a readable URL for your dashboard
vi: Để có một URL đọc được cho báo cáo của bạn

source: This JSON object is generated dynamically when clicking the save or overwrite button in the dashboard view. It is exposed here for reference and for power users who may want to alter specific parameters.
vi: Đối tượng JSON này được tạo ra động khi nhấp vào nút lưu hoặc ghi đè trong chế độ xem báo cáo. Nó được hiển thị ở đây để tham khảo và cho người dùng có quyền sức mạnh có thể muốn thay đổi các tham số cụ thể.

source: Owners is a list of users who can alter the dashboard.
vi: Danh sách chủ sở hữu là danh sách của người dùng có thể thay đổi báo cáo.

source: Roles is a list which defines access to the dashboard. Granting a role access to a dashboard will bypass dataset level checks.If no roles are defined, regular access permissions apply.
vi: Roles là một danh sách xác định quyền truy cập vào báo cáo. Cấp quyền truy cập cho một vai trò vào một báo cáo sẽ bỏ qua các kiểm tra cấp độ tập dữ liệu. Nếu không có vai trò nào được xác định, các quyền truy cập thông thường sẽ được áp dụng.

source: Determines whether or not this dashboard is visible in the list of all dashboards
vi: Xác định liệu báo cáo này có hiển thị trong danh sách của tất cả các báo cáo hay không

source: Dashboard
vi: Báo cáo

source: Title
vi: Tiêu đề

source: Roles
vi: Vai trò

source: Published
vi: Đã xuất bản

source: Position JSON
vi: Vị trí JSON

source: JSON Metadata
vi: Dữ liệu siêu JSON

source: Export
vi: Xuất

source: Export dashboards?
vi: Xuất các báo cáo?

source: CSV Upload
vi: Tải lên CSV

source: Select a file to be uploaded to the database
vi: Chọn một tệp để tải lên cơ sở dữ liệu

source: Only the following file extensions are allowed: %(allowed_extensions)s
vi: Chỉ các phần mở rộng tệp sau được phép: %(allowed_extensions)s

source: Name of table to be created with CSV file
vi: Tên của bảng được tạo ra với tệp CSV

source: Table name cannot contain a schema
vi: Tên bảng không thể chứa schema

source: Select a database to upload the file to
vi: Chọn một cơ sở dữ liệu để tải tệp lên

source: Column Data Types
vi: Kiểu dữ liệu của cột

source: A dictionary with column names and their data types if you need to change the defaults. Example: {"user_id":"int"}. Check Python's Pandas library for supported data types.
vi: Một từ điển với tên cột và các loại dữ liệu của chúng nếu bạn cần thay đổi các giá trị mặc định. Ví dụ: {"user_id":"int"}. Kiểm tra thư viện Pandas của Python để biết các loại dữ liệu được hỗ trợ.

source: Select a schema if the database supports this
vi: Chọn một schema nếu cơ sở dữ liệu hỗ trợ điều này

source: Enter a delimiter for this data
vi: Nhập một ký tự phân tách cho dữ liệu này

source: Other
vi: Khác

source: If Table Already Exists
vi: Nếu Bảng Đã Tồn Tại

source: What should happen if the table already exists
vi: Điều gì sẽ xảy ra nếu bảng đã tồn tại

source: Fail
vi: Thất bại

source: Replace
vi: Thay thế

source: Append
vi: Thêm vào

source: Skip Initial Space
vi: Bỏ qua khoảng trắng ban đầu

source: Skip spaces after delimiter
vi: Bỏ qua khoảng trắng sau dấu phân tách

source: Skip Blank Lines
vi: Bỏ qua dòng trống

source: Skip blank lines rather than interpreting them as Not A Number values
vi: Bỏ qua các dòng trống thay vì hiểu chúng là các giá trị Not A Number

source: Columns To Be Parsed as Dates
vi: Các cột được phân tích dưới dạng ngày tháng

source: A comma separated list of columns that should be parsed as dates
vi: Một danh sách các cột được phân cách bằng dấu phẩy mà nên được phân tích dưới dạng ngày tháng

source: Day First
vi: Ngày Đầu tiên

source: DD/MM format dates, international and European format
vi: Ngày tháng định dạng DD/MM, định dạng quốc tế và châu Âu

source: Decimal Character
vi: Ký tự thập phân

source: Character to interpret as decimal point
vi: Ký tự để hiểu là dấu thập phân

source: Null Values
vi: Giá trị Null

source: Index Column
vi: Cột chỉ mục

source: Column to use as the row labels of the dataframe. Leave empty if no index column
vi: Cột được sử dụng làm nhãn hàng của dataframe. Để trống nếu không có cột chỉ mục

source: Dataframe Index
vi: Chỉ mục của DataFrame

source: Write dataframe index as a column
vi: Viết chỉ mục của dataframe dưới dạng cột

source: Column Label(s)
vi: Nhãn cột

source: Column label for index column(s). If None is given and Dataframe Index is checked, Index Names are used
vi: Nhãn cột cho các cột chỉ mục. Nếu không có gì và Chỉ mục của DataFrame được kiểm tra, Tên chỉ mục sẽ được sử dụng

source: Columns To Read
vi: Các cột cần đọc

source: Json list of the column names that should be read
vi: Danh sách JSON các tên cột cần đọc

source: Overwrite Duplicate Columns
vi: Ghi đè Cột Trùng lặp

source: If duplicate columns are not overridden, they will be presented as "X.1, X.2 ...X.x"
vi: Nếu các cột trùng lặp không được ghi đè, chúng sẽ được hiển thị dưới dạng "X.1, X.2 ...X.x"

source: Header Row
vi: Dòng Đầu

source: Row containing the headers to use as column names (0 is first line of data). Leave empty if there is no header row
vi: Dòng chứa tiêu đề được sử dụng làm tên cột (0 là dòng đầu tiên của dữ liệu). Để trống nếu không có dòng tiêu đề

source: Rows to Read
vi: Số dòng cần đọc

source: Number of rows of file to read
vi: Số dòng của tệp cần đọc

source: Skip Rows
vi: Bỏ qua Dòng

source: Number of rows to skip at start of file
vi: Số dòng cần bỏ qua ở đầu tệp

source: Name of table to be created from excel data.
vi: Tên của bảng được tạo từ dữ liệu excel.

source: Excel File
vi: Tệp Excel

source: Select a Excel file to be uploaded to a database.
vi: Chọn một tệp Excel để tải lên cơ sở dữ liệu.

source: Sheet Name
vi: Tên Sheet

source: Strings used for sheet names (default is the first sheet).
vi: Chuỗi được sử dụng cho tên sheet (mặc định là sheet đầu tiên).

source: Specify a schema (if database flavor supports this).
vi: Chỉ định một schema (nếu hương vị cơ sở dữ liệu hỗ trợ điều này).

source: Table Exists
vi: Bảng Tồn Tại

source: If table exists do one of the following: Fail (do nothing), Replace (drop and recreate table) or Append (insert data).
vi: Nếu bảng đã tồn tại, làm một trong các điều sau: Fail (không làm gì), Replace (xóa và tạo lại bảng) hoặc Append (chèn dữ liệu).

source: Row containing the headers to use as column names (0 is first line of data). Leave empty if there is no header row.
vi: Dòng chứa tiêu đề để sử dụng làm tên cột (0 là dòng đầu tiên của dữ liệu). Để trống nếu không có dòng tiêu đề.

source: Column to use as the row labels of the dataframe. Leave empty if no index column.
vi: Cột được sử dụng làm nhãn dòng của khung dữ liệu. Để trống nếu không có cột chỉ mục.

source: Number of rows to skip at start of file.
vi: Số dòng cần bỏ qua ở đầu tệp.

source: Number of rows of file to read.
vi: Số dòng của tệp cần đọc.

source: Parse Dates
vi: Phân tích Ngày tháng

source: A comma separated list of columns that should be parsed as dates.
vi: Một danh sách các cột cách nhau bằng dấu phẩy mà nên được phân tích dưới dạng ngày tháng.

source: Character to interpret as decimal point.
vi: Ký tự được hiểu là dấu thập phân.

source: Write dataframe index as a column.
vi: Viết chỉ mục của dataframe dưới dạng cột.

source: Column label for index column(s). If None is given and Dataframe Index is True, Index Names are used.
vi: Nhãn cột cho các cột chỉ mục. Nếu None được cung cấp và Dataframe Index là Đúng, Tên chỉ mục sẽ được sử dụng.

source: Null values
vi: Giá trị null

source: Json list of the values that should be treated as null. Examples: [""], ["None", "N/A"], ["nan", "null"]. Warning: Hive database supports only single value. Use [""] for empty string.
vi: Danh sách JSON các giá trị nên được xem như null. Ví dụ: [""], ["None", "N/A"], ["nan", "null"]. Cảnh báo: Cơ sở dữ liệu Hive chỉ hỗ trợ một giá trị duy nhất. Sử dụng [""] cho chuỗi rỗng.

source: Name of table to be created from columnar data.
vi: Tên của bảng được tạo từ dữ liệu cột.

source: Columnar File
vi: Tệp Dạng Cột

source: Select a Columnar file to be uploaded to a database.
vi: Chọn một tệp dạng cột để tải lên cơ sở dữ liệu.

source: Use Columns
vi: Sử dụng Cột

source: Json list of the column names that should be read. If not None, only these columns will be read from the file.
vi: Danh sách JSON các tên cột cần đọc. Nếu không phải None, chỉ có những cột này sẽ được đọc từ tệp.

source: Databases
vi: Cơ sở dữ liệu

source: Show Database
vi: Hiển thị Cơ sở dữ liệu

source: Add Database
vi: Thêm Cơ sở dữ liệu

source: Edit Database
vi: Chỉnh sửa Cơ sở dữ liệu

source: Expose this DB in SQL Lab
vi: Tiết lộ cơ sở dữ liệu này trong SQL Lab

source: Operate the database in asynchronous mode, meaning that the queries are executed on remote workers as opposed to on the web server itself. This assumes that you have a Celery worker setup as well as a results backend. Refer to the installation docs for more information.
vi: Vận hành cơ sở dữ liệu ở chế độ bất đồng bộ, có nghĩa là các truy vấn được thực hiện trên các máy chủ từ xa thay vì trên máy chủ web chính. Điều này giả định rằng bạn đã cài đặt một công cụ Celery cũng như một kết quả backend. Tham khảo tài liệu cài đặt để biết thêm thông tin.

source: Allow CREATE TABLE AS option in SQL Lab
vi: Cho phép tùy chọn TẠO BẢNG NHƯ trong SQL Lab

source: Allow CREATE VIEW AS option in SQL Lab
vi: Cho phép tùy chọn TẠO XEM NHƯ trong SQL Lab

source: Allow users to run non-SELECT statements (UPDATE, DELETE, CREATE, ...) in SQL Lab
vi: Cho phép người dùng chạy các câu lệnh không phải SELECT (UPDATE, DELETE, CREATE, ...) trong SQL Lab
