Repository: KOVA-Data/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: vi

source: Force all tables and views to be created in this schema when clicking CTAS or CVAS in SQL Lab.
vi: Ép buộc tất cả các bảng và chế độ xem được tạo trong schema này khi nhấp vào CTAS hoặc CVAS trong SQL Lab.

source: Allow manipulation of the database using non-SELECT statements such as UPDATE, DELETE, CREATE, etc.
vi: Cho phép thao tác cơ sở dữ liệu bằng các lệnh không phải SELECT như UPDATE, DELETE, CREATE, v.v.

source: Enable query cost estimation
vi: Bật ước tính chi phí truy vấn

source: For Bigquery, Presto and Postgres, shows a button to compute cost before running a query.
vi: Đối với Bigquery, Presto và Postgres, hiển thị một nút để tính toán chi phí trước khi chạy một truy vấn.

source: Allow this database to be explored
vi: Cho phép khám phá cơ sở dữ liệu này

source: When enabled, users are able to visualize SQL Lab results in Explore.
vi: Khi được bật, người dùng có thể trực quan hóa kết quả của SQL Lab trong Explore.

source: Disable SQL Lab data preview queries
vi: Tắt truy vấn xem trước dữ liệu của SQL Lab

source: Disable data preview when fetching table metadata in SQL Lab. Useful to avoid browser performance issues when using databases with very wide tables.
vi: Tắt xem trước dữ liệu khi lấy dữ liệu meta bảng trong SQL Lab. Hữu ích để tránh vấn đề về hiệu suất trình duyệt khi sử dụng cơ sở dữ liệu với các bảng rất rộng.

source: Enable row expansion in schemas
vi: Bật mở rộng hàng trong các schema

source: For Trino, describe full schemas of nested ROW types, expanding them with dotted paths
vi: Đối với Trino, mô tả các schema đầy đủ của các loại ROW lồng nhau, mở rộng chúng với các đường dẫn chấm.

source: Performance
vi: Hiệu suất

source: Adjust performance settings of this database.
vi: Điều chỉnh cài đặt hiệu suất của cơ sở dữ liệu này.

source: Chart cache timeout
vi: Thời gian chờ bộ nhớ cache biểu đồ

source: Enter duration in seconds
vi: Nhập thời gian theo giây

source: Duration (in seconds) of the caching timeout for charts of this database. A timeout of 0 indicates that the cache never expires, and -1 bypasses the cache. Note this defaults to the global timeout if undefined.
vi: Thời gian (tính bằng giây) của thời gian chờ lưu trữ cho bộ nhớ cache biểu đồ của cơ sở dữ liệu này. Một thời gian chờ là 0 cho biết rằng bộ nhớ cache không bao giờ hết hạn, và -1 bỏ qua bộ nhớ cache. Lưu ý rằng điều này mặc định cho thời gian chờ toàn cầu nếu không xác định.

source: Schema cache timeout
vi: Thời gian chờ bộ nhớ cache schema

source: Duration (in seconds) of the metadata caching timeout for schemas of this database. If left unset, the cache never expires.
vi: Thời gian (tính bằng giây) của thời gian chờ lưu trữ dữ liệu meta cho các schema của cơ sở dữ liệu này. Nếu để trống, bộ nhớ cache không bao giờ hết hạn.

source: Table cache timeout
vi: Thời gian chờ bộ nhớ cache bảng

source: Duration (in seconds) of the metadata caching timeout for tables of this database. If left unset, the cache never expires.
vi: Thời gian (tính bằng giây) của thời gian chờ lưu trữ dữ liệu meta cho các bảng của cơ sở dữ liệu này. Nếu để trống, bộ nhớ cache không bao giờ hết hạn.

source: Asynchronous query execution
vi: Thực thi truy vấn bất đồng bộ

source: Cancel query on window unload event
vi: Hủy truy vấn khi sự kiện window unload xảy ra

source: Terminate running queries when browser window closed or navigated to another page. Available for Presto, Hive, MySQL, Postgres and Snowflake databases.
vi: Chấm dứt các truy vấn đang chạy khi cửa sổ trình duyệt bị đóng hoặc điều hướng đến trang khác. Có sẵn cho các cơ sở dữ liệu Presto, Hive, MySQL, Postgres và Snowflake.

source: Add extra connection information.
vi: Thêm thông tin kết nối phụ.

source: Secure extra
vi: Bảo mật bổ sung

source: JSON string containing additional connection configuration. This is used to provide connection information for systems like Hive, Presto and BigQuery which do not conform to the username:password syntax normally used by SQLAlchemy.
vi: Chuỗi JSON chứa cấu hình kết nối bổ sung. Điều này được sử dụng để cung cấp thông tin kết nối cho các hệ thống như Hive, Presto và BigQuery không tuân thủ cú pháp tên người dùng: mật khẩu thường được sử dụng bởi SQLAlchemy.

source: Enter CA_BUNDLE
vi: Nhập CA_BUNDLE

source: Optional CA_BUNDLE contents to validate HTTPS requests. Only available on certain database engines.
vi: Nội dung CA_BUNDLE tùy chọn để xác minh các yêu cầu HTTPS. Chỉ có sẵn trên một số động cơ cơ sở dữ liệu cụ thể.

source: Impersonate logged in user (Presto, Trino, Drill, Hive, and GSheets)
vi: Mô phỏng người dùng đăng nhập (Presto, Trino, Drill, Hive và GSheets)

source: If Presto or Trino, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them. If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
vi: Nếu Presto hoặc Trino, tất cả các truy vấn trong SQL Lab sẽ được thực thi dưới dạng người dùng hiện đang đăng nhập, người đó phải có quyền để chạy chúng. Nếu Hive và hive.server2.enable.doAs được kích hoạt, các truy vấn sẽ được thực thi dưới dạng tài khoản dịch vụ, nhưng mô phỏng người dùng hiện đang đăng nhập thông qua thuộc tính hive.server2.proxy.user.

source: Allow file uploads to database
vi: Cho phép tải lên tệp vào cơ sở dữ liệu

source: Schemas allowed for File upload
vi: Các lược đồ được phép cho tải lên tệp

source: A comma-separated list of schemas that files are allowed to upload to.
vi: Một danh sách các lược đồ được phân tách bằng dấu phẩy mà các tệp được phép tải lên.

source: Additional settings.
vi: Cài đặt bổ sung.

source: Metadata Parameters
vi: Tham số siêu dữ liệu

source: The metadata_params object gets unpacked into the sqlalchemy.MetaData call.
vi: Đối tượng metadata_params được giải nén vào cuộc gọi sqlalchemy.MetaData.

source: Engine Parameters
vi: Tham số động cơ

source: The engine_params object gets unpacked into the sqlalchemy.create_engine call.
vi: Đối tượng engine_params được giải nén vào cuộc gọi sqlalchemy.create_engine.

source: Version
vi: Phiên bản

source: Version number
vi: Số phiên bản

source: Specify the database version. This is used with Presto for query cost estimation, and Dremio for syntax changes, among others.
vi: Chỉ định phiên bản cơ sở dữ liệu. Điều này được sử dụng với Presto để ước lượng chi phí truy vấn và với Dremio cho các thay đổi cú pháp, giữa các thứ khác.

source: Disable drill to detail
vi: Tắt tính năng xem chi tiết

source: Disables the drill to detail feature for this database.
vi: Vô hiệu hóa tính năng xem chi tiết cho cơ sở dữ liệu này.

source: STEP %(stepCurr)s OF %(stepLast)s
vi: BƯỚC %(stepCurr)s TRONG SỐ %(stepLast)s

source: Enter Primary Credentials
vi: Nhập thông tin đăng nhập chính

source: Need help? Learn how to connect your database
vi: Cần trợ giúp? Học cách kết nối cơ sở dữ liệu của bạn

source: Database connected
vi: Đã kết nối cơ sở dữ liệu

source: Create a dataset to begin visualizing your data as a chart or go to SQL Lab to query your data.
vi: Tạo một bộ dữ liệu để bắt đầu hiển thị dữ liệu của bạn dưới dạng biểu đồ hoặc đi tới SQL Lab để truy vấn dữ liệu của bạn.

source: Enter the required %(dbModelName)s credentials
vi: Nhập thông tin đăng nhập %(dbModelName)s cần thiết

source: Need help? Learn more about
vi: Cần trợ giúp? Tìm hiểu thêm về

source: connecting to %(dbModelName)s.
vi: kết nối đến %(dbModelName)s.

source: Select a database to connect
vi: Chọn một cơ sở dữ liệu để kết nối

source: SSH Host
vi: Máy chủ SSH

source: e.g. 127.0.0.1
vi: ví dụ: 127.0.0.1

source: SSH Port
vi: Cổng SSH

source: e.g. Analytics
vi: ví dụ: Phân tích

source: Login with
vi: Đăng nhập bằng

source: Private Key & Password
vi: Khóa riêng tư và Mật khẩu

source: SSH Password
vi: Mật khẩu SSH

source: e.g. ********
vi: ví dụ: ********

source: Private Key
vi: Khóa riêng tư

source: Paste Private Key here
vi: Dán Khóa Riêng Tư vào đây

source: Private Key Password
vi: Mật khẩu Khóa Riêng Tư

source: SSH Tunnel
vi: Đường hầm SSH

source: SSH Tunnel configuration parameters
vi: Tham số cấu hình đường hầm SSH

source: Display Name
vi: Tên hiển thị

source: Name your database
vi: Đặt tên cho cơ sở dữ liệu của bạn

source: Pick a name to help you identify this database.
vi: Chọn một tên để giúp bạn xác định cơ sở dữ liệu này.

source: dialect+driver://username:password@host:port/database
vi: dialekt+driver://tên_người_dùng:mật_khẩu@host:cổng/cơ_sở_dữ_liệu

source: Refer to the
vi: Xem chi tiết tại

source: for more information on how to structure your URI.
vi: để biết thêm thông tin về cách cấu trúc URI của bạn.

source: Test connection
vi: Kiểm tra kết nối

source: Please enter a SQLAlchemy URI to test
vi: Vui lòng nhập URI SQLAlchemy để kiểm tra

source: e.g. world_population
vi: ví dụ: world_population

source: Connection failed, please check your connection settings.
vi: Kết nối thất bại, vui lòng kiểm tra cài đặt kết nối của bạn.

source: Database settings updated
vi: Cài đặt cơ sở dữ liệu đã được cập nhật

source: Sorry there was an error fetching database information: %s
vi: Xin lỗi, có lỗi khi lấy thông tin cơ sở dữ liệu: %s

source: Or choose from a list of other databases we support:
vi: Hoặc chọn từ danh sách các cơ sở dữ liệu khác mà chúng tôi hỗ trợ:

source: Supported databases
vi: Các cơ sở dữ liệu được hỗ trợ

source: Choose a database...
vi: Chọn một cơ sở dữ liệu...

source: Want to add a new database?
vi: Muốn thêm một cơ sở dữ liệu mới không?

source: Any databases that allow connections via SQL Alchemy URIs can be added.
vi: Bất kỳ cơ sở dữ liệu nào cho phép kết nối qua URI SQL Alchemy đều có thể được thêm vào.

source: Any databases that allow connections via SQL Alchemy URIs can be added. Learn about how to connect a database driver
vi: Bất kỳ cơ sở dữ liệu nào cho phép kết nối qua URI SQL Alchemy đều có thể được thêm vào. Tìm hiểu về cách kết nối một trình điều khiển cơ sở dữ liệu

source: Connect
vi: Kết nối

source: Finish
vi: Hoàn tất

source: This database is managed externally, and can't be edited in Superset
vi: Cơ sở dữ liệu này được quản lý từ bên ngoài và không thể chỉnh sửa trong Superset

source: The passwords for the databases below are needed in order to import them. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in explore files and should be added manually after the import if they are needed.
vi: Các mật khẩu cho các cơ sở dữ liệu dưới đây cần được nhập để nhập chúng. Vui lòng lưu ý rằng các phần "Secure Extra" và "Certificate" của cấu hình cơ sở dữ liệu không có trong tệp khám phá và cần được thêm vào thủ công sau khi nhập nếu cần.

source: You are importing one or more databases that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
vi: Bạn đang nhập một hoặc nhiều cơ sở dữ liệu đã tồn tại. Ghi đè có thể làm mất một số công việc của bạn. Bạn có chắc muốn ghi đè không?

source: Database Creation Error
vi: Lỗi Tạo Cơ sở dữ liệu

source: We are unable to connect to your database. Click "See more" for database-provided information that may help troubleshoot the issue.
vi: Chúng tôi không thể kết nối vào cơ sở dữ liệu của bạn. Nhấp vào "Xem thêm" để xem thông tin được cung cấp bởi cơ sở dữ liệu có thể giúp sửa lỗi.

source: CREATE DATASET
vi: TẠO BỘ DỮ LIỆU

source: QUERY DATA IN SQL LAB
vi: TRUY VẤN DỮ LIỆU TRONG SQL LAB

source: Connect a database
vi: Kết nối cơ sở dữ liệu

source: Edit database
vi: Chỉnh sửa cơ sở dữ liệu

source: Connect this database using the dynamic form instead
vi: Kết nối cơ sở dữ liệu này bằng biểu mẫu động thay vì vậy

source: Additional fields may be required
vi: Có thể cần thêm các trường bổ sung

source: Import database from file
vi: Nhập cơ sở dữ liệu từ tệp

source: Connect this database with a SQLAlchemy URI string instead
vi: Kết nối cơ sở dữ liệu này bằng chuỗi URI SQLAlchemy thay vì vậy

source: Click this link to switch to an alternate form that allows you to input the SQLAlchemy URL for this database manually.
vi: Nhấp vào liên kết này để chuyển sang một biểu mẫu thay thế cho phép bạn nhập URL SQLAlchemy cho cơ sở dữ liệu này thủ công.

source: This can be either an IP address (e.g. 127.0.0.1) or a domain name (e.g. mydatabase.com).
vi: Điều này có thể là địa chỉ IP (ví dụ: 127.0.0.1) hoặc tên miền (ví dụ: mydatabase.com).

source: Host
vi: Máy chủ

source: e.g. 5432
vi: ví dụ: 5432

source: Port
vi: Cổng

source: e.g. sql/protocolv1/o/12345
vi: ví dụ: sql/protocolv1/o/12345

source: Copy the name of the HTTP Path of your cluster.
vi: Sao chép tên đường dẫn HTTP của cụm của bạn.

source: Copy the name of the database you are trying to connect to.
vi: Sao chép tên của cơ sở dữ liệu mà bạn đang cố kết nối.

source: Access token
vi: Token truy cập

source: Pick a nickname for how the database will display in Superset.
vi: Chọn một biệt danh cho cách hiển thị cơ sở dữ liệu trong Superset.

source: e.g. param1=value1&param2=value2
vi: ví dụ: param1=giá_trị1&param2=giá_trị2

source: Additional Parameters
vi: Các tham số bổ sung

source: Add additional custom parameters
vi: Thêm các tham số tùy chỉnh bổ sung

source: SSL Mode "require" will be used.
vi: Chế độ SSL "yêu cầu" sẽ được sử dụng.

source: Type of Google Sheets allowed
vi: Loại Google Sheets được phép

source: Publicly shared sheets only
vi: Chỉ có bảng đã được chia sẻ công khai

source: Public and privately shared sheets
vi: Bảng đã được chia sẻ công khai và riêng tư

source: How do you want to enter service account credentials?
vi: Bạn muốn nhập thông tin xác thực tài khoản dịch vụ như thế nào?

source: Upload JSON file
vi: Tải lên tệp JSON

source: Copy and Paste JSON credentials
vi: Sao chép và Dán thông tin xác thực JSON

source: Service Account
vi: Tài khoản dịch vụ

source: Paste content of service credentials JSON file here
vi: Dán nội dung của tệp JSON thông tin xác thực dịch vụ vào đây

source: Copy and paste the entire service account .json file here
vi: Sao chép và dán toàn bộ tệp .json của tài khoản dịch vụ vào đây

source: Upload Credentials
vi: Tải lên Thông tin xác thực

source: Use the JSON file you automatically downloaded when creating your service account.
vi: Sử dụng tệp JSON bạn đã tải xuống tự động khi tạo tài khoản dịch vụ của bạn.

source: Connect Google Sheets as tables to this database
vi: Kết nối Google Sheets như bảng vào cơ sở dữ liệu này

source: Google Sheet Name and URL
vi: Tên và URL của Bảng Google Sheet

source: Enter a name for this sheet
vi: Nhập tên cho bảng này

source: Paste the shareable Google Sheet URL here
vi: Dán URL Google Sheet có thể chia sẻ vào đây

source: Add sheet
vi: Thêm bảng

source: Copy the identifier of the account you are trying to connect to.
vi: Sao chép định danh của tài khoản mà bạn đang cố kết nối.

source: e.g. xy12345.us-east-2.aws
vi: ví dụ: xy12345.us-east-2.aws

source: e.g. compute_wh
vi: ví dụ: compute_wh

source: e.g. AccountAdmin
vi: ví dụ: AccountAdmin

source: Duplicate dataset
vi: Bộ dữ liệu trùng lặp

source: Duplicate
vi: Trùng lặp

source: New dataset name
vi: Tên bộ dữ liệu mới

source: The passwords for the databases below are needed in order to import them together with the datasets. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
vi: Mật khẩu cho các cơ sở dữ liệu dưới đây là cần thiết để nhập chúng cùng với các bộ dữ liệu. Vui lòng lưu ý rằng các phần "Secure Extra" và "Certificate" của cấu hình cơ sở dữ liệu không có trong các tệp xuất, và nên được thêm vào thủ công sau khi nhập nếu cần.

source: You are importing one or more datasets that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
vi: Bạn đang nhập một hoặc nhiều bộ dữ liệu đã tồn tại. Ghi đè có thể làm mất một số công việc của bạn. Bạn có chắc muốn ghi đè không?

source: Refreshing columns
vi: Đang làm mới cột

source: Table columns
vi: Các cột của bảng

source: Loading
vi: Đang tải

source: This table already has a dataset associated with it. You can only associate one dataset with a table.
vi: Bảng này đã có một bộ dữ liệu được liên kết với nó. Bạn chỉ có thể liên kết một bộ dữ liệu với một bảng.

source: View Dataset
vi: Xem Bộ dữ liệu

source: This table already has a dataset
vi: Bảng này đã có một bộ dữ liệu

source: Datasets can be created from database tables or SQL queries. Select a database table to the left or
vi: Các bộ dữ liệu có thể được tạo từ các bảng cơ sở dữ liệu hoặc truy vấn SQL. Chọn một bảng cơ sở dữ liệu ở bên trái hoặc

source: create dataset from SQL query
vi: tạo bộ dữ liệu từ truy vấn SQL

source: to open SQL Lab. From there you can save the query as a dataset.
vi: để mở SQL Lab. Từ đó bạn có thể lưu truy vấn dưới dạng một bộ dữ liệu.

source: Select dataset source
vi: Chọn nguồn bộ dữ liệu

source: No table columns
vi: Không có cột nào trong bảng

source: This database table does not contain any data. Please select a different table.
vi: Bảng cơ sở dữ liệu này không chứa bất kỳ dữ liệu nào. Vui lòng chọn một bảng khác.

source: An Error Occurred
vi: Đã xảy ra lỗi

source: Unable to load columns for the selected table. Please select a different table.
vi: Không thể tải cột cho bảng đã chọn. Vui lòng chọn một bảng khác.

source: The API response from %s does not match the IDatabaseTable interface.
vi: Phản hồi từ API của %s không khớp với giao diện IDatabaseTable.

source: Usage
vi: Sử dụng

source: Chart owners
vi: Chủ sở hữu biểu đồ

source: Chart last modified
vi: Biểu đồ được sửa đổi lần cuối

source: Chart last modified by
vi: Biểu đồ được sửa đổi lần cuối bởi

source: Dashboard usage
vi: Sử dụng báo cáo

source: Create chart with dataset
vi: Tạo biểu đồ với bộ dữ liệu

source: chart
vi: biểu đồ

source: No charts
vi: Không có biểu đồ

source: This dataset is not used to power any charts.
vi: Bộ dữ liệu này không được sử dụng để tạo bất kỳ biểu đồ nào.

source: Select a database table.
vi: Chọn một bảng cơ sở dữ liệu.

source: Create dataset and create chart
vi: Tạo bộ dữ liệu và tạo biểu đồ

source: New dataset
vi: Bộ dữ liệu mới

source: Select a database table and create dataset
vi: Chọn một bảng cơ sở dữ liệu và tạo bộ dữ liệu

source: dataset name
vi: tên bộ dữ liệu

source: Not defined
vi: Không xác định

source: There was an error fetching dataset
vi: Đã xảy ra lỗi khi truy xuất bộ dữ liệu

source: There was an error fetching dataset's related objects
vi: Đã xảy ra lỗi khi truy xuất các đối tượng liên quan của bộ dữ liệu

source: There was an error loading the dataset metadata
vi: Đã xảy ra lỗi khi tải siêu dữ liệu của bộ dữ liệu

source: [Untitled]
vi: [Chưa đặt tên]

source: Unknown
vi: Không rõ

source: Viewed %s
vi: Đã xem %s

source: Edited
vi: Đã chỉnh sửa

source: Created
vi: Đã tạo

source: Viewed
vi: Đã xem

source: Favorite
vi: Yêu thích

source: Mine
vi: Của tôi

source: View All »
vi: Xem Tất Cả »

source: An error occurred while fetching dashboards: %s
vi: Đã xảy ra lỗi khi truy xuất báo cáo: %s

source: charts
vi: biểu đồ

source: dashboards
vi: báo cáo

source: recents
vi: gần đây

source: saved queries
vi: các truy vấn đã lưu

source: No charts yet
vi: Chưa có biểu đồ nào

source: No dashboards yet
vi: Chưa có báo cáo nào

source: No recents yet
vi: Chưa có gần đây nào

source: No saved queries yet
vi: Chưa có truy vấn đã lưu nào

source: %(other)s charts will appear here
vi: %(other)s biểu đồ sẽ xuất hiện ở đây

source: %(other)s dashboards will appear here
vi: %(other)s báo cáo sẽ xuất hiện ở đây

source: %(other)s recents will appear here
vi: %(other)s gần đây sẽ xuất hiện ở đây

source: %(other)s saved queries will appear here
vi: %(other)s truy vấn đã lưu sẽ xuất hiện ở đây

source: Recently viewed charts, dashboards, and saved queries will appear here
vi: Các biểu đồ, báo cáo và truy vấn đã lưu được xem gần đây sẽ xuất hiện ở đây

source: Recently created charts, dashboards, and saved queries will appear here
vi: Các biểu đồ, báo cáo và truy vấn đã lưu được tạo gần đây sẽ xuất hiện ở đây

source: Recently edited charts, dashboards, and saved queries will appear here
vi: Các biểu đồ, báo cáo và truy vấn đã lưu được chỉnh sửa gần đây sẽ xuất hiện ở đây

source: SQL query
vi: Truy vấn SQL

source: You don't have any favorites yet!
vi: Bạn chưa có mục yêu thích nào!

source: See all %(tableName)s
vi: Xem tất cả %(tableName)s

source: Connect database
vi: Kết nối cơ sở dữ liệu

source: Create dataset
vi: Tạo bộ dữ liệu

source: Connect Google Sheet
vi: Kết nối Google Sheet

source: Upload CSV to database
vi: Tải lên CSV vào cơ sở dữ liệu

source: Upload columnar file to database
vi: Tải lên tệp cột vào cơ sở dữ liệu

source: Upload Excel file to database
vi: Tải lên tệp Excel vào cơ sở dữ liệu

source: Enable 'Allow file uploads to database' in any database's settings
vi: Bật 'Cho phép tải lên tệp vào cơ sở dữ liệu' trong cài đặt của bất kỳ cơ sở dữ liệu nào

source: Info
vi: Thông tin

source: Logout
vi: Đăng xuất

source: About
vi: Thông tin

source: Powered by Apache Superset
vi: Được hỗ trợ bởi Apache Superset

source: Build
vi: Xây dựng

source: Documentation
vi: Tài liệu

source: Report a bug
vi: Báo cáo lỗi

source: Login
vi: Đăng nhập

source: query
vi: truy vấn

source: Deleted: %s
vi: Đã xóa: %s

source: There was an issue deleting %s: %s
vi: Đã xảy ra vấn đề khi xóa %s: %s

source: This action will permanently delete the saved query.
vi: Hành động này sẽ xóa vĩnh viễn truy vấn đã lưu.

source: Delete Query?
vi: Xóa Truy vấn?

source: Ran %s
vi: Chạy %s

source: Saved queries
vi: Các truy vấn đã lưu

source: Next
vi: Tiếp theo

source: Tab name
vi: Tên tab

source: User query
vi: Truy vấn của người dùng

source: Executed query
vi: Truy vấn đã thực hiện

source: Query name
vi: Tên truy vấn

source: SQL Copied!
vi: Đã Sao chép SQL!

source: Sorry, your browser does not support copying.
vi: Xin lỗi, trình duyệt của bạn không hỗ trợ sao chép.

source: There was an issue fetching reports attached to this dashboard.
vi: Đã xảy ra vấn đề khi truy xuất các báo cáo được đính kèm vào báo cáo này.

source: The report has been created
vi: Báo cáo đã được tạo

source: Report updated
vi: Báo cáo đã được cập nhật

source: We were unable to active or deactivate this report.
vi: Chúng tôi không thể kích hoạt hoặc vô hiệu hóa báo cáo này.

source: Your report could not be deleted
vi: Báo cáo của bạn không thể bị xóa

source: Weekly Report for %s
vi: Báo cáo hàng tuần cho %s

source: Weekly Report
vi: Báo cáo hàng tuần

source: Edit email report
vi: Chỉnh sửa báo cáo qua email

source: Schedule a new email report
vi: Lên lịch một báo cáo mới qua email

source: Message content
vi: Nội dung tin nhắn

source: Text embedded in email
vi: Văn bản nhúng trong email

source: Image (PNG) embedded in email
vi: Hình ảnh (PNG) nhúng trong email

source: Formatted CSV attached in email
vi: CSV được định dạng được đính kèm trong email

source: Report Name
vi: Tên báo cáo

source: Include a description that will be sent with your report
vi: Bao gồm một mô tả sẽ được gửi cùng với báo cáo của bạn

source: The report will be sent to your email at
vi: Báo cáo sẽ được gửi đến email của bạn vào

source: Failed to update report
vi: Không thể cập nhật báo cáo

source: Failed to create report
vi: Không thể tạo báo cáo

source: Set up an email report
vi: Thiết lập một báo cáo qua email

source: Email reports active
vi: Báo cáo qua email đang hoạt động

source: Delete email report
vi: Xóa báo cáo qua email

source: Schedule email report
vi: Lên lịch báo cáo qua email

source: This action will permanently delete %s.
vi: Hành động này sẽ xóa vĩnh viễn %s.
